{
    "Write Article": "Write Article",
    "ArticleCreated": "Article successfully created",
    "ArticleNotCreated": "Article can not created",
    "Articles": "Articles",
    "ArticleFaceImage": "Upload a picture for the facial part of the article",
    "Save": "Save",
    "Name": "Name",
    "Description": "Description",
    "WriteArticle": "Write Article",
    "Kompaniya haqida": "About company",
    "Xizmatlar": "Services",
    "Loyihalar": "Projects",
    "goBack": "Go Back",
    "main": "Main",
    "history": "History of Independence",
    "historyDoc": "History documents",
    "articles": "Articles",
    "govermentMembers": "Government Members",
    "sources": "Sources",
    "write": "Write an Article",
    "profile": "Profile",
    "logout": "Logout",
    "login": "Login",
    "media": "Media",
    "books": "Books",
    "autoRefer": "Autoreferats",
    "videoLink": "Click to watch the video",
    "cardFirstHeaderText": "Seek freedom, stand tall, awaken Turkestan!",
    "cardFirstSubText": "The Turkestan Autonomy is the great dream of our ancestors, the pride and honor of the nation! We strive for freedom, justice, and progress! A people yearning for liberty will never be enslaved! Long live independent and autonomous Turkestan!",
    "secondTextCardHeader1": "Long live",
    "secondTextCardHeader2": "Turkestan Autonomy.",
    "secondTextCardSub1": "<p>The Fourth Extraordinary Congress of Turkestan Muslims declares the territorial autonomy of Turkestan, based on the will of the peoples of the region and the principles granted by the Russian Revolution, in federation with the Russian Republic.</p>",
    "secondTextCardSub2": "<p>The form of this autonomy will be determined by the upcoming Constituent Assembly of the entire Turkestan population. Simultaneously, the Congress solemnly declares that the rights of minority nations in Turkestan will be preserved in all respects!</p>",
    "secondTextCardFooter1": "“Shahri Hoqand”",
    "secondTextCardFooter2": "Hijri 1336, 25th of Safar / Gregorian November 27, 1917",
    "cholpon": "Abdulhamid Cho‘lpon",
    "cholponText": "I do not know whose hopes have vanished, In the late hours, the leaves burned red? I do not know whose fate is severed, In the autumn... the soils have turned gray?",
    "munavvar": "Munavvar Qori Abdurashidkhanov",
    "munavvarText": "While European nations soar into the sky, we debate beards and mustaches; while Europeans swim beneath the seas, we argue over long and short garments; European cities are heated and lit entirely by electricity, while we dispute whether to teach geography and medicine in schools... and so it continues.",
    "behbudiy": "Mahmudkhoja Behbudiy",
    "behbudiyText": "Eliminate discord! Do not leave Turkestan's children uneducated! Show everyone the path to freedom! Bring forth liberty swiftly! Only then will we rest peacefully in our graves!",
    "memberAboutFooterText": "<h1>The people are the sea, <span>the people are strength</span></h1>",
    "heading": "Members of the Autonomy Government",
    "subHeading": "Hijri 1336, 25th of Safar, Gregorian November 27, 1917 — “Shahri Hoqand”",
    "membersHeading": "Members of the <span>Autonomy</span> Government",
    "membersSubText": "Active participants in the autonomy movement were included in the Provisional Government of the Turkestan Autonomy. The following individuals became members of the government:",
    "countersSecHeader": "Key Indicators",
    "countersSecSub": "Today, the history of the struggle for the Turkestan Autonomy, an early experience in building a national-democratic state in our country, holds special significance. This history, which has attracted the attention of the scientific community, now evokes not only academic but also practical and even political interest.",
    "historyPageList": {
        "header1": "History of the Turkestan <span>Autonomy</span>",
        "header2": "Active participants of the autonomy movement joined the Provisional Government of the Turkestan Autonomy. The following individuals became members of the government:",
        "text1": "After Uzbekistan gained independence, deep reforms were and are being implemented in all spheres of the republic’s life. The ability of the Uzbek people to determine their own destiny necessitates a scientific study of the national state-building experience and a deeper understanding of the processes connected with national revival. It also requires summarizing the experiences gained on the path of Uzbekistan’s renewal and progress.",
        "text2": "Today, the history of the struggle for the Turkestan Autonomy, which was the first experience in building a national-democratic state in our country, holds special significance. This history, which has attracted the attention of the academic community, is now not only of scientific but also practical and even political interest. This is because reassessments of the events of that era are taking place, and the activities of the political, public figures, and intellectuals of Turkestan in the struggle for freedom and independence are being clarified.",
        "text3": "At the beginning of the 20th century, the Jadids — the ideologists of the autonomy movement — emerged in Turkestan first as a cultural-educational movement and later as a political one, declaring that their goal was to build a secular state. For this, the Jadids committed themselves to reforming the state's economic and political systems and to advancing education and science. However, by choosing this path, they did not intend to abandon national and spiritual values, but rather sought gradual transformation based on them — to free the people from outdated mindsets that had become entrenched in public consciousness. These old ways were hindering state progress and the intellectual growth of the nation.",
        "text4": "In February 1917, the struggle against the Tsarist regime in Russia intensified to such an extent that the system of absolute monarchy collapsed. The Romanov dynasty, which had ruled the Russian Empire uninterruptedly for three centuries, was overthrown. On February 27, 1917, the Council of Workers' and Soldiers' Deputies was established in Petrograd. After that, Soviet power began to be established in major cities of Russia.",
        "text5": "The post-coup period became an important stage in the political awakening and organization of the peoples of Turkestan. These forces, relying on the democratic movements emerging in the former Russian Empire, openly entered into a struggle with their own programs to build statehood, free themselves from colonial oppression within a democratic Russia, and establish a national-territorial autonomy with broad sovereignty. The idea that Uzbeks, Kazakhs, Tajiks, Tatars, Turkmens, and Kyrgyz needed to work together was explained to the people by the supporters of autonomy.",
        "text6": "In 1917, the concept of 'Muxtoriyat,' which meant 'autonomy' associated with the idea of 'self-determination,' became a widely popular term. During this historical period, the Jadids foresaw how difficult it would be for Turkestan to develop independently and the challenges the region would face if it separated from Russia. This was because Turkestan was economically tied to the Russian Empire in many ways. Therefore, the Jadids proposed independent development within a unified economic space under the newly forming Russian Federative Democratic Republic (RFDR). They supported granting Turkestan a broadly empowered national-territorial autonomy, that is, muxtoriyat.",
        "text7": "Progressive thinkers realized that the time had come for a life-or-death struggle for freedom and autonomy. They began to harshly and openly criticize colonialism and abandoned previous ideas of a constitutional monarchy. They demanded that Turkestan be granted the status of a national-territorial autonomous republic within the Russian Democratic Federative Republic. The program documents of the autonomy supporters focused primarily on developing strategies for implementing the principles of national-territorial autonomy. In particular, issues such as forming higher bodies of authority, governing the region, establishing regional courts, and creating state institutions were brought to the agenda.",
        "text8": "In Turkestan, the republican form of government was deemed acceptable as the method of state administration. It was envisioned to establish a democratic society, where democratic rights and freedoms must be protected by constitutional means.",
        "text9": "On November 15, 1917, on the eve of the opening of the Third Congress of Workers', Soldiers', and Peasants' Deputies of the Turkestan Region, it became clear that the congress had fully accepted the responsibility of resolving the issue of forming power in the region. After intense debates among the Bolsheviks, Socialist-Revolutionaries, Socialist-Innovators, and Social Democratic Mensheviks on the principles of establishing authority, the floor was given to Sherali Lapi. In his speech, he introduced the participants to the decision of the Third Congress of Turkestan Muslims regarding the formation of regional power. He stated, 'Muslims could have demanded all power, but by making concessions to outsiders, they allowed their representatives into power' and warned that Muslims were categorically opposed to the rule of only one revolutionary democracy in the region.",
        "text10": "Nevertheless, the protocol approved by the Third Congress of Workers', Soldiers', and Peasants' Deputies of the Region declared that the supreme body of power in the region would be the 'Council of Workers', Soldiers', and Peasants' Deputies of the Region', which would henceforth be called the Council of People's Commissars of Turkestan. Only representatives of the left socialist parties that carried out the October Revolution would participate in its formation. The congress made a clear statement regarding the participation of the local population in regional power: 'At present, it is not appropriate to include Muslims in the supreme revolutionary authority of the region. This is because the attitude of the local population toward the power of the soldiers', workers', and peasants' soviets is unclear, and there are no proletarian class organizations among the local population.'",
        "text11": "Thus, not a single representative from the local population of the region was included in the government – the Council of People's Commissars – elected by the congress. The position of chairman of the Council of People's Commissars (CPC) was held by Fyodor Kolesov.",
        "text12": "By convening the Third Regional Soviets Congress and making decisions, the Bolsheviks unilaterally resolved the issue of establishing power and forming government institutions in the region, violating the nations' right to self-determination. From the very beginning, the Bolsheviks essentially revealed themselves as the successors of Tsarism's great-power, chauvinistic, and colonial policies toward the local population.",
        "text13": "With the Bolsheviks taking power in Turkestan, all branches of the Provisional Government in the region were dismantled and replaced primarily by punitive organs and the Soviet administrative system. In November 1917, the Turkestan Council of People's Commissars adopted a decision to create Red Guard units in the region. These units actively participated in suppressing the first conscious uprisings against the Soviet regime and the Bolsheviks.",
        "text14": "However, the national patriotic forces of Turkestan, in this crucial moment of responsibility for the region's fate, firmly stood for the right of the people to self-determination and the establishment of their own statehood. National democrats had already expressed their position immediately after the October Revolution of 1917.",
        "text15": "The events that occurred in Tashkent and Kokand in October–November 1917 led to the intensification of socio-political movements in Turkestan.",
        "text16": "As a sign of refusal to cooperate with the Bolsheviks, members of the central 'Shuroi Islamia' organization, led by national democratic leaders, left Tashkent and moved to Kokand. There, from November 26 to 28, 1917, they held the extraordinary Fourth Congress of Turkestan Muslims. This congress aimed to resolve the issue of state structure in Turkestan.",
        "text17": "At the request of democratic Muslim intellectuals, representatives of the European part of the Turkestan population also participated equally in the congress. In contrast to the chauvinistic decisions of the Third Regional Congress of Soviets, the Muslim congress followed genuine internationalist principles at all stages, considering the interests of the multi-ethnic population of the region, including its European part.",
        "text18": "Such a humanistic approach was evident from the very opening of the Fourth Extraordinary Congress of Turkestan Muslims. In particular, in his speech on the legal legitimacy of the congress, Mahmudkhoja Behbudi especially emphasized that 'the decisions of the congress are more respected because representatives of the European population of Turkestan are also participating.'",
        "text19": "The main outcome of the congress’s activity was the establishment of the Turkestan Autonomy. The Turkestan Autonomy was the first practical experience of building a national-democratic statehood in the region.",
        "text20": "Over the course of three days, the congress participants defined their views on the future political structure of the Turkestan region, which were reflected in the documents adopted by the congress. In particular, on November 27, 1917, a declaration was adopted with the following content: 'Long live the Turkestan Autonomy! The Fourth Extraordinary Congress of Turkestan Muslims, based on the will of the peoples living in the Turkestan region and the principles granted by the Great Russian Revolution (the February Revolution), proclaims Turkestan as a local autonomy, i.e., a territorial autonomy, while remaining within the Russian Republic built on a federal basis.'",
        "text21": "The form in which this Autonomy will be realized is to be entrusted to the upcoming All-Turkestan Constituent Assembly (Turkestan Majlisi Muassasoni). At the same time, it solemnly declares that the rights of national minorities in the Turkestan region will be fully protected in every way.” (Ulugh Turkiston newspaper, December 8, 1917).",
        "text22": "With this, the congress expressed the will of the peoples living in Turkestan regarding the right to self-determination declared by the Great Russian Revolution, and proclaimed Turkestan as territorially autonomous, while leaving the formal establishment of autonomy to the Constituent Assembly.",
        "text23": "Thus, the autonomous republic established on November 27, 1917, came to be known as the 'Turkestan Autonomy'. The structure of the government was to be formed as follows: until the Constituent Assembly was convened, all power would be concentrated in the hands of the Turkestan Provisional Council and the Turkestan National (People’s) Assembly. A government composed of 12 members from the Provisional Council was to be formed.",
        "text24": "Muhammadjon Tinishpayev – Prime Minister, Minister of Internal Affairs, member of the Second State Duma, member of the Turkestan Committee of the Provisional Government, and a civil engineer.",
        "text25": "Islam Sulton Shoahmedov – Deputy Prime Minister, member of the Central Committee of the All-Russian Muslim Council, lawyer.",
        "text26": "Mustafa Cho'qay – Minister of Foreign Affairs, Chairman of the Central Shura of Turkestan Muslims, lawyer.",
        "text27": "Ubaydulla Khodjayev – Minister of Defense, member of the Central Committee of the All-Russian Muslim Council, lawyer.",
        "text28": "Hidayatbek Yurali Agayev – Minister of Land and Water Resources, agronomist.",
        "text29": "Obidjon Mahmudov – Minister of Food, Deputy Chairman of the Kokand City Duma, mining industry specialist.",
        "text30": "Abdurahmonbek O'razayev – Deputy Minister of Internal Affairs, lawyer.",
        "text31": "Solomon Abramovich Gersfeld – Minister of Finance, lawyer.",
        "text32": "After the government composition was proposed, 4 candidates from the European population were appointed to the government, with their inclusion planned later.",
        "text33": "Over time, for some reasons, Mustafa Cho'qay took the position of Prime Minister of the Turkestan Autonomy Government.",
        "text34": "Out of the 54 seats allocated in the Turkestan National Assembly, 4 representatives were from local city administrations, and 18 seats were assigned to representatives of various European organizations in the region. Thus, one-third of the seats were given to representatives of the European population, which constituted 7% of the total population of the region.",
        "text35": "The declaration of the Turkestan Autonomy and the beginning of the formation of state structures was a significant event. The establishment of the Turkestan Autonomy by the All-Muslim Congress caused a great stir across the region. In early December 1917, thousands of people from Tashkent, Namangan, Jalalabad, Kokand, Samarkand, and other areas organized rallies and demonstrations, fervently supporting autonomy, and special decisions were made about this.",
        "text36": "On December 1, 1917, a demonstration was held in the Namangan district with nearly 10,000 participants. Banners reading 'Long live the autonomous Turkestan and its government!' fluttered in the hands of the demonstrators.",
        "text37": "On December 6, a demonstration took place in the village of Khonobod in the Jalalabad district in connection with the establishment of autonomy. On December 7, a joint meeting of 42 public organizations of Kokand sent heartfelt greetings to the multi-million Turkestan people. At the regional Soviet congress held in Samarkand, a decision was made to support the Turkestan Autonomy, and 5 new representatives were elected to the people's assembly. A congress was also held in the Caspian region, and a decision was made to support the Turkestan Autonomy.",
        "text38": "With the establishment of national statehood, prominent intellectuals, religious, public, and political figures, such as Mahmudkhodja Behbudi, Mirmuhsin Shermuhammadovich, Abdulhamid Cholpon, Hamza Hakimzoda Niyoziy, Kabir Bakirov, Islam Shoahmedov, Abdurauf Fitrat, and others, congratulated the Autonomy in the press.",
        "text39": "Inspired by the enthusiastic support of the people, the representatives of the Turkestan Autonomy Government began active work. From the very beginning, laws approved by the National Assembly were announced, and the new government invited prominent lawyers to prepare the state Constitution. Several government newspapers began to be published in Uzbek, Kazakh, and Russian languages. Additionally, the government paid special attention to organizing a national army. During a military review conducted with the participation of Minister of Defense Ubaydulla Khodzhayev, the number of soldiers reached 2,000.",
        "text40": "On December 6, 1917, a demonstration took place at the Jome Mosque in Tashkent, with nearly 60,000 participants. According to the 'Ulug Turkiston' newspaper, 'The inner courtyard and roofs of the mosque were completely filled with people.' The demonstration was led by Saidgani Mahdum, and Munavvar Qori and Sherali Lapin were his deputies. The participants unanimously approved the Autonomy and adopted a resolution not to recognize any government other than the Provisional Government of Turkestan Autonomy. Then, the demonstrators swore allegiance to the People's Assembly.",
        "text41": "The tragic events of December 13, 1917, became a turning point in the struggle for 'Autonomous Turkestan.' On this day, for the first time after the October Revolution, the blood of the people was shed on Turkestan soil. The Provisional Government of Turkestan Autonomy declared December 13, coinciding with the Mawlud-i Sharif holiday, as 'Fundraising Day for the National Treasury of Turkestan Autonomy,' stating that these funds would serve to strengthen freedom and independence. However, the established Soviet government of Turkestan and its local authorities did not allow the events to develop in this direction, and with all measures, they began to eliminate the Autonomy and its supporters.",
        "text42": "The violent dispersal of the large rally supporting the Autonomy in Tashkent and the many casualties under the sound of rifles and machine guns fired by Soviet military forces was the first attempt to sabotage the Turkestan Autonomy.",
        "text43": "Despite this, support for the Turkestan Autonomy government continued. Specifically, during the emergency congress of Muslim workers, soldiers, and peasants' deputies, held in Kokand from December 26 to 30, 1917, the main issue discussed was the relationship with the Turkestan Autonomy. Around 200 representatives from all over Turkestan participated in this congress, which on December 30 adopted a declaration supporting the Turkestan Autonomy government and expressing distrust towards the Turkestan Soviet People's Commissariat. The declaration stated: 'The Muslim workers, peasants, and soldiers' congress requests that power be immediately handed over from the Turkestan Soviet People's Commissariat to the Turkestan Autonomy government and the National Assembly.'",
        "text44": "However, the Bolsheviks in the region viewed the Turkestan Autonomy government as a major threat. During the extraordinary IV Congress of Workers, Soldiers, and Peasants' Deputies of Turkestan, held in Tashkent from January 19 to 26, 1918, the Autonomy received entirely negative feedback. This congress decided to imprison the members of the Turkestan Autonomy government. The congress adopted a resolution by the Bolshevik faction condemning the Turkestan Autonomy as a 'band of reactionaries.' Furthermore, under the pressure of the Bolsheviks, the congress ruthlessly passed a verdict against the legitimate government of Turkestan, which had emerged as the first democratic and popular government of the region, advocating for the protection of the interests of the local people.",
        "text45": "On January 30, 1918, the Turkestan People's Commissariat (TXKS) launched military operations to dismantle the Autonomy government. In addition to Red Army soldiers, the Bolsheviks in Turkestan widely used armed groups composed of members of the Armenian 'Dashnaktsutyun' ('Union') party for this purpose.",
        "text46": "The battles that began in the second half of January 31 lasted for several days. Efforts to hold negotiations to prevent bloodshed were unsuccessful.",
        "text47": "On the night from February 18 to February 19, military units consisting of infantry, cavalry, and artillery, under the command of the military commissar of Turkestan, Ye.L. Perfilyev, began arriving in Tashkent. The Soviet forces surrounded Kokand from three sides. Artillery guns were brought into full combat readiness.",
        "text48": "On February 19, Perfilyev ordered the firing of all 12 mortars at the people of Kokand, including the use of incendiary shells. The bombardment of the peaceful population started at 13:00 and continued until dusk, destroying the city. However, the supporters of the Autonomy did not surrender and courageously defended every building, every shop, and every caravanserai.",
        "text49": "On February 19, 1918, the government of the Turkestan Autonomy operating in Kokand was overthrown as a result of the bloody attacks by the Bolsheviks. According to some reports, more than 10,000 people were killed due to the fierce battles and plunder.",
        "text50": "After the tragic events in Kokand in February 1918, the struggle for freedom began to take on the form of open armed resistance. After this, the indigenous people of Turkestan and their political leaders clearly saw that the Bolsheviks were openly trying to implement a statehood that was alien to the national mentality in their government structures. They concluded that peaceful solutions to the national issue were no longer possible, and only through armed struggle could the ancient dream of freedom and independence be achieved.",
        "text51": "Thus, a mass national movement against the Soviets was established in Turkestan, focused on freedom and independence."
    },
    "footer": {
        "text1": "Good design should not only be aesthetically pleasing, but also functional. It should be able to solve the problem.",
        "text2": "Ministers",
        "text3": "Members of the National Assembly",
        "text4": "Literature",
        "text5": "Press Publications",
        "text6": "Bibliography",
        "text7": "Photo Gallery",
        "text8": "Video Gallery",
        "text9": "Mobile App",
        "text10": "About Us",
        "text11": "Project Participants",
        "text12": "All rights reserved",
        "text13": "Media Library"
    },
    "members": {
        "tinishboyev": {
            "text": "Muhammadjon Tinishboyev",
            "dob": "1879-1939-years",
            "about": "Muhammadjon Tinishboyev [Muxamedjan Tinishpayev] – statesman, public figure, and historian. He was born on May 12, 1879, at the foot of the Echkiolmas Mountain in the Sadir volost of the Lepsinsk district in the Semirechye region. His ethnicity is Kazakh. He studied at the Verny Men's Gymnasium from 1889 to 1900 and at the Imperial Institute of Railway Engineers, Alexander I, in St. Petersburg from 1900 to 1906. In 1907, he was elected as a deputy to the State Duma of the Russian Empire of the second convocation. In April 1917, he became a member of the Turkistan Committee of the Provisional Government. At the same time, he served as the commissioner for the Semirechye region in the Provisional Government. After the establishment of the Turkistan Autonomy on November 27, 1917, in Kokand, he was appointed as the Prime Minister (November–December 1917) and the Minister of Internal Affairs (November 1917 – February 1918). He participated in the Second All-Kazak Congress held in Orenburg from December 5-13, 1917, where Alash Autonomy [Alash Orda Government] was established under the leadership of Alikhan Bukeykhanov (1866–1937). He served as the Minister of Internal Affairs (December 1917 – March 1920) and later as the Deputy Prime Minister in the Alash Orda Government. M. Tinishboyev later worked in various positions in the Turkistan ASSR and Kazakhstan ASSR. He wrote numerous works on the history and ethnography of Turkic peoples, which were published in Russian in Tashkent. M. Tinishboyev was first arrested by Soviet authorities on August 3, 1930, and exiled to the Central Black Earth region of the RSFSR (now Voronezh Oblast) for five years (1930–1935). Later, he was re-arrested by the NKVD on November 21, 1937, in Tashkent and died on July 3, 1939, in a prison hospital in Tashkent. On February 27, 1970, the KGB investigative department of the Uzbek SSR re-examined the criminal case against M. Tinishboyev, and he was rehabilitated. His selected works and other books were published in Almaty after 1991. After the collapse of the USSR, many monuments were erected in Kazakhstan in his honor, and a special medal was issued."
        },
        "abdurahmon": {
            "text": "Abdurahmon O‘razboyev",
            "dob": "1888-1937-years",
            "about": "Abdurahmon O‘razboyev was a prominent statesman and public figure. He was born in 1888 in the city of Yangi Marg‘ilon (now Fergana) in a family of civil servants. Abdurahmonbek, on his father's side, was a descendant of the Kazakh Kipchak tribe, just like Mustafo Cho‘qay’s ancestors. His father, Muhammad O‘razayev (who passed away on May 10, 1898), was one of the noblemen of the Middle Horde, having graduated from the 2nd Orenburg Cadet Corps and worked as a translator and secretary in the Marg‘ilon district administration. His mother, Niyozjon Bibixonim, was an Uzbek woman from the village of Avval in the Yangi Marg‘ilon district of Fergana province. After the death of her husband, she worked as a teacher. His upbringing was significantly influenced by his mother. \n\nAbdurahmonbek graduated from the Skobelev Gymnasium (1910) and the Law Faculty of Moscow University (1915). He worked as an assistant to a lawyer. In 1917, he was elected a member of the All-Russian Constituent Assembly from the Fergana electoral district. After the establishment of the Turkestan Autonomous Government in November 1917, he became Deputy Minister of the Interior and a member of the National Assembly. Later, he served as the Minister of the Interior. He was sympathetic to the Socialist-Revolutionary Party. After the overthrow of the Autonomous Government by the Bolsheviks in February 1918, A. O‘razayev was captured by the Bolsheviks. He was amnestied in May 1918 and worked in various positions in Soviet authorities. A. O‘razayev was later exiled to Siberia. After suffering from tuberculosis, he was allowed to return to his relatives (sister) in Tashkent. He lived with his future academic son-in-law, Qori Niyoziy. After living in Tashkent for some time, he passed away around 1937 due to a severe illness.\n\nAbdurahmonbek O‘razayev had two brothers and a sister. There is insufficient information preserved about his personal life. His sister, Oyshaxonim O‘razayeva (September 2, 1897 – January 31, 1988), was one of the first female teachers in Turkistan. She graduated from the Skobelev women’s gymnasium (now Fergana) and taught Russian in a Russian-native school in Namangan. Later, she worked at a Soviet school in Skobelev. She became a famous mathematician, an academician of the Academy of Sciences of Uzbekistan (1939), the first president of the Academy (1943-1947), Doctor of Physical and Mathematical Sciences (1939), and Professor. She was awarded the title of Hero of Socialist Labor in 1967.\n\nOyshaxonim married Toshmuhammad Niyozovich Qori-Niyoziy (1897, Khojand – 1970, Tashkent). He graduated from the Central Asian State University (1929), became its rector (1931-1933), and served as the People's Commissar for Education of the Uzbek SSR and Chairman of the Presidium of the Science Committee under the Council of People’s Commissars of the Uzbek SSR (1937-1938). He also held other important positions. Interestingly, both of them, Toshmuhammad and Oyshaxonim, reportedly were born on September 2, 1897, one in Khojand and the other in Skobelev (now Fergana). During the Soviet era, Qori-Niyoziy made a significant contribution to the development of Soviet culture and science in Uzbekistan. At the same time, the Soviet regime dealt a harsh and ruthless blow to the spiritual and national culture of the Uzbek people."
        },
        "hidoyatbek": {
            "text": "Hidoyatbek Yurali Agayev",
            "dob": "Year of birth unknown",
            "about": "Hidoyatbek Yurali Agayev – a statesman and public figure. He was born in the last quarter of the 19th century in the Fergana Valley. He was well known in the region as a prominent agronomist and scholar. He served as the Minister of Land and Water Resources in the government of the Turkestan Autonomous Republic. He was also an active member of the Turkestan National Assembly.\nIn February 1918, during the Bolshevik attack on the city of Kokand, he was alongside Prime Minister Mustafa Chokay. However, he perished during one of the battles against the Bolshevik military forces in Kokand.\nH. Agayev's wife: Josephina Stanislavovna Yurguli-Aga (maiden name Trushkovskaya), graduated from the Petersburg Patriot Institute."
        },
        "solomon": {
            "text": "Solomon Geresfeld",
            "dob": "1881-1937-years",
            "about": "One of the prominent investors in Turkestan, a lawyer, and journalist. Chairman of the Zionist Committee for the Central Asia region. He was born on November 27, 1881, in Odessa. He was of Bukhara Jewish descent. He was a free listener at the Faculty of Law of the University of Bern (Switzerland) starting in 1902. After returning to Russia, he took exams at the Odessa military academy and began his military service in the 6th Turkestan Battalion in Samarkand. Between 1904 and 1906, he published the 'Samarkand' newspaper in Russian. He was accepted into the 2nd-year law program at the Novorossiysk University in Odessa in 1907. In September 1908, he was elected to the Odessa Zionist Committee and published the 'Odesskoye slovo' newspaper. He graduated from university in May 1913 and returned to Samarkand. He became the chairman of the Jewish Committee in the Samarkand City Duma and was a member of the Duma in 1917.\nIn the first composition of the government of the Turkestan Autonomous Republic, he was the only non-indigenous candidate and served as the Minister of Finance. He was a member of the National Assembly from November 1917 to February 1918. Later, he transferred his position as the finance minister to Islam Shoakhmedov. When the government of the Autonomous Republic was overthrown, he was captured by the Red Guards in Kokand on February 20, 1918, and was executed. He was buried at the Melnikovo station of the Central Asian Railway (now Konibodom). According to Mustafa Chokay, 'Harsfeld had fallen into the hands of the Bolsheviks in Samarkand'.\nAt the request of the Bukhara Jews, S. Gersfeld's body was exhumed on April 16, 1918, and reburied by the Jewish community in the Jewish cemetery in Samarkand. At the time of his death, S.A. Gersfeld was not yet 37 years old."
        },
        "mustafo": {
            "text": "Mustafo Cho‘qay",
            "dob": "1890-1937-years",
            "about": "Mustafo Cho'qay was a prominent state and public figure, and a consistent fighter for the independence of the peoples of Turkestan.\nHe was born on December 25, 1890 (according to the new calendar, January 7, 1891) in the village of Avliyotarang'il, in the Perovsk district of the Syrdarya province (some sources claim he was born in the village of Narshoki). His father, Cho'kaybey, was a nobleman from the Kipchak tribe of the Kazakhs, and his mother’s ancestors were related to the Khivans. In his autobiography, Mustafo Cho'qay considered himself a Kipchak.\nMustafo Cho'qay received his early education in Oqmachit, then studied at the male gymnasium in Tashkent from 1902 to 1910. He graduated from the law faculty of St. Petersburg University in 1914. Notably, this was the same university that later produced Alexander Kerensky, the Prime Minister of the Russian Provisional Government, who graduated in 1899 and 1904. From 1916 to 1917, Mustafo Cho'qay served as a secretary and translator in the Muslim faction of the Russian IV State Duma. After the brutal suppression of the 1916 uprising in Turkestan, he visited the ruins of cities in the region, including Jizzakh, as part of a special commission led by A. Kerensky.\nIn April 1917, Mustafo Cho'qay returned from Petrograd to Tashkent and became a central figure in the political processes of Turkestan. He began publishing two newspapers in Tashkent: \"Birlik tug'i\" and \"Svobodnыy Turkestan\" in the spring of 1917. From April 16-23, 1917, he chaired the I Congress of All Turkistan Muslims in Tashkent, where the Central Council of Muslims of Turkestan (Kraymussovet) was established.\nHe actively participated in the First Congress of All Kyrgyz (or Kazakhs) in Orenburg in July 21-28, 1917. In August of 1917, he became a member of the Turkestan Committee of the Provisional Government. After the Bolsheviks took power in Tashkent, Mustafo Cho'qay and the National Center, led by him, relocated to Kokand in early November.\nIn November 26-28, 1917, the Extraordinary IV Congress of All Turkistan Muslims took place in Kokand, where Mustafo Cho'qay, as the chairman, gave an opening speech. He was elected a member of the congress's executive body. The congress participants discussed the future political structure of Turkestan for three days.\nIn December 1917, Mustafo Cho'qay became the Prime Minister of the Turkistan Autonomous Government, and he also took on the role of Foreign Minister in the Alash Orda government.\nHe later became a prominent figure in the struggle against Bolshevik domination and continued his activities in Europe, publishing articles and books in various languages, including Russian, Uzbek, Kazakh, Turkish, French, and English."
        },
        "sulton": {
            "text": "Islam Sultan Shoahmedov",
            "dob": "1882-1937-years",
            "about": "A prominent Muslim public figure and politician. Born on November 21, 1882, in Orenburg into a Tatar-Bashkir family. His father, Shagisulton (Sultan) Shagiaxmetovich Shagiaxmetov (1855-1896), was from the Bashkir tribe in the Menzalinsk district of the Ufa province. He graduated from the Law Faculty of Kazan University in 1876 and worked as a teacher in Orenburg's Tatar teachers' school (1876-1890), then as an investigator in the Orenburg region's judicial authorities.\nHis mother, Gaynizigan Muhammad-Sadiqovna Nigmatullina, was a Tatar woman, of noble origin. Islam Shoahmedov’s worldview was mainly shaped among the Orenburg Tatars, and his mother played a significant role in shaping his spiritual and social views.\nAfter graduating from Orenburg Men's Gymnasium (1905), Shoahmedov studied at St. Petersburg University, first in the Department of Oriental Studies and then in the Law Faculty (1905-1910). In addition to Turkish and Russian, he was fluent in English, French, and German. During his student years, he became interested in the social-democratic movement in Russia and carried out propaganda among the soldiers of the Tashkent garrison in 1907.\nHe completed the full course of university studies by the end of 1910, and in January 1911, he received his diploma. In August 1912, he began working at the St. Petersburg court chamber. He became the editor of the 'Musulmanskoy gazeta,' which was published in October 1912. He defended members of the Menshevik Party in a number of court cases. Shoahmedov fought for the rights of Muslims in the Russian Empire. He arrived in Kokand in early 1915 and began his activities as an investigative attorney assistant in the Skobelev district court. He played a significant role in the publication of the 'Sadoi Farg‘ona' newspaper. In 1916, he founded the 'G‘ayrat' society and launched the 'Turkestanskiy kray' newspaper, also serving as its editor.\nDuring the February Revolution, he was in Petrograd and became closer to the People's Socialist Party. By the end of March 1917, he returned to Turkestan. From June 1917, he served as the acting chairman of the National Council's Executive Committee. Shoahmedov participated in the Second All-Russian Congress of Muslims held in Kazan in 1917.\nIn 1917, Shoahmedov became actively involved in the autonomy movement in Turkestan. He was the editor and publisher of the revived 'Turkestanskiy kray' (Tashkent, 1917) newspaper. He was a member of the Turkestan Muslim Central Committee and actively participated in the I-IV Congresses of Muslims of Turkestan. He was appointed Deputy Prime Minister and later Minister of Finance in the Turkestan Autonomous Government. He was the author of the draft Constitution of the Turkestan Autonomous Republic. After the dissolution of the government in 1918, Shoahmedov was arrested by the Bolsheviks in the Kokand fortress.\nAccording to reports in the 'Ulugh Turkiston' newspaper in the spring of 1918, he was driven insane by torture in the Tashkent prison and moved to a prison hospital. In May 1918, after the Bolsheviks granted amnesty to surviving members of the Turkestan Autonomous Government, Shoahmedov was released from prison.\nFrom 1919 to 1920, Shoahmedov cooperated with the Bolsheviks and worked in the Central Council of the People's Economy of Turkestan and the Kokand Soviet Revolutionary Committee in 1920. At the end of 1920, he secretly left for Manchuria. In early 1921, he ended up in a camp for Russian refugees in Peshawar, British India. In May 1921, Shoahmedov, who was seriously ill, wrote a letter that later reached Russian émigrés in Paris. Mustafa Cho‘qay also mentioned this in his article. With the financial support of his relative, the wealthy merchant Agafurov, Shoahmedov arrived in Vladivostok in August 1921. He had plans to go to Paris from there, but according to some sources, he became seriously ill and stayed with his relatives in Vladivostok. He is believed to have died around 1922 or later.\nIn an article published in 1931 in the 'Yash Turkestan' journal in Berlin, Mustafa Cho‘qay wrote about his meeting with Shoahmedov’s sister in 1922, where it was mentioned that Shoahmedov's comrade was severely ill at that time. Afterward, there were no further reports on Shoahmedov's fate.\nShoahmedov had a brother, Shaxgali (1882-?), who was also a lawyer, and four sisters named Bibi Maryam, Bibi Galiya, Bibi Soliya, and Bibi Zuhra. His wife was Olga Viktorovna Benedskaya (from 1909)."
        },
        "ubaydulla": {
            "text": "Ubaydulla Khojayev",
            "dob": "1878-1942-years",
            "about": "Ubaydulla Khojayev [Ubaydullakhoja Asadullakhojayev; Ubaydulla Asaddullayevich Khojayev] – a prominent statesman and public figure, one of the notable representatives of the Jadid movement in Turkestan, and one of the founders of Uzbek journalism. He was born in 1886 in a family of artisans in Tashkent city. Some sources state he was born on May 12, 1878. He studied at the Law Institute in Saratov (1908-1912). During his student years, he began thinking about solving contemporary issues and corresponded with the famous Russian writer Lev Tolstoy (1909). He worked as a private lawyer at the Tashkent District Court from 1913. Joining the Jadid movement, he quickly became one of its leaders. He was one of the founders of the “Turon” society (1913). In April 1914, he started publishing the newspaper “Sadoi Turkiston” in Tashkent, where he served as its editor. He gathered youth around him and formed the underground society “Umid,” which later became known as “Taraqqiyparvar” and became one of the main organizations of Turkestan Jadids. After the closure of the newspaper “Sadoi Turkiston” by the local authorities of the Russian Empire in April 1915, he moved to Andijan and started publishing the Russian-language newspaper “Turkestanskiy Golos.”\n In 1916, he became the head of the “Turkiston Mardikorlikka olish Qo‘mitasi” (Committee for Recruiting Workers in Turkistan). Together with local investor Mirkomilboy Mirmo‘minboyev, he went to Petrograd to abolish the decree on labor conscription by Emperor Nicholas II. He was the secretary and member of the Central Council of Muslims of Turkestan, formed at the First All-Turkestan Muslim Congress in April 1917. He was also a member of the Executive Committee of the All-Russian Muslim Congress in May 1917. In March 1917, he became the head of the organization “Sho‘roi Islomiya,” formed in Tashkent. He was one of the initiators of the independence movement. He served as the Minister of Military Affairs in the Turkestan Autonomy government from November 1917 to February 1918.\n In February 1918, at the government’s request, Ubaydulla Khojayev went to the Caucasus and resolved the issue of importing grain to Turkestan. According to Mustafa Cho‘qay, after the dissolution of the autonomy government, he was captured by the Bolsheviks on the Ashkhabad-Samarkand railway. After being amnestied by the Soviet authorities in May 1918, he went to Orenburg and played an active role in establishing the Bashkir Autonomous Republic in November 1918.\n Ubaydulla Khojayev was imprisoned multiple times by the Soviet regime (1918, 1929, 1931, 1938). He lived in poverty in the house of his sister in Tashkent. He translated the famous English work “Mowgli” by J.R. Kipling into Uzbek. In 1938, he was arrested again on February 20 in Tashkent and sentenced by the USSR NKVD Special Council to 8 years in a labor camp on May 14, 1939. He was sent to the Kotlas station of the Gorky railway for serving his sentence. He died in the Kotlas prison on October 31, 1942. After his death, he was posthumously rehabilitated by the Soviet government. His nephew, Uzbekistan People’s Writer Shukrullo (1921-2020), wrote about his activities in his novel “Tirik ruhlar” (1999) and highlighted the fate of his compatriots in the memoir “Kafansiz ko‘milganlar” (1990)."
        },
        "obidjon": {
            "text": "Obidjon Mahmudov",
            "dob": "1878-1942-years",
            "about1": "Obidjon Abduxoliqovich Mahmudov [Obid Chatoq] was a representative of the Jadid movement in Turkestan, a statesman, public figure, major investor, and publisher. Obidjon Mahmudov was born in 1871 in Margilan. His father, Abduxoliq Abduqodirbek, held the position of chief artillery officer in the Emirate of Bukhara. Abduxoliq, at the invitation of a friend, visited Margilan, where he fell off a horse and broke his leg. He had to stay at his friend's house until he recovered. During this time, he married his friend's relative, Robiya, and settled there. Their son, Obidjon Mahmudov, was born. After his elder brother, Mirodil, bought a house in the Shaykhon neighborhood of Kokand, Obidjon also moved there. He received education at a madrassa and helped his brother in beekeeping, learning the trade from him, while his uncle Mirzakarim, a jeweler, taught him the secrets of commerce.\n Obidjon Mahmudov later moved to Kokand, received education at a madrassa, and then went to the Cheleken Peninsula in the Caspian Sea to engage in oil extraction, eventually becoming wealthy. His rapid rise to wealth made him a target of constant surveillance by the special police of the Russian Empire – the Turkistan regional protection department. Between 1897 and 1901, Obidjon graduated from the mining engineering faculty of the University of St. Petersburg. He became a prominent mining expert and later a statesman, a writer who worked in both Uzbek and Russian, and a scholar in Arabic and Turkish languages, with significant knowledge in economics and geology.\n Returning to Kokand, Obidjon engaged in the mining industry, participating in the discovery of several oil fields in the Fergana Valley. He bought the sulfur mine in Sho'rsu. After graduating, he returned to Kokand and started working in oil fields, being actively involved in the development of mines in regions like Karmana, Sho'rsu, Sariq Qorgon, Polvontosh, Olamushuk, and Mumkonsay. In 1905, he was sent to Azerbaijan to study oil and ozokerite extraction and returned with expertise to develop the oil fields. \n According to historian N. Komilov, a group of investors led by O. Mahmudov founded the Kokand Stock Exchange Society on November 15, 1906. On January 9, 1907, a delegation of 60 members, led by A.I. Vegel, the chairman of the stock exchange, and Obidjon Mahmudov, requested permission from the military governor of the Fergana province to establish the Kokand Stock Exchange. The stock exchange was officially established in 1907.\n Mahmudov's contributions were instrumental in drafting the regulations of the stock exchange, and he was actively involved in its management. The stock exchange's regulations included transparency in trading, freedom in price formation, and equal participation rights for all members.\n Apart from his business activities, Obidjon Mahmudov was a key figure in the publication sector. In 1913, he received a license to publish a local newspaper called 'Nashri Obidjan' in Kokand. Later, in 1914, he founded the 'Sadoi Fargʻona' newspaper in both Russian and Uzbek languages, and he played a major role in the Jadid movement, both financially and through his publications, advocating for education and national awakening in Turkestan.\n Obidjon Mahmudov’s work focused on achieving economic independence for the country. He wrote articles in 'Sadoi Fargʻona' on the economic situation in Turkestan, emphasizing the negative impacts of capitalist economic relations and calling for modernization of production methods to avoid economic decline.",
            "about2": "Obidjon Mahmudov was sentenced to 5 years in prison in 1926 by the decision of the OGPU Collegium. In May 1926, following his letter to M.I. Kalinin, the Chairman of the RSFSR MIQ, he was released from prison after 6 months in exchange for the confiscation of all his property. After his release from prison, he worked as a tenant at the oil field in Sho‘rsuv and continued his beloved profession until the end of his life. In 1933, Obidjon Mahmudov participated in the All-Union Agricultural Exhibition in Moscow, bringing samples of minerals found in the Fergana region and took part as a mining engineer, which is the last known activity of his. Obidjon Mahmudov passed away on November 21, 1936, from endocarditis. The deceased was buried in the 'Shaykhon' cemetery in Kokand. Obidjon Mahmudov, a leader of the Kokand Jadids, a prominent enlightener, publisher, and geological scientist, also served the welfare of the people and the future of the country. His progressive ideas included understanding the role of religion in human spiritual development, activating the formation of market relations, creating progressive democratic institutions, shaping national development in the country, and promoting publishing activities. He also advocated for the liberation of the people from colonial and feudal oppression, and the need to achieve economic independence. His deep knowledge of the social life of the region and his awareness of the problems that plagued the people made him actively contribute to solving the issues of society as a son of the land. As a person who made a significant contribution to the development of enlightenment in Turkestan, he was a progressive and intellectual figure who fought for the survival and progress of the nation."
        }
    }
}
