{
    "ChangePassword": "Изменить пароль",
    "Sources": "Источники",
    "Videos": "Видеогалерея",
    "ArticleCreated": "Была создана статья",
    "ArticleNotCreated": "Статья не может создать",
    "Write Article": "Напишите статью",
    "ArticleName": "Название статьи",
    "TheMostReadArticles": "Самые читаемые статьи",
    "Articles": "Статьи",
    "Search": "Поиск",
    "SignIn": "Авторизоваться",
    "Username": "Имя пользователя",
    "Password": "Пароль",
    "RememberMe": "Запомнить меня",
    "ForgotPassword": "Забыли пароль ?",
    "Images": "Галерея изображений",
    "MyArticles": "Мои статьи",
    "ProfileSettings": "Настройки профиля",
    "Email": "email",
    "CurrentPassword": "Введите текущий пароль",
    "NewPassword": "Введите новый пароль",
    "ConfirmPassword": "Повторно введите новый пароль",
    "Cancel": "Отказаться",
    "ArticleFaceImage": "Загрузите картинку для лицевой части статьи",
    "Save": "Сохранить",
    "Name": "Имя",
    "Description": "Описание",
    "WriteArticle": "Напишите статью",
    "Kompaniya haqida": "О компании",
    "Xizmatlar": "Услуги",
    "Loyihalar": "Проекты",
    "goBack": "Назад",
    "goHome": "Назад Главная",
    "main": "Главная",
    "history": "История независимости",
    "historyDoc": "История документи",
    "articles": "Статьи",
    "govermentMembers": "Члены правительства",
    "sources": "Источники",
    "write": "Написать статью",
    "profile": "Профиль",
    "logout": "Выход",
    "login": "Вход",
    "media": "Медиа",
    "books": "Книги",
    "autoRefer": "Авторефераты",
    "videoLink": "Нажмите, чтобы посмотреть видео",
    "cardFirstHeaderText": "Стремись к свободе, стой гордо, пробудись, Туркестан!",
    "cardFirstSubText": "Туркестанская автономия — великая мечта наших предков, гордость и честь нации! Мы стремимся к свободе, справедливости и прогрессу! Народ, стремящийся к свободе, никогда не будет рабом! Да здравствует независимый и автономный Туркестан!",
    "secondTextCardHeader1": "Да здравствует",
    "secondTextCardHeader2": "Туркестанская автономия.",
    "secondTextCardSub1": "<p>Четвертый чрезвычайный съезд мусульман Туркестана объявляет территориальную автономию Туркестана, основанную на воле народов региона и принципах, предоставленных Российской революцией, в федерации с Российской Республикой.</p>",
    "secondTextCardSub2": "<p>Форма этой автономии будет определена предстоящим Учредительным собранием всего населения Туркестана. Одновременно съезд торжественно заявляет, что права национальных меньшинств в Туркестане будут сохранены во всех отношениях!</p>",
    "secondTextCardFooter1": "“Шахри Хоканд”",
    "secondTextCardFooter2": "Хиджра 1336, 25-е Сафара / Григорианский 27 ноября 1917 года",
    "cholpon": "Абдулхамид Чулпон",
    "cholponText": "Не знаю, чьи надежды исчезли, В поздние часы листья горели красным? Не знаю, чья судьба оборвалась, Осенью... почвы посерели?",
    "munavvar": "Мунаввар Кори Абдурашидханов",
    "munavvarText": "Пока европейские народы взмывают в небо, мы спорим о бородах и усах; пока европейцы плавают под морями, мы спорим о длинной и короткой одежде; европейские города полностью отапливаются и освещаются электричеством, а мы спорим, преподавать ли географию и медицину в школах... и так продолжается.",
    "behbudiy": "Махмудходжа Бехбудий",
    "behbudiyText": "Устраните разногласия! Не оставляйте детей Туркестана без образования! Покажите всем путь к свободе! Быстро принесите свободу! Только тогда мы будем спокойно покоиться в наших могилах!",
    "memberAboutFooterText": "<h1>Народ — это море, <span>народ — это сила</span></h1>",
    "heading": "Члены правительства автономии",
    "subHeading": "Хиджра 1336, 25-е Сафара, Григорианский 27 ноября 1917 года — “Шахри Хоканд”",
    "membersHeading": "Члены <span>правительства</span> автономии",
    "membersSubText": "Активные участники движения за автономию вошли в состав Временного правительства Туркестанской автономии. Следующие лица стали членами правительства:",
    "countersSecHeader": "Ключевые показатели",
    "countersSecSub": "Сегодня история борьбы за Туркестанскую автономию, ранний опыт построения национально-демократического государства в нашей стране, имеет особое значение. Эта история, привлекшая внимание научного сообщества, теперь вызывает не только академический, но и практический, а также политический интерес.",
    "historyPageList": {
        "header1": "История <span>Туркестанской</span> автономии",
        "header2": "Активные участники движения за автономию вошли в состав Временного правительства Туркестанской автономии. Следующие лица стали членами правительства:",
        "subHeader1": "Члены Туркестанской автономии",
        "subHeader2": "Фотография джадидов, восстановленная с помощью искусственного интеллекта.",
        "subHeader3": "Улицы Туркестана в XX веке",
        "subHeader4": "Министры Туркестанской автономии XX века.",
        "subHeader5": "Население Туркестана в XX веке.",
        "text1": "После обретения независимости Узбекистаном в республике были и продолжают осуществляться глубокие реформы во всех сферах жизни. Самоопределение узбекского народа требует научного изучения опыта национального государственного строительства, более глубокого осмысления процессов, связанных с национальным возрождением, а также обобщения накопленного опыта на пути обновления и прогресса Узбекистана.",
        "text2": "В настоящее время история борьбы за Туркестанскую автономию, ставшую первым опытом построения национально-демократического государства в нашей стране, приобретает особую значимость. Эта история, привлекшая внимание научной общественности, вызывает сегодня не только научный, но и практический, а также политический интерес. Это связано с переоценкой событий тех лет и выявлением роли политических, общественных деятелей и мыслителей Туркестана в борьбе за свободу и независимость.",
        "text3": "В начале XX века джадиды — идеологи движения за автономию — появились в Туркестане как культурно-просветительное, а позже и как политическое движение, заявив, что их цель — построение светского государства. Ради этого джадиды стремились реформировать экономическую и политическую системы государства, развивать образование и науку. Однако, выбрав этот путь, они не стремились отказаться от национальных и духовных ценностей, а, напротив, опираясь на них, добиваться постепенных изменений и освободить народ от устаревших взглядов, укоренившихся в общественном сознании. Эти устаревшие взгляды препятствовали развитию государства и росту сознания народа.",
        "text4": "В феврале 1917 года борьба против царского правительства в России достигла такой степени, что система абсолютной монархии рухнула. Династия Романовых, которая на протяжении трёх столетий безраздельно правила Российской империей, была свергнута. 27 февраля 1917 года в Петрограде был создан Совет рабочих и солдатских депутатов. После этого в крупных городах России начала устанавливаться советская власть.",
        "text5": "Период после государственного переворота стал важным этапом политического пробуждения народов Туркестана и организации их политических сил. Эти силы, опираясь на демократические движения, развивавшиеся в бывшей Российской империи, открыто начали борьбу с собственной программой за построение государственности, освобождение от колониального гнёта в рамках демократической России и создание национально-территориальной автономии с широкой суверенностью. Сторонники автономии объясняли народу необходимость совместной работы узбеков, казахов, таджиков, татар, туркмен и киргизов.",
        "text6": "В 1917 году понятие «Муxторият», означающее «автономия» и связанное с идеей «самоопределения», стало одним из самых популярных выражений. В то историческое время джадиды предвидели, насколько тяжело будет Туркестану развиваться самостоятельно и какие трудности могут возникнуть при отделении от России. Поскольку Туркестан был во многом экономически связан с Российской империей, джадиды выступали за независимое развитие в рамках единого экономического пространства создающейся Российской Федеративной Демократической Республики (РФДР). Они поддерживали предоставление Туркестану широкой национально-территориальной автономии, то есть муxторият.",
        "text7": "Прогрессивные деятели осознали, что настало время жизненно важной борьбы за свободу и автономию. Они начали резко критиковать колониализм и отказались от прежних идей конституционной монархии. Было выдвинуто требование предоставить Туркестану статус национально-территориальной автономной республики в составе Российской Демократической Федеративной Республики. Программные документы сторонников автономии были в основном направлены на разработку путей реализации принципов национально-территориальной автономии. В частности, были вынесены на повестку дня такие важные вопросы, как создание высших органов власти, управление краем, учреждение региональных судов и формирование государственных институтов.",
        "text8": "В Туркестане республиканская форма государственного управления была признана приемлемой. Предполагалось построение демократического общества, в котором демократические права и свободы должны быть защищены конституционным путём.",
        "text9": "15 ноября 1917 года, накануне открытия III съезда рабочих, солдатских и крестьянских депутатов Туркестанского края, стало ясно, что съезд полностью взял на себя решение вопроса о создании власти в крае. После оживлённых споров между большевиками, эсерами, социалистами-революционерами и социал-демократами меньшевиками о принципах формирования власти, слово было предоставлено Шерали Лапи. В своём выступлении он ознакомил участников с решением III съезда мусульман Туркестана о создании краевой власти. Он заявил: «Мусульмане могли бы потребовать всю власть, но, уступив пришлым элементам, допустили их представителей к власти» и предупредил, что мусульмане категорически против господства в крае только одной революционной демократии.",
        "text10": "Тем не менее, Протокол, утверждённый III съездом рабочих, солдатских и крестьянских депутатов края, объявил, что высшим органом власти в крае является «Совет рабочих, солдатских и крестьянских депутатов края», который отныне называется Советом народных комиссаров Туркестана. В его формировании будут участвовать только представители левых социалистических партий, осуществивших Октябрьскую революцию. Съезд ясно заявил относительно участия местного населения в органах краевой власти: «В настоящее время включение мусульман в высший орган революционной власти края нецелесообразно. Так как отношение местного населения к власти советов солдат, рабочих и крестьян неясно, а также среди местного населения отсутствуют пролетарские классовые организации».",
        "text11": "Таким образом, в Совет народных комиссаров, избранный съездом, не вошёл ни один представитель местного населения края. Пост председателя Совета народных комиссаров (СНК) занял Фёдор Колесов.",
        "text12": "Созвав III съезд Советов края и приняв решения, большевики единолично решили вопрос об установлении власти и формировании органов управления в крае, нарушив право народов на самоопределение. По сути, с первых дней они показали себя продолжателями великодержавной, шовинистической и колониальной политики царизма по отношению к местному населению.",
        "text13": "С переходом власти в руки большевиков в Туркестане были ликвидированы все звенья Временного правительства, на их место были созданы, прежде всего, карательные органы и система советского управления. В ноябре 1917 года Туркестанский СНК принял решение о создании частей Красной гвардии в крае. Эти подразделения активно участвовали в подавлении первых сознательных выступлений против советского строя и большевиков.",
        "text14": "Однако национально-патриотические силы Туркестана в столь ответственное время за судьбу края заняли твёрдую политическую позицию, направленную на реализацию права народа на самоопределение и создание собственной государственности. Национальные демократы выразили своё отношение к этому сразу после Октябрьской революции 1917 года.",
        "text15": "События, произошедшие в Ташкенте и Коканде в октябре–ноябре 1917 года, стали причиной усиления социально-политических движений в Туркестане.",
        "text16": "В знак отказа от сотрудничества с большевиками члены центральной организации «Шуро-и Исламия», возглавляемые национально-демократическими лидерами, покинули Ташкент и переехали в Коканд. Здесь они провели 26–28 ноября 1917 года чрезвычайный IV съезд мусульман Туркестана. Этот съезд был направлен на решение вопроса о государственном устройстве Туркестана.",
        "text17": "По требованию демократической мусульманской интеллигенции представители европейской части населения Туркестана также участвовали в курултае на равных правах. В отличие от шовинистических решений III съезда Советов края, мусульманский курултай на всех этапах своей работы руководствовался истинными интернационалистскими принципами, исходя из интересов многонационального населения региона, включая его европейскую часть.",
        "text18": "Такой гуманистический подход проявился с самого начала IV чрезвычайного курултая мусульман Туркестана. В частности, Махмудходжа Бехбудий в своей речи о правовой основе съезда особо подчеркнул: «Решения съезда тем более авторитетны, что в нём участвуют представители европейского населения Туркестана».",
        "text19": "Основным итогом деятельности съезда стало провозглашение Туркестанской Автономии. Туркестанская Автономия стала первым практическим опытом построения национально-демократического государства на территории региона.",
        "text20": "В течение трёх дней участники съезда определяли своё видение будущего политического устройства Туркестанского края, что нашло отражение в документах, принятых съездом. В частности, 27 ноября 1917 года была принята декларация следующего содержания: «Да здравствует Туркестанская Автономия! Четвёртый чрезвычайный курултай мусульман Туркестана, исходя из воли народов, проживающих на территории края, и на основании основ, предоставленных Великой Русской революцией (Февральской революцией), провозглашает Туркестан местной автономией, то есть территориальной автономией, остающейся в составе Российской Республики, построенной на федеративной основе».",
        "text21": "Форма реализации этой Автономии должна быть определена на предстоящем Учредительном собрании всего Туркестана (Туркестанский Маджлис Муассаса). Одновременно с этим торжественно заявляется, что права национальных меньшинств в Туркестанском крае будут полностью защищены во всех отношениях». (газета «Улуг Туркестан», 8 декабря 1917 г.).",
        "text22": "Таким образом, съезд выразил волю народов, проживающих в Туркестане, в отношении права на самоопределение, провозглашённого Великой Российской революцией, и провозгласил Туркестан территориально автономным, при этом передав Учредительному собранию вопрос о формах реализации автономии.",
        "text23": "Таким образом, автономная республика, образованная 27 ноября 1917 года, получила название «Туркестанская автономия». Структура власти должна была быть сформирована следующим образом: до созыва Учредительного собрания вся власть сосредотачивалась в руках Временного совета Туркестана и Туркестанского Народного (Национального) Собрания. Из членов Временного совета должно было быть сформировано правительство из 12 человек.",
        "text24": "Мухаммаджон Тинишпаев – премьер-министр, министр внутренних дел, депутат II Государственной думы, член Туркестанского комитета Временного правительства, инженер путей сообщения.",
        "text25": "Ислам Султон Шоахмедов – заместитель премьер-министра, член Центрального Комитета Всевсероссийского мусульманского совета, юрист.",
        "text26": "Мустафа Чокай – министр иностранных дел, председатель Центрального Шура Туркестанских мусульман, юрист.",
        "text27": "Убайдулла Ходжаев – министр обороны, член Центрального Комитета Всевсероссийского мусульманского совета, юрист.",
        "text28": "Хидоятбек Юрали Агаев – министр земельных и водных ресурсов, агроном.",
        "text29": "Обиджон Махмудов – министр продовольствия, заместитель председателя Кокандской городской думы, специалист по горной промышленности.",
        "text30": "Абдурахмонбек Оразаев – заместитель министра внутренних дел, юрист.",
        "text31": "Соломон Абрамович Гершфельд – министр финансов, юрист.",
        "text32": "После предложения состава правительства, было назначено 4 кандидата от европейского населения, их включение было запланировано позже.",
        "text33": "Со временем, по некоторым причинам, Мустафа Чокай занял пост премьер-министра правительства Туркестанской автономии.",
        "text34": "Из 54 мест, выделенных в Национальном собрании Туркестана, 4 представителя были от местных городских администраций, а 18 мест было отведено представителям различных европейских организаций региона. Таким образом, треть мест была предоставлена представителям европейского населения, которое составляло 7% от общего числа населения региона.",
        "text35": "Объявление Туркестанской автономии и начало формирования государственных структур стало значительным событием. Учреждение Туркестанской автономии на Общемусульманском съезде вызвало большой резонанс в регионе. В начале декабря 1917 года тысячи людей из Ташкента, Намангана, Джалалабада, Коканда, Самарканда и других городов организовали митинги и демонстрации, горячо поддержав автономию, и были приняты специальные решения по этому поводу.",
        "text36": "1 декабря 1917 года в Намаганском уезде прошел митинг с участием почти 10 000 человек. Знамёна с надписью 'Да здравствует автономный Туркестан и его правительство!' развевались в руках участников демонстрации.",
        "text37": "6 декабря в селе Хонобод Джалалабадского уезда прошла демонстрация в связи с установлением автономии. 7 декабря на совместном заседании 42 общественных организаций Коканда были отправлены сердечные поздравления много миллионному народу Туркестана. На съезде регионального Совета в Самарканде было принято решение поддержать Туркестанскую автономию, и в народное собрание были избраны 5 новых представителей. В Каспийской области также был проведен съезд, на котором было принято решение поддержать Туркестанскую автономию.",
        "text38": "С установлением национального государственного строя в прессе выступили известные интеллектуалы, религиозные, общественные и политические деятели, такие как Махмудхо́джа Бехбудий, Мирмухсин Шермухаммедович, Абдулхамид Чолпон, Хамза Хакимзода Ниёзи, Кабир Бакиров, Ислам Шоахмедов, Абдурауф Фитрат и другие, поздравившие Автономию.",
        "text39": "Вдохновленные горячей поддержкой народа, представители правительства Туркестанской Автономии начали активную деятельность. С первых дней были объявлены законы, утвержденные Национальным собранием, и новое правительство привлекло известных юристов для разработки Конституции государства. Были начаты публикации нескольких правительственных газет на узбекском, казахском и русском языках. Также правительство уделяло особое внимание организации национальной армии. Во время военного парада, проведенного при участии министра обороны Убайдуллы Ходжаева, число солдат достигло 2 000.",
        "text40": "6 декабря 1917 года в Ташкенте прошла демонстрация в Джоме-мечети, в которой приняли участие около 60 000 человек. Как сообщается в газете 'Улуг Туркестон', 'Внутренний двор и крыши мечети были полностью заполнены людьми.' Демонстрацию возглавил Саидгани Махдум, а его заместителями были Мунаввар Кори и Шерали Лапин. Участники единогласно одобрили Автономию и приняли решение не признавать никакое правительство, кроме Временного правительства Туркестанской Автономии. Затем участники демонстрации принесли клятву верности Народному Собранию.",
        "text41": "Трагические события 13 декабря 1917 года стали поворотным моментом в борьбе за 'Автономный Туркестан.' В этот день, впервые после Октябрьской революции, на земле Туркестана пролилась кровь народа. Временное правительство Туркестанской Автономии объявило 13 декабря, совпавший с праздником Маулуд-и Шариф, 'Днем сбора средств на национальный фонд Туркестанской Автономии', заявив, что эти средства будут служить укреплению свободы и независимости. Однако установленное Советское правительство Туркестана и его местные власти не позволили событиям развиваться в этом направлении и всеми мерами начали уничтожать Автономию и ее сторонников.",
        "text42": "Жестокое разгон митинга в поддержку Автономии в Ташкенте и множество жертв под звуки выстрелов и пулеметов, произведенных советскими военными силами, стали первой попыткой саботажа Туркестанской Автономии.",
        "text43": "Несмотря на это, поддержка правительства Туркестанской Автономии продолжалась. В частности, на чрезвычайном съезде депутатов мусульманских рабочих, солдат и крестьян, который прошел в Коканде с 26 по 30 декабря 1917 года, основным вопросом было отношение к Туркестанской Автономии. В этом съезде приняли участие около 200 представителей со всего Туркестана, который 30 декабря принял декларацию в поддержку правительства Туркестанской Автономии и выразил недоверие Туркестанскому Советскому Народному Комиссариату. В декларации говорилось: 'Конгресс мусульманских рабочих, крестьян и солдат требует немедленно передать власть от Туркестанского Советского Народного Комиссариата к правительству Туркестанской Автономии и Национальному Собранию.'",
        "text44": "Однако большевики в регионе рассматривали правительство Туркестанской Автономии как серьезную угрозу. Во время чрезвычайного IV съезда депутатов рабочих, солдат и крестьян Туркестана, прошедшего в Ташкенте с 19 по 26 января 1918 года, Автономия получила исключительно негативную оценку. Этот съезд принял решение о заключении членов правительства Туркестанской Автономии в тюрьму. Съезд принял резолюцию фракции большевиков, осуждающую Туркестанскую Автономию как 'банду реакционеров.' Более того, под давлением большевиков съезд безжалостно вынес приговор против легитимного правительства Туркестана, которое стало первым демократическим и народным правительством региона, защищавшим интересы местного населения.",
        "text45": "30 января 1918 года Туркестанский Совет Народных Комиссаров (ТНКС) начал военные действия для ликвидации правительства Автономии. Кроме красных солдат, большевики в Туркестане широко использовали вооруженные группы, состоящие из членов армянской партии 'Дашнакцутюн' ('Союз').",
        "text46": "Бои, начавшиеся во второй половине дня 31 января, продолжались несколько дней. Попытки провести переговоры с целью предотвращения кровопролития не увенчались успехом.",
        "text47": "В ночь с 18 на 19 февраля в Ташкент начали прибывать войска, состоящие из пехоты, кавалерии и артиллерии под командованием военного комиссара Туркестана Е.Л. Перфильева. Советские войска окружили Коканд с трех сторон. Артиллерийские орудия были приведены в полную боевую готовность.",
        "text48": "19 февраля Перфильев приказал открыть огонь со всех 12 минометов по жителям Коканда, включая использование зажигательных снарядов. Обстрел мирного населения начался в 13:00 и продолжался до наступления темноты, разрушив город. Тем не менее, сторонники Автономии не сдались и мужественно защищали каждое здание, каждый магазин, каждый караван-сарай.",
        "text49": "19 февраля 1918 года правительство Туркестанской Автономии, действовавшее в Коканде, было свергнуто в результате кровавых нападений большевиков. По некоторым данным, более 10 000 человек погибли в результате жестоких боев и грабежей.",
        "text50": "После трагических событий в Коканде в феврале 1918 года борьба за свободу начала принимать форму открытого вооруженного сопротивления. После этого коренные жители Туркестана и их политические лидеры ясно увидели, что большевики открыто стремятся внедрить государственность, чуждую национальному менталитету, в свои государственные структуры. Они пришли к выводу, что мирное решение национального вопроса стало невозможным, и только с помощью вооруженной борьбы можно было осуществить древнюю мечту о свободе и независимости.",
        "text51": "Таким образом, в Туркестане была заложена массовая национальная движение против советов, ориентированное на свободу и независимость."
    },
    "footer": {
        "text1": "Хороший дизайн должен быть не только красивым, но и функциональным. Он должен решать проблему.",
        "text2": "Министры",
        "text3": "Члены Национального собрания",
        "text4": "Литература",
        "text5": "Пресс-публикации",
        "text6": "Библиография",
        "text7": "Фотогалерея",
        "text8": "Видеогалерея",
        "text9": "Мобильное приложение",
        "text10": "О нас",
        "text11": "Участники проекта",
        "text12": "Все права защищены",
        "text13": "Медиатека"
    },
    "members": {
        "tinishboyev": {
            "text": "Мухаммаджон Тинишбоев",
            "dob": "1879-1939 годы",
            "about": "Мухаммаджон Тинишбоев [Мухамеджан Тинишпаев] – государственный и общественный деятель, историк. Он родился 12 мая 1879 года у подножья горы Эчкиолмас в Садирском волости Лепсинского уезда Семиреченской области. По национальности казах. Он учился в Верненской мужской гимназии с 1889 по 1900 годы, затем с 1900 по 1906 годы в Санкт-Петербургском Императорском институте железнодорожных инженеров имени Александра I. В 1907 году он был избран депутатом II Государственной Думы Российской империи. В апреле 1917 года стал членом Туркестанского комитета Временного правительства. Одновременно был комиссаром Семиреченской области в Временном правительстве. После создания Туркестанской автономии 27 ноября 1917 года в Коканде, он был назначен премьер-министром (ноябрь–декабрь 1917 года) и министром внутренних дел (ноябрь 1917 года – февраль 1918 года). Он принял участие во II Всеказахском съезде, который состоялся в Оренбурге с 5 по 13 декабря 1917 года, где была основана автономия Алаш [Правительство Алаш Орда] под руководством Алихана Букейханова (1866–1937). Он занимал должность министра внутренних дел (декабрь 1917 года – март 1920 года) и позднее заместителя премьер-министра в правительстве Алаш Орда. М.Тинишбоев позже работал в различных должностях в Туркестанской АССР и Казахстанской АССР. Он написал множество работ по истории и этнографии тюркских народов, которые были опубликованы на русском языке в Ташкенте. М.Тинишбоев был впервые арестован советскими властями 3 августа 1930 года и сослан на пять лет в Центрально-Черноземный край РСФСР (ныне Воронежская область) (1930–1935). Позже, 21 ноября 1937 года, он был арестован НКВД в Ташкенте и скончался 3 июля 1939 года в тюремной больнице Ташкента. 27 февраля 1970 года Следственное управление КГБ Узбекской ССР пересмотрело уголовное дело М.Тинишбоева, и он был реабилитирован. Его избранные работы и другие книги были изданы в Алматы после 1991 года. После распада СССР в Казахстане в его честь было установлено множество памятников, и была выпущена специальная медаль.",
            "books": {
                "book1": "Rajabov Q. Turkiston Muxtoriyati vazirlari hamda milliy majlis aʼzolari hayoti va taqdiri. - Toshkent: \"Bodomzor Invest\", 2021. - B. 18-19.",
                "book2": "Marat Yeskendiruli (Ebdeshev). Ministri \"Alash Ordi\" (qozoq va rus t.). -Almati, 2008. -S. 75 – 77.",
                "book3": "Rajabov Q. Tinishboyev Muhammadjon //Oʻzbekiston milliy ensiklopediyasi. T. 8. -Toshkent: \"Oʻzbekiston milliy ensiklopediyasi\" Davlat ilmiy nashriyoti, 2004. -B. 439.",
                "book4": "Muxamedjan Tinishpayev. Vospominaniya, dokumenti, fotografii. -Almati: \"Tomiris-21\", 2017. -S.98.",
                "book5": "Rajabov Q. Turkiston Muxtoriyati vazirlari hamda milliy majlis aʼzolari hayoti va taqdiri. - Toshkent: \"Bodomzor Invest\", 2021. - B. 18-19."
            }
        },
        "abdurahmon": {
            "text": "Абдурахмон Оразбоев",
            "dob": "1888-1937 годы",
            "about": "Абдурахмон Оразбоев был известным государственным и общественным деятелем. Он родился в 1888 году в городе Янги-Маргилон (ныне Фергана) в семье служащих. Абдурахмонбек по отцовской линии является потомком казахского рода кипчаков, так же как и предки Мустафы Чокая. Его отец, Мухаммад Оразаев (умер 10 мая 1898 года), был одним из знатных людей Среднего жуза, окончил 2-й Оренбургский кадетский корпус и работал переводчиком и секретарем в администрации Маргилонского уезда. Его мать, Ниёзджон Бибиханим, была узбекской женщиной из села Аввал в Янги-Маргилонском районе Ферганской области. После смерти мужа она стала учителем. Его воспитание было значительно под влиянием матери. \n\nАбдурахмонбек окончил гимназию Скобелева (1910) и юридический факультет Московского университета (1915). Он работал помощником адвоката. В 1917 году был избран членом Всероссийского Учредительного Собрания от Ферганского избирательного округа. После учреждения Туркестанского автономного правительства в ноябре 1917 года он стал заместителем министра внутренних дел и членом Национального собрания. Позже он стал министром внутренних дел. Он был сторонником партии эсеров. После свержения автономного правительства большевиками в феврале 1918 года, А. Оразаев был захвачен большевиками. Он был амнистирован в мае 1918 года и работал в различных должностях в советских органах власти. Позже А. Оразаев был выслан в Сибирь. После того как он заболел туберкулезом, ему было разрешено вернуться к своим родственникам (сестре) в Ташкент. Он жил у своего будущего зятя, академика Кори Ниёзия. После того как некоторое время прожил в Ташкенте, он скончался около 1937 года от тяжелой болезни.\n\nУ Абдурахмонбека Оразаева было два брата и сестра. О личной жизни А. Оразаева сохранилось недостаточно информации. Его сестра, Ойшаханим Оразаева (2 сентября 1897 года – 31 января 1988 года), работала в советских школах, как и их мать. Она была одной из первых женщин-учителей в Туркестане. Она окончила женскую гимназию Скобелева (ныне Фергана) и преподавала русский язык в русско-туземной школе в Намангане. Позже она работала в советской школе в Скобелеве. Позже она стала известным математическим ученым и академиком Академии наук Узбекистана (1939), первым президентом Академии наук Узбекистана (1943-1947), доктором физико-математических наук (1939), профессором и Героем Социалистического Труда (1967).\n\nОна вышла замуж за Тошмухаммада Ниёзовича Кори-Ниёзия (1897, Ходжанд – 1970, Ташкент). Он окончил Среднеазиатский государственный университет (1929), был его ректором (1931-1933), Народным комиссаром образования Узбекской ССР и председателем Президиума Научного комитета при Совете Народных Комиссаров Узбекской ССР (1937-1938). Он также занимал другие важные должности. Интересно, что Тошмухаммад и Ойшаханим в официальных документах указаны как рожденные 2 сентября 1897 года – один в Ходжанде, другой в Скобелеве (ныне Фергана). Во времена Советского Союза Кори-Ниёзий внёс большой вклад в развитие советской культуры и науки в Узбекистане, но, с другой стороны, советская власть нанесла жестокий и беспощадный удар по духовной и национальной культуре узбекского народа.",
            "books": {
                "book1": "Rajabov Q. Turkiston Muxtoriyati vazirlari hamda milliy majlis aʼzolari hayoti va taqdiri. - Toshkent: \"Bodomzor Invest\", 2021. - B. 18-19.",
                "book2": "Marat Yeskendiruli (Ebdeshev). Ministri \"Alash Ordi\" (qozoq va rus t.). -Almati, 2008. -S. 75 – 77.",
                "book3": "Rajabov Q. Tinishboyev Muhammadjon //Oʻzbekiston milliy ensiklopediyasi. T. 8. -Toshkent: \"Oʻzbekiston milliy ensiklopediyasi\" Davlat ilmiy nashriyoti, 2004. -B. 439.",
                "book4": "Muxamedjan Tinishpayev. Vospominaniya, dokumenti, fotografii. -Almati: \"Tomiris-21\", 2017. -S.98.",
                "book5": "Rajabov Q. Turkiston Muxtoriyati vazirlari hamda milliy majlis aʼzolari hayoti va taqdiri. - Toshkent: \"Bodomzor Invest\", 2021. - B. 18-19."
            }
        },
        "hidoyatbek": {
            "text": "Хидоятбек Юрали Агаев",
            "dob": "Год рождения неизвестен",
            "about": "Хидоятбек Юрали Агаев – государственный и общественный деятель. Он родился в последней четверти XIX века в Ферганской долине. Он был широко известен в регионе как выдающийся агроном и ученый. Он занимал пост министра земельных и водных ресурсов в правительстве Туркестанской автономной республики. Он также был активным членом Туркестанского национального собрания.\nВ феврале 1918 года, когда большевики атаковали город Коканд, он был рядом с премьер-министром Мустафой Чокаем. Однако он погиб в одном из боев с большевистскими войсками в Коканде.\nЖена Х. Агаева: Жозефина Станиславовна Юргули-Ага (девичья фамилия Трушковская), окончила Петербургский патриотический институт.",
            "books": {
                "book1": "См.: Ражабов Қ. Туркистон Мухторияти вазирлари ҳамда миллий мажлис аъзолари ҳаёти ва тақдири. – Тошкент: “Bodomzor Invest”, 2021. – Б. 32-33.",
                "book2": "Мустафо Чўқай ўғли. Истиқлол жаллодлари. –Б. 49.",
                "book3": "Ражабов Қ. Туркистон Мухторияти вазирлари ҳамда миллий мажлис аъзолари ҳаёти ва тақдири. – Тошкент: “Bodomzor Invest”, 2021. – Б. 33."
            }
        },
        "solomon": {
            "text": "Соломон Гересфельд",
            "dob": "1881-1937 годы",
            "about": "Один из крупных инвесторов в Туркестане, адвокат и журналист. Председатель сионистского комитета Средней Азии. Родился 27 ноября 1881 года в Одессе. По национальности — бухарский еврей. Был свободным слушателем юридического факультета Бернского университета (Швейцария) с 1902 года. После возвращения в Россию он сдал экзамены в Одесской военной школе и начал свою военную службу в 6-м Туркестанском батальоне в Самарканде. В 1904–1906 годах он издавал газету «Самарканд» на русском языке. В 1907 году был зачислен на 2-й курс юридического факультета Одесского университета. В сентябре 1908 года он был избран в Одесский сионистский комитет и издавал газету «Одесское слово». В мае 1913 года окончил университет и вернулся в Самарканд. Стал председателем еврейского комитета в Самаркандской городской думе и был членом городской думы в 1917 году.\nВ первом составе правительства Туркестанской Автономной Республики он был единственным не коренным кандидатом и занимал пост министра финансов. Был членом Национального собрания с ноября 1917 года по февраль 1918 года. Позже он передал свою должность министра финансов Исламу Шоахмедову. Когда правительство Туркестанской автономной республики было свергнуто, он был захвачен красногвардейцами в Коканде 20 февраля 1918 года и расстрелян. Он был похоронен на станции Мельниково Среднеазиатской железной дороги (ныне Конободом). По словам Мустафы Чокая, «Гересфельд попал в руки большевиков в Самарканде».\nПо требованию бухарских евреев, тело С. Гересфельда было эксгумировано 16 апреля 1918 года и повторно похоронено еврейской общиной на еврейском кладбище в Самарканде. На момент своей смерти С.А. Гересфельд не исполнилось еще 37 лет.",
            "books": {
                "book1": "Мустафо Чўқай ўғли. Истиқлол жаллодлари. – Б. 49.",
                "book2": "Герцфельд, Соломон Абрамович //Материал из Википедии – эркин энциклопедия..."
            }
        },
        "mustafo": {
            "text": "Мустафа Чокаев",
            "dob": "1890-1937 годы",
            "about": "Мустафа Чокаев был выдающимся государственным и общественным деятелем, а также последовательным борцом за независимость народов Туркестана.\nОн родился 25 декабря 1890 года (по новому стилю 7 января 1891 года) в деревне Авлиятарангил в Перовском районе Сырдарьинской области (по некоторым источникам, он родился в деревне Наршоки). Его отец, Чокайбей, был дворянином из казахского племени кипчаков, а предки его матери были связаны с Хивой. В своей автобиографии Мустафа Чокаев считал себя кипчаком.\nМустафа Чокаев получил начальное образование в Окмачите, затем учился в Ташкентской мужской гимназии с 1902 по 1910 год. Он окончил юридический факультет Санкт-Петербургского университета в 1914 году. Замечательно, что этот университет также окончил Александр Керенский, будущий премьер-министр Временного правительства России, который завершил обучение в 1899 и 1904 годах. С 1916 по 1917 год Мустафа Чокаев работал секретарем и переводчиком в мусульманской фракции IV Государственной думы России. После жестокого подавления восстания 1916 года в Туркестане он посетил разрушенные города региона, включая Джиззак, в составе специальной комиссии, возглавляемой А. Керенским.\nВ апреле 1917 года Мустафа Чокаев вернулся из Петрограда в Ташкент и стал центральной фигурой в политических процессах Туркестана. Он начал издавать две газеты в Ташкенте: «Бирлик туғи» и «Свободный Туркестан» весной 1917 года. С 16 по 23 апреля 1917 года он возглавил I съезд всех мусульман Туркестана в Ташкенте, на котором был основан Центральный Совет мусульман Туркестана (Краймуссовет).\nОн активно участвовал в Первом съезде всех киргизов (или казахов) в Оренбурге с 21 по 28 июля 1917 года. В августе 1917 года он стал членом Туркестанского комитета Временного правительства. После того как большевики захватили власть в Ташкенте, Мустафа Чокаев и Национальный центр под его руководством переехали в Коканд в начале ноября.\nС 26 по 28 ноября 1917 года в Коканде состоялся Чрезвычайный IV съезд всех мусульман Туркестана, на котором Мустафа Чокаев, как председатель, произнес вступительное слово. Он был избран членом исполнительного комитета съезда. Участники съезда три дня обсуждали будущее политическое устройство Туркестана.\nВ декабре 1917 года Мустафа Чокаев стал премьер-министром Туркестанского автономного правительства и также занял пост министра иностранных дел в правительстве Алаш Орда.\nПозже он стал видным деятелем борьбы против большевистского господства и продолжал свою деятельность в Европе, публикуя статьи и книги на разных языках, включая русский, узбекский, казахский, турецкий, французский и английский.",
            "books": {
                "book1": "Rajabov Q. Turkiston Muxtoriyati vazirlari hamda milliy majlis aʼzolari hayoti va taqdiri. – Toshkent: “Bodomzor Invest”, 2021. – B. 23-29.",
                "book2": "Sadikova B. Mustafa Chokay. –Almati: “Alash”, 2004. –S. 231.",
                "book3": "Mustafa Shokay.",
                "book4": "Rajabov Q. Turkiston Muxtoriyati vazirlari hamda milliy majlis aʼzolari hayoti va taqdiri. – Toshkent: “Bodomzor Invest”, 2021. – B. 23-29.",
                "book5": "Rajabov Q. Mustafo Choʻqay //Oʻzbekiston milliy ensiklopediyasi. T. 6. –Toshkent: “Oʻzbekiston milliy eniklopediyasi” Davlat ilmiy nashriyoti, 2003. –B. 157.",
                "book6": "Qarang: Mustafo Choʻqay oʻgʻli. Istiqlol jallodlari (1917-yil xotiralari). Soʻzboshi muallifi B. Qosimov. –Toshkent: Gʻafur Gʻulom nomidagi Nashriyot-matbaa birlashmasi, 1992. – 80 bet; Mustafa Chokayev. Otrыvki iz vospominaniy v 1917 g. Sostavleniye, predisloviye, primechaniya S.M. Isxakova. –Tokio-Moskva, 2001. – 54 str.",
                "book7": "Mustafa Shokay.",
                "book8": "Mariya Chokay. Ya pishu Vam iz Nojana... (Vospominaniya, pisma, dokumentы). –Almati: “Kaynar”, 2001. –S. 165.",
                "book9": "Sadikova B. Istoriya Turkestanskogo legiona v dokumentax. –Almati: “Kaynar”, 2002. – 248 str.; On je. Mustafa Chokay v emigratsii. –Almatы: “Mektep”, 2009. – 248 str.",
                "book10": "Mustafa Shoqay. Shigʻirmalarinin toliq jinagʻi. On yeki tomdiq. Tom I – XII. Kurastirgʻon algʻi soz ben tusinidirmelerdi jazgʻan K.Yesmagʻambetov. –Almati: “Dayk-Press”, 2012 – 2014.",
                "book11": "Rajabov Q. Turkiston Muxtoriyati vazirlari hamda milliy majlis aʼzolari hayoti va taqdiri. – Toshkent: “Bodomzor Invest”, 2021. – B. 23-29."
            }
        },
        "sulton": {
            "text": "Ислам Султан Шоахмедов",
            "dob": "1882-1937 годы",
            "about": "Выдающийся мусульманский общественный деятель и политик. Родился 21 ноября 1882 года в Оренбурге в татарско-башкирской семье. Его отец, Шагисултон (Султан) Шагияхметович Шагияхметов (1855-1896), был из башкирского племени Мензалинского уезда Уфимской губернии. Он окончил юридический факультет Казанского университета в 1876 году, работал учителем в Татарской учительской школе в Оренбурге (1876-1890), затем следователем в судебных органах Оренбургской области.\nЕго мать, Гайнизиган Мухаммад-Садыковна Нигматуллина, была татаркой, происходившей из дворянского рода. Мировоззрение Ислама Шоахмедова в основном формировалось среди оренбургских татар, и его мать сыграла важную роль в формировании его духовных и социальных взглядов.\nПосле окончания Оренбургской мужской гимназии (1905) Шоахмедов поступил в Санкт-Петербургский университет, сначала на Восточное отделение, а затем на юридический факультет (1905-1910). Помимо тюркского и русского, он свободно владел английским, французским и немецким языками. Во время учебы он заинтересовался социал-демократическим движением в России и вел пропагандистскую работу среди солдат Ташкентского гарнизона в 1907 году.\nОн завершил полный курс обучения в университете в конце 1910 года и в январе 1911 года получил диплом. В августе 1912 года начал работать в судебной палате Санкт-Петербурга. В октябре 1912 года стал редактором 'Мусульманской газеты'. В числе прочего, он защищал представителей партии меньшевиков по ряду судебных дел. Шоахмедов боролся за права мусульман в Российской империи. В начале 1915 года он приехал в Коканд и начал свою деятельность в качестве помощника следователя в Скопинском окружном суде. Он сыграл значительную роль в выпуске газеты 'Садой Фергана'. В 1916 году он основал общество 'Гайрат' и издал газету 'Туркестанский край', также будучи ее редактором.\nВо время Февральской революции он находился в Петрограде и сблизился с Народной социалистической партией. К концу марта 1917 года он вернулся в Туркестан. С июня 1917 года он исполнял обязанности председателя Исполнительного комитета Национального Совета. Шоахмедов стал участником II Всероссийского съезда мусульман, который состоялся в Казани в 1917 году.\nВ 1917 году Шоахмедов активно участвовал в автономистском движении в Туркестане. Он был редактором и издателем возродившейся газеты 'Туркестанский край' (Ташкент, 1917). Он был членом Центрального комитета мусульман Туркестана и активно участвовал в I-IV съездах мусульман Туркестана. Он был назначен заместителем премьер-министра, а позже министром финансов в правительстве Туркестанской автономии. Он был автором проекта Конституции Туркестанской автономной республики. После роспуска правительства в 1918 году он был арестован большевиками в Кокандской крепости.\nПо данным газеты 'Улуг' Туркестан' весной 1918 года, он сошел с ума от пыток в ташкентской тюрьме и был переведен в тюремный госпиталь. В мае 1918 года, после того как большевики предоставили амнистию выжившим членам правительства Туркестанской автономии, Шоахмедов был освобожден из заключения.\nС 1919 по 1920 год Шоахмедов сотрудничал с большевиками и работал в Центральном совете народного хозяйства Туркестана и в Кокандском Совете революционного комитета в 1920 году. В конце 1920 года он тайно уехал в Маньчжурию. В начале 1921 года он оказался в лагере для русских беженцев в Пешаваре (Британская Индия). В мае 1921 года письмо Шоахмедова, сильно больного, попало в руки русских эмигрантов в Париже. Эта история была также упомянута Мустафой Чокаем в его статье. На средства родственника, богатого торговца Агафурова, Шоахмедов в августе 1921 года приехал во Владивосток. Он планировал отправиться из Владивостока в Париж, но по некоторым данным, он заболел и остался в Владивостоке у родственников. Предположительно, он умер в 1922 году или позже.\nВ 1931 году в журнале 'Яш Туркестан' в Берлине Мустафа Чокай писал, что в 1922 году, когда он встретился с сестрой Шоахмедова в Париже, его товарищ был тяжело болен. После этого они не смогли узнать о дальнейшей судьбе Шоахмедова.\nУ Шоахмедова был брат Шахгалий (1882-?), также юрист, и четыре сестры: Биби Марьям, Биби Галия, Биби Соля, Биби Зухра. Его жена - Ольга Викторовна Бенедская (с 1909 года).",
            "books": {
                "book1": "Rajabov Q. Turkiston Muxtoriyati vazirlari hamda milliy majlis aʼzolari hayoti va taqdiri. – Toshkent: “Bodomzor Invest”, 2021. – B. 20.",
                "book2": "Isxakov S. Revolyutsioner, politik, gosudarstvenniy deyatel. Sh.-I.Shagiaxmetov // “Rossiya XXI” (Moskva). 2018. №4. –S.6-29.",
                "book3": "Rajabov Q. Turkiston Muxtoriyati vazirlari hamda milliy majlis aʼzolari hayoti va taqdiri. – Toshkent: “Bodomzor Invest”, 2021. – B. 21.",
                "book4": "Shagiaxmetov Shaxislam (Islom) Shagisultonovich //Islam v Sankt-Peterburge. Ensiklopedicheskiy slovar. –Moskva-Nijniy Novgorod: “Medina”, 2009. –S. 301 – 302.",
                "book5": "Mustafa Shoqay. Shigʻirmalarinin toliq jinagʻi. On yeki tomdiq. Tom V. Kurastirgʻon algʻi soz ben tusinidirmelerdi jazgʻan K.Yesmagʻambetov. –Almati: “Dayk-Press”, 2013. –S.79-80.",
                "book6": "Rajabov Q. Turkiston Muxtoriyati vazirlari hamda milliy majlis aʼzolari hayoti va taqdiri. – Toshkent: “Bodomzor Invest”, 2021. – B. 21-23."
            }
        },
        "ubaydulla": {
            "text": "Убайдулла Ходжаев",
            "dob": "1878-1942 годы",
            "about": "Убайдулла Ходжаев [Убайдуллаходжа Асадуллаходжаев; Убайдулла Асаддуллаевич Ходжаев] – известный государственный и общественный деятель, один из ярких представителей джадидизма в Туркестане и один из основателей узбекской журналистики. Он родился в 1886 году в семье ремесленников в Ташкенте. Некоторые источники указывают, что он родился 12 мая 1878 года. Он учился в Саратовском юридическом институте (1908–1912). Уже в студенческие годы он начал размышлять о решении актуальных проблем своего времени и вел переписку с известным русским писателем Львом Толстым (1909). С 1913 года работал частным адвокатом в Ташкентском окружном суде. Присоединившись к джадидистскому движению, он быстро стал одним из его лидеров. Он был одним из основателей общества “Турон” (1913). В апреле 1914 года он начал издавать в Ташкенте газету “Садои Туркистон”, где работал редактором. Он собрал вокруг себя молодежь и создал подпольное общество “Умид”, которое позднее стало называться “Тараккипарвар” и стало одной из ведущих организаций туркестанских джадидов. После того как газета “Садои Туркистон” была закрыта местными властями Российской империи в апреле 1915 года, он переехал в Андижан и начал издавать русскоязычную газету “Туркестанский голос.”\n В 1916 году он стал председателем “Туркестанского комитета по набору рабочих.” Вместе с местным инвестором Миркомилбоем Мирмоминбоевым он поехал в Петроград, чтобы добиться отмены указа императора Николая II о наборе рабочих. Он был секретарем и членом Центрального Совета мусульман Туркестана, образованного на I Всетуркестанском мусульманском съезде в апреле 1917 года. Он также был членом Исполнительного комитета Всевсероссийского мусульманского съезда в мае 1917 года. В марте 1917 года он стал председателем организации “Шурои Исламия,” образованной в Ташкенте. Он был одним из инициаторов движения за независимость. С ноября 1917 по февраль 1918 года он был министром военных дел в правительстве Туркестанской автономии.\n В феврале 1918 года, по поручению правительства, Убайдулла Ходжаев поехал на Кавказ и решил вопрос о поставках зерна в Туркестан. По словам Мустафы Чокаева, после распуска правительства автономии, он был захвачен большевиками на железной дороге Ашхабад-Самарканд. После того как советские власти амнистировали его в мае 1918 года, он поехал в Оренбург и активно участвовал в создании Башкирской Автономной Республики в ноябре 1918 года.\n Убайдулла Ходжаев несколько раз был арестован советским режимом (1918, 1929, 1931, 1938). Он жил в бедности в доме своей сестры в Ташкенте. Он перевел на узбекский язык знаменитое произведение английского писателя Дж.Р. Киплинга “Маугли”. В 1938 году он был арестован снова 20 февраля в Ташкенте и приговорен решением Специального совета НКВД СССР к 8 годам в трудовом лагере 14 мая 1939 года. Он был отправлен на станцию Котлас Горьковской железной дороги для отбывания наказания. Он умер в тюрьме Котласа 31 октября 1942 года. После его смерти советская власть реабилитировала его. Его племянник, народный писатель Узбекистана Шукрулло (1921–2020), писал о его деятельности в своем романе “Тирик рухлар” (1999) и описывал судьбы репрессированных сограждан в своих воспоминаниях “Кафансиз камиганлар” (1990).",
            "books": {
                "book1": "Rajabov Q. Turkiston Muxtoriyati vazirlari hamda milliy majlis aʼzolari hayoti va taqdiri. – Toshkent: “Bodomzor Invest”, 2021. – B. 30-32.",
                "book2": "Rajabov Q. Asadullaxoʻjayev Ubaydullaxoʻja //Oʻzbekiston milliy ensiklopediyasi. T. 1. – Toshkent: “Oʻzbekiston milliy ensiklopediyasi” Davlat ilmiy nashriyoti, 2000. – B. 443.",
                "book3": "Unutilmas siymolar. Jadidchilik harakatining namoyandalari. Matnlar muallifi: S. Aʼzamxoʻjayev, D. Alimova, Sh. Rizayev. – Toshkent: “Akademiya”, 1999. – B. 22.",
                "book4": "Mustafo Choʻqay oʻgʻli. Istiqlol jallodlari. – B. 49.",
                "book5": "Bu haqda qarang: Oʻzbekiston Milliy xavfsizlik xizmati arxivi, P – 35554, 2, 62 – varaqlar; P – 19990, 2, 31 – varaqlar.",
                "book6": "Rajabov Q. Turkiston Muxtoriyati vazirlari hamda milliy majlis aʼzolari hayoti va taqdiri. – Toshkent: “Bodomzor Invest”, 2021. – B. 31-32.",
                "book7": "Rajabov Q. Turkiston Muxtoriyati vazirlari hamda milliy majlis aʼzolari hayoti va taqdiri. – Toshkent: “Bodomzor Invest”, 2021. – B. 32."
            }
        },
        "obidjon": {
            "text": "Обиджон Махмудов",
            "dob": "1878-1942 годы",
            "about1": "Обиджон Абдухоликович Махмудов [Обид Чаток] был представителем джадидского движения в Туркестане, государственным деятелем, общественным и политическим лидером, крупным инвестором и издателем. Обиджон Махмудов родился в 1871 году в Маргилане. Его отец, Абдухолик Абдукадырбек, занимал должность главного артиллериста в Бухарском эмирате. Абдухолик, по приглашению друга, приехал в Маргилан, где упал с лошади и сломал ногу. Он был вынужден остаться в доме друга до полного выздоровления. В это время он женился на близкой родственнице своего друга, Робии, и остался жить там. Их сын, Обиджон Махмудов, был рожден. Позже его старший брат Миродил купил дом в районе Шейхон в Коканде, и Обиджон переехал туда. Он получил образование в медресе и помогал своему брату заниматься пчеловодством, изучая ремесло у него, а его дядя Мирзакарим, ювелир, обучал его торговле.\n Обиджон Махмудов позже переехал в Коканд, получил образование в медресе и затем отправился на полуостров Челекен на Каспийском море для добычи нефти, в итоге стал богатым. Его быстрый рост к богатству привлек внимание к нему со стороны специальной полиции Российской империи — Туркестанского регионального охранного отдела. С 1897 по 1901 год Обиджон окончил факультет горного дела в Санкт-Петербургском университете. Он стал выдающимся специалистом в области горного дела, а затем государственным деятелем, писателем, работающим как на узбекском, так и на русском языках, а также ученым, владеющим арабским и турецким языками и имеющим значительные знания в области экономики и геологии.\n Вернувшись в Коканд, Обиджон занялся горной промышленностью, участвуя в открытии нескольких нефтяных месторождений в Ферганской долине. Он купил серное месторождение в Шорсу. После окончания учебы он вернулся в Коканд и начал работать на нефтяных месторождениях, активно занимаясь разработкой месторождений в таких районах, как Кармана, Шорсу, Сариқкоргон, Полвонтуш, Оламушук и Мумконсой. В 1905 году его отправили в Азербайджан для изучения добычи нефти и озокерита, и он вернулся с опытом для разработки нефтяных месторождений.\n По мнению историка Н. Комилова, группа инвесторов во главе с О. Махмудовым основала Кокандское биржевое общество 15 ноября 1906 года. 9 января 1907 года делегация из 60 человек во главе с председателем биржи А.И. Вегелем и Обиджоном Махмудовым запросила разрешение у военного губернатора Ферганской области на создание Кокандской биржи. Биржа была официально создана в 1907 году.\n Вклад Махмудова был важным при разработке регламента биржи, и он активно участвовал в ее управлении. Регламент биржи включал прозрачность торгов, свободу формирования цен и равные права для всех участников.\n Помимо своей предпринимательской деятельности, Обиджон Махмудов был ключевой фигурой в сфере издательства. В 1913 году он получил лицензию на издание местной газеты под названием «Нашри Обиджан» в Коканде. Позже, в 1914 году, он основал газету «Садои Фаргона» на русском и узбекском языках, играя важную роль в джадидском движении, как финансово, так и через свои публикации, призывая к образованию и национальному пробуждению в Туркестане.\n Работы Обиджона Махмудова были направлены на достижение экономической независимости страны. Он писал статьи в газете «Садои Фаргона» о экономической ситуации в Туркестане, подчеркивая негативные последствия капиталистических экономических отношений и призывая к модернизации производственных методов, чтобы избежать экономического упадка.",
            "about2": "Обиджон Махмудов был приговорен к 5 годам тюремного заключения в 1926 году по решению коллегии ОГПУ. В мае 1926 года, после его письма к М.И. Калинину, председателю РСФСР МИЦ, его освободили из тюрьмы через 6 месяцев в обмен на конфискацию всего его имущества. После освобождения из тюрьмы он работал арендаторам на нефтяном месторождении в Шорсу и продолжал свою любимую профессию до конца своей жизни. В 1933 году Обиджон Махмудов участвовал в Всероссийской сельскохозяйственной выставке в Москве, привез образцы полезных ископаемых, найденных в Ферганской области, и снова принял участие как горный инженер, что является его последней известной деятельностью. Обиджон Махмудов скончался 21 ноября 1936 года от эндокардита. Он был похоронен на кладбище «Шайхон» в Коканде. Обиджон Махмудов, лидер кокандских джадидов, выдающийся просветитель, издатель и геолог, также служил на благо народа и будущего страны. Его прогрессивные идеи включали правильное понимание роли религии в духовном развитии человека, активизацию процессов формирования рыночных отношений, создание прогрессивных демократических институтов, формирование национального развития в стране и развитие издательской деятельности. Он также пропагандировал освобождение народа от колониального и феодального угнетения, необходимость достижения экономической независимости. Его глубокие знания социальной жизни региона и осознание проблем, которые беспокоили народ, заставили его активно участвовать в решении проблем общества как сын этой земли. Как человек, который внес значительный вклад в развитие просвещения в Туркестане, он был прогрессивной и интеллектуальной фигурой, борющейся за выживание и прогресс нации.",
            "books": {
                "book1": "Komilov N. Jadid Obidjon Mahmudovning ijtimoiy-siyosiy va iqtisodiy qarashlari // “Ilmiy xabarnoma”. 2020. № 5 (49). – B. 47-48.",
                "book2": "Qarang: Rajabov Q. Turkiston Muxtoriyati vazirlari hamda milliy majlis aʼzolari hayoti va taqdiri. – Toshkent: “Bodomzor Invest”, 2021. – B. 33-35.",
                "book3": "Komilov N. Turkiston jadidlaridan Obidjon Mahmudovning hayoti, ijtimoiy-siyosiy, madaniy faoliyati (1871-1936-y.y.). Tarix fanlari boʻyicha falsafa doktori (PhD) dissertatsiyasi avtoreferati. – Andijon, 2021. – B. 16.",
                "book4": "Rajabov Q. Turkiston Muxtoriyati vazirlari hamda milliy majlis aʼzolari hayoti va taqdiri. – Toshkent: “Bodomzor Invest”, 2021. – B. 33-34; Komilov N. Turkiston jadidlaridan Obidjon Mahmudovning hayoti, ijtimoiy-siyosiy, madaniy faoliyati (1871-1936-y.y.). Tarix fanlari boʻyicha falsafa doktori (PhD) dissertatsiyasi avtoreferati. – Andijon, 2021. – B. 16.",
                "book5": "Komilov N. Turkiston jadidlaridan Obidjon Mahmudov faoliyati mahalliy va chet olimlari nigohida // “The Light of Islam”. 2020. № 3. –B. 59-60.",
                "book6": "Rajabov Q. Turkiston Muxtoriyati vazirlari hamda milliy majlis aʼzolari hayoti va taqdiri. – Toshkent: “Bodomzor Invest”, 2021. – B. 33-35; Komilov N. Turkiston jadidlaridan Obidjon Mahmudovning hayoti, ijtimoiy-siyosiy, madaniy faoliyati (1871-1936-y.y.). Tarix fanlari boʻyicha falsafa doktori (PhD) dissertatsiyasi avtoreferati. – Andijon, 2021. – B. 18-19.",
                "book7": "Komilov N. Turkiston jadidlaridan Obidjon Mahmudovning hayoti, ijtimoiy-siyosiy, madaniy faoliyati (1871-1936-y.y.). Tarix fanlari boʻyicha falsafa doktori (PhD) dissertatsiyasi avtoreferati. – Andijon, 2021. – B. 18-19.",
                "book8": "Komilov N. Jadid Obidjon Mahmudovning ijtimoiy-siyosiy va iqtisodiy qarashlari // “Ilmiy xabarnoma”. 2020. № 5 (49). – B. 50-51.",
                "book9": "Komilov N. Turkiston jadidlaridan Obidjon Mahmudovning hayoti, ijtimoiy-siyosiy, madaniy faoliyati (1871-1936-y.y.). Tarix fanlari boʻyicha falsafa doktori (PhD) dissertatsiyasi avtoreferati. – Andijon, 2021. – B. 11.",
                "book10": "Komilov N. Turkiston jadidlaridan Obidjon Mahmudovning hayoti, ijtimoiy-siyosiy, madaniy faoliyati (1871-1936-y.y.). Tarix fanlari boʻyicha falsafa doktori (PhD) dissertatsiyasi avtoreferati. – Andijon, 2021. – B. 11.",
                "book11": "Komilov N. Turkiston jadidlaridan Obidjon Mahmudovning hayoti, ijtimoiy-siyosiy, madaniy faoliyati (1871-1936-y.y.). Tarix fanlari boʻyicha falsafa doktori (PhD) dissertatsiyasi avtoreferati. – Andijon, 2021. – B. 19-20.",
                "book12": "Komilov N. Turkiston jadidlaridan Obidjon Mahmudovning hayoti, ijtimoiy-siyosiy, madaniy faoliyati (1871-1936-y.y.). Tarix fanlari boʻyicha falsafa doktori (PhD) dissertatsiyasi avtoreferati. – Andijon, 2021. – B. 18-19.",
                "book13": "Rajabov Q. Turkiston Muxtoriyati vazirlari hamda milliy majlis aʼzolari hayoti va taqdiri. – Toshkent: “Bodomzor Invest”, 2021. – B. 33-35;",
                "book14": "Komilov N. Turkiston jadidlaridan Obidjon Mahmudovning hayoti, ijtimoiy-siyosiy, madaniy faoliyati (1871-1936-y.y.). Tarix fanlari boʻyicha falsafa doktori (PhD) dissertatsiyasi avtoreferati. – Andijon, 2021. – B. 20.",
                "book15": "Komilov N. Turkiston jadidlaridan Obidjon Mahmudovning hayoti, ijtimoiy-siyosiy, madaniy faoliyati (1871-1936-y.y.). Tarix fanlari boʻyicha falsafa doktori (PhD) dissertatsiyasi avtoreferati. – Andijon, 2021. – B. 20-21.",
                "book16": "Rajabov Q. Turkiston Muxtoriyati vazirlari hamda milliy majlis aʼzolari hayoti va taqdiri. – Toshkent: “Bodomzor Invest”, 2021. – B. 33-35; Komilov N. Turkiston jadidlaridan Obidjon Mahmudovning hayoti, ijtimoiy-siyosiy, madaniy faoliyati (1871-1936-y.y.). Tarix fanlari boʻyicha falsafa doktori (PhD) dissertatsiyasi avtoreferati. – Andijon, 2021. – B. 20-21.",
                "book17": "Komilov N. Turkiston jadidlaridan Obidjon Mahmudovning hayoti, ijtimoiy-siyosiy, madaniy faoliyati (1871-1936-y.y.). Tarix fanlari boʻyicha falsafa doktori (PhD) dissertatsiyasi avtoreferati. – Andijon, 2021. – B. 16-17.",
                "book18": "Mustafo Choʻqay oʻgʻli. Istiqlol jallodlari. –B. 49.",
                "book19": "Rajabov Q. Turkiston Muxtoriyati vazirlari hamda milliy majlis aʼzolari hayoti va taqdiri. – Toshkent: “Bodomzor Invest”, 2021. – B. 33-35.",
                "book20": "Komilov N. Turkiston jadidlaridan Obidjon Mahmudovning hayoti, ijtimoiy-siyosiy, madaniy faoliyati (1871-1936-y.y.). Tarix fanlari boʻyicha falsafa doktori (PhD) dissertatsiyasi avtoreferati. – Andijon, 2021. – B. 20-21.",
                "book21": "Komilov N. Turkiston jadidlaridan Obidjon Mahmudovning hayoti, ijtimoiy-siyosiy, madaniy faoliyati (1871-1936-y.y.). Tarix fanlari boʻyicha falsafa doktori (PhD) dissertatsiyasi avtoreferati. – Andijon, 2021. – B. 16-18."
            }
        }
    }
}