{
    "Write Article": "Maqolani yozing",
    "Save": "Saqlash",
    "Name": "Nomi",
    "Description": "Tavsif",
    "WriteArticle": "Maqolani yozing",
    "Kompaniya haqida": "Kompaniya haqida",
    "Xizmatlar": "Xizmatlar",
    "Loyihalar": "Loyihalar",
    "goBack": "Ortga qaytish",
    "main": "Asosiy",
    "history": "Muxtoriyat tarixi",
    "historyDoc": "Arxiv hujjatlar",
    "articles": "Maqolalar",
    "govermentMembers": "Hukumat a'zolari",
    "sources": "Manbalar",
    "write": "Maqola yozish",
    "profile": "Profil",
    "logout": "Chiqish",
    "login": "Kirish",
    "media": "Media",
    "books": "Kitoblar",
    "autoRefer": "Avtoreferatlar",
    "videoLink": "Videoni ko‘rish uchun bosing",
    "cardFirstHeaderText": "Erk ista, tik tur, uyg‘on Turkiston!",
    "cardFirstSubText": "Turkiston muxtoriyati – ajdodlarimizning buyuk orzusi, millatning sha'ni va g‘ururi! Biz ozodlik, adolat va taraqqiyot yo‘lida kurashamiz! Erk va hurriyat sari intilgan xalq hech qachon qul bo‘lmaydi! Yashasin mustaqil va muxtor Turkiston!",
    "secondTextCardHeader1": "Yashasun",
    "secondTextCardHeader2": "Turkiston Muxtoriyati.",
    "secondTextCardSub1": "<p>Turkiston musulmonlarining to‘rtinchi favqulodda qurultoyi Turkiston o‘lkasida bo‘lg‘an xalqlarning xohishlari bo‘yicha Rusiya inqilobi tarafidan berilgan asoslarga binoan Fidiratsiya asosiga qurulg‘an Rusiya Jumhuriyati ila birgalikda qolg‘ani holda Turkistonni yerlik muxtoriyati, ya’ni <span>\"территорриальный автономиялик\"</span> e’lon qiladur.</p>",
    "secondTextCardSub2": "<p>Bu muxtoriyatning ne suratda vujudga qo‘yilmog‘ini yaqin orada yig‘iladurg‘on Umumturkiston xalqining <span>\"Учредительний Собрания\"</span>si (\"Turkiston Majlisi Muassasasi\")ga topshiradur. Shuning ila barobar Turkiston o‘lkasida aqalliyat tashkil qilg‘an millatlarning huquqlarining har jihatidan saqlanilmog‘ini ham tantanali suratda bayon etadur! </p>",
    "secondTextCardFooter1": "“Shahri Ho’qand”",
    "secondTextCardFooter2": "Hijriy 1336 sana 25 Safari oxir / Milodiy1917 yil 27 noyabr",
    "cholpon": "Abdulhamid Cho’lpon",
    "cholponText": "Bilmadim, kimlarning umidi yo’q bo’lur, So’ng damda yaproqlar qizorib yondilar? Bilmadim, kimlarning qismati uzulur, Kuz chog’i... tuproqlar gezarib qoldilar?",
    "munavvar": "Munavvar qori Abdurashidxonov",
    "munavvarText": "Bugungacha Ovrupo xalqi osmonga uchar ekan, bizda soch soqol nizolari, ovrupoliklar dengiz ostida suzar ekan,  bizda uzun va qisqa kiyim janjallari, Ovrupo shahrlari butun elektr bilan isitulur va yoritulur ekan, bizda maktablarda jo'g'rofiya va tibbiyot o'qitish, o'qitmaslik ixtiloflari... davom etar.",
    "behbudiy": "Mahmudxo’ja Behbudiy",
    "behbudiyText": "O’rtadan nifoqni ko‘taringiz! Turkiston bolalarini ilmsiz qo‘ymangizlar! Hammaga ozodlik yo‘lini ko‘rsatingizlar! Ozodlikni tezlik ila yuzaga chiqaringizlar! Bizlar ul choqda qabrimizda tinch yoturmiz!",
    "memberAboutFooterText": "<h1>Xalq dengizdir, <span>Xalq kuchdir</span></h1>",
    "heading": "Muxtoriyat hukumati a’zolari",
    "subHeading": "Hijriy 1336 sana 25 Safari oxiri, Milodiy 1917 yil 27 noyabr — “Shahri Ho’qand”",
    "membersHeading": "Muxtoriyat <span>hukumati</span> a’zolari",
    "membersSubText": "Turkiston Muxtoriyatining Muvaqqat hukumati tarkibiga muxtoriyatchilik harakatining faol ishtirokchilari kirdi. Quyidagi kishilar hukumat aʼzolari bo‘ldilar:",
    "countersSecHeader": "Asosiy ko‘rsatkichlar",
    "countersSecSub": "Bugungi kunda yurtimizda milliy-demokratik davlatchilikni barpo etishda ilk tajriba bo‘lgan Turkiston Muxtoriyati uchun kurash tarixi alohida ahamiyat kasb etadi. Ilmiy jamoatchilik eʼtiborini o‘ziga jalb etgan bu tarix hozirda nafaqat ilmiy, balki amaliy va hatto siyosiy qiziqish uyg‘otdi.",
    "historyPageList": {
        "header1": "Turkiston <span>muxtoriyati</span> tarixi",
        "header2": "Turkiston Muxtoriyatining Muvaqqat hukumati tarkibiga muxtoriyatchilik harakatining faol ishtirokchilari kirdi. Quyidagi kishilar hukumat aʼzolari bo‘ldilar:",
        "text1": "Oʻzbekiston mustaqillikka erishgach, respublika hayotining barcha jabhalarida tub islohotlar amalga oshirildi va oshirilmoqda. O‘zbek xalqining oʻz taqdirini oʻzi belgilashi milliy tiklanish bog‘liq jarayonlarni chuqur idrok etishda milliy davlat qurilishi tajribasini ilmiy o‘rganilishi, O‘zbekistonni yangilanish va taraqqiyot yo‘lidagi tajribalarni umumlashtirishni taqozo etadi.",
        "text2": "Bugungi kunda yurtimizda milliy - demokratik davlatchilikni barpo etishda ilk tajriba bo‘lgan Turkiston Muxtoriyati uchun kurash tarixi alohida ahamiyat kasb etadi.Ilmiy jamoatchilik o‘ziga jalb etgan bu tarix hozirda nafaqat ilmiy, balki amaliy va hatto siyosiy qiziqish uygʻotdi.Chunki uni yoritishda oʻsha yillar voqealariga qayta baho berilmoqda, Turkistonning siyosat, jamoat arboblari va mutafakkirlarining ozodlik va istiqlol uchun kurashdagi faoliyati aniqlanmoqda.",
        "text3": "XX asr boshida muxtoriyatchilik harakatining mafkurachilari boʻlgan jadidlar Turkistonda madaniy-maʼrifiy, keyinchalik esa siyosiy harakat sifatida tarqalib, oʻz maqsadlarini dunyoviy davlat qurishdan iborat deb eʼlon qilgan edilar. Jadidlar buning uchun davlatning iqtisodiy va siyosiy tizimini isloh etish hamda maorif va fanni taraqqiy ettirishga bel bog‘lagan edilar. Ammo bu yo‘lni tanlash bilan ular milliy va maʼnaviy boyliklardan voz kechish emas, balki ular negizida bosqichma-bosqich oʻzgarishlarga erishib shu vaqtgacha xalq fikrida oʻrnashib qolgan eskicha qarashlardan xalos boʻlmoqchi edilar. Chunki bular davlat taraqqiyoti va xalq ongining osishiga toʻsqinlik qilardi.",
        "text4": "1917-yil Fevral oyida Rossiyada chor hukumatiga qarshi kurash shu darajada avjiga mindiki, natijada mutlaq monarxiya tizimi quladi. Uch asr davomida Rossiya imperiyasini to‘xtovsiz boshqarib kelgan Romanovlar sulolasi hukmronligi agʻdarildi. 1917-yil 27-fevralda Petrogradda ishchi va soldatlar deputatlari Soveti tashkil qilindi. Shundan keyin Rossiyaning yirik shaharlarida sovet hokimiyati oʻrnatila boshladi.",
        "text5": "Boʻlib oʻtgan Davlat toʻntarishidan keyingi davr Turkiston xalqlarining siyosiy uygʻonishi, siyosiy kuchlarining tashkillashuvida muhim bosqich boʻldiki, bu kuchlar sobiq Rossiya imperiyasida rivojlanib kelayotgan demokratik kuchlarga tayanib, demokratik Rossiya tarkibida milliy-hududiy avtonomiya negizida mustamlaka zulmidan ozod boʻlish va keng suverenitet asosida oʻz davlatchiligini barpo etish yoʻlida dasturiy faoliyatlari bilan ochiqdan-ochiq kurashga kirishdilar. Buning uchun avtonomiya tarafdorlari tomonidan oʻzbek, qozoq, tojik, tatar, turkman va qirgʻizlarni birgalikda ish olib borishlari kerakligi gʻoyasi xalqqa tushuntirildi.",
        "text6": "1917-yilda “oʻz taqdirini oʻzi belgilash” gʻoyasi bilan bogʻliq “avtonomiya” soʻzini anglatgan “Muxtoriyat” tushunchasi eng ommaviy iboraga aylangan edi. Oʻsha tarixiy davrda jadidlar Rossiyadan ajralib mustaqil rivojlanish nechoqlik ogʻirligini va Turkiston qiyin sharoitga tushib qolishini oldindan koʻzlashgan edi. Chunki Turkiston Rossiya imperiyasi bilan har tomonlama iqtisodiy jihatdan bogʻlangan edi. Shuning uchun jadidlar tashkil etilayotgan Rossiya Federativ Demokratik Respublikasi (RFDR) bilan yagona iqtisodiy doirada mustaqil rivojlanishni kun tartibiga qoʻyishgan. Ular Turkistonga keng vakolatli milliy-hududiy avtonomiya, yaʼni muxtoriyat berilishining tarafdori edilar.",
        "text7": "Taraqqiyparvarlar hurriyat va muxtoriyat uchun hayot-mamot kurashi vaqti yetib kelganini anglab mustamlakachilikni qattiq va ayovsiz tanqid qila boshladilar, oldingi konstitutsiyaviy yakka hokimlik (monarxiya) tuzumi gʻoyalaridan voz kechib, Turkistonga Rossiya Demokratik Federativ Respublikasi tarkibida milliy-hududiy avtonom respublika, yaʼni muxtoriyat berilishini talab qila boshladilar. Muxtoriyatchilarning dastur hujjatlarida asosiy eʼtibor milliy-hududiy muxtoriyat tamoyillarini amalga oshirish yoʻllarini ishlab chiqishga qaratilgan edi. Xususan, hokimiyatning yuqori organlarini tashkil qilish, oʻlkani idora etish va oʻlka sudlarini barpo etish, davlat tizimlarini vujudga keltirish kabi zarur boʻlgan vazifa va masalalar kun tartibiga chiqarilgan edi.",
        "text8": "Turkistonda davlat boshqaruv idora usuli sifatida respublika idora usuli maqbul deb topildi. Eng maʼqul va maqbul jamiyat deb demokratik jamiyat barpo qilish koʻzda tutilgandiki, bunday jamiyatda demokratik huquq va erkinliklar konstitutsiyaviy yoʻl bilan himoya etilishi zarur edi.",
        "text9": "1917 yil 15 noyabrda III Turkiston Oʻlkasi ishchi, soldat va krestyan deputatlari syezdi ochilishi arafasida shu narsa aniq boʻldiki, u oʻlkada hokimiyatni tuzish haqidagi masalani hal etishni toʻla-toʻkis oʻziga qabul qildi. Bolsheviklar, eserlar, sotsialist-inqilobchilar va sotsial-demokratik mensheviklar hokimiyatni tashkil qilish tamoyillari haqidagi masalalar boʻyicha qizgʻin bahslarni tugatgach, soʻz Sherali Lapinga berildi. U oʻz nutqida syezd ishtirokchilarini Turkiston musulmonlarining III syezdi qabul etgan Oʻlka hokimiyatini tashkil etish haqidagi qaror bilan tanishtirdi. U “musulmonlar butun hokimiyatni ham talab qilishi mumkin edi, biroq kelgindi elementlarga yon berib, ularning vakillarini hokimiyatga kirishiga yoʻl qoʻydi” dedi va musulmonlar oʻlkada faqatgina bitta inqilobiy demokratiya hukm surishiga mutlaqo qarshi turishini ogohlantirdi.",
        "text10": "Shunga qaramay, III Oʻlka ishchi, soldat va krestyan deputatlari syezdi tasdiqlagan Bayonnoma shuni eʼlon qildiki, oʻlkada hokimiyatning oliy organi “Oʻlka ishchi, soldat va krestyan deputatlari Soveti boʻlib, endilikda u Turkiston oʻlkasining Xalq Komissarlari Soveti deb nomlanadi” va uni shakllantirishda Oktyabr toʻntarishini amalga oshirgan soʻl sotsialistik partiyalar vakillarigina ishtirok etadi. Syezd mahalliy aholining oʻlka hokimiyat organida ishtirokiga doir aniq bir gapni aytadi: “Hozirgi vaqtda musulmonlarni oʻlka inqilobiy hokimiyatining oliy tashkilotiga kiritish maqsadga muvofiq emas. Chunki mahalliy aholining soldat, ishchi va krestyan sovetlari hokimiyatiga munosabati noaniq, shuningdek, mahalliy aholi orasida proletar sinfiy tashkilotlar yoʻq”.",
        "text11": "Shunday qilib, syezd saylagan hukumat – Xalq Komissarlari Sovetiga oʻlka mahalliy aholisi vakillaridan biror kishi kirmadi. Xalq Komissarlari Soveti (XKS) raisi lavozimini Fyodor Kolesov egalladi.",
        "text12": "Bolsheviklar III O‘lka Sovetlari syezdini chaqirish va qarorlar qabul qilish orqali oʻlkada hokimiyatni tashkil etish va hokimiyat organlarini shakllantirish tamoyillari haqidagi masalani yakka hal qilib, millatlarning oʻz taqdirini oʻzi belgilash huquqini buzdi. Bolsheviklar mohiyatan dastlabki kunlardanoq chorizmning mahalliy aholiga nisbatan ulugʻ davlatchilik, shovinistik, mustamlakachilik siyosatini davom ettiruvchilari ekanliklarini namoyon etishdi.",
        "text13": "Turkistonda hokimiyat bolsheviklar qoʻliga oʻtishi bilan oʻlkada Muvaqqat hukumatning barcha boʻgʻinlari tugatilib, oʻrniga avvalo jazo organlari va sovet boshqaruv tizimi oʻrnatildi. Turkiston XKS 1917-yil noyabrda oʻlkada qizil gvardiya boʻlinmalarini tuzish haqida qaror qabul qiladi. Bu boʻlinmalar Sovet tuzumi va bolsheviklarga qarshi koʻtarilgan dastlabki ongli chiqishlarni bostirishda faol ishtirok etdi.",
        "text14": "Biroq Turkistonning milliy vatanparvar kuchlari oʻlka taqdiri uchun bunday masʼul lahzada xalqning oʻz taqdirini oʻzi belgilash va oʻz davlatchiligini yaratish huquqini amalga oshirishga qaratilgan qatʼiy siyosiy pozitsiyada turdi. Milliy demokratlar oʻz munosabatlarini 1917-yil Oktyabr toʻntarishidan soʻng darhol namoyon qilgan edilar.",
        "text15": "1917-yil oktyabr-noyabr oylarida Toshkent va Qoʻqonda yuz bergan voqealar Turkistonda ijtimoiy-ciyosiy harakatlarning kuchayishiga sabab boʻldi.",
        "text16": "Bolsheviklar bilan hamkorlikdan bosh tortish belgisi sifatida milliy demokratiya yoʻlboshchilari boshqargan markaziy “Shoʻroi Islomiya” tashkiloti aʼzolari Toshkentni tark etib, Qoʻqonga koʻchib oʻtdilar. Ular bu yerda 1917-yil 26-28-noyabr kunlari Turkiston oʻlka musulmonlarining favqulodda IV qurultoyini oʻtkazishdi. Bu syezd Turkistonda davlat tuzilishi haqidagi masalani hal etishni koʻzda tutdi.",
        "text17": "Demokratik musulmon ziyolilar talabi bilan Turkiston aholisining yevropalik qismi vakillari ham qurultoyda teng huquqli boʻlib ishtirok etdilar. Sovetlarning III Oʻlka syezdi shovinistik qarorlariga qarama-qarshi oʻlaroq musulmon qurultoyi oʻz ishining barcha bosqichlarida chinakam baynalmilalchilik tamoyili, oʻlkaning koʻp millatli, shu jumladan yevropalik qismi aholisi manfaatlarini hisobga olishdan kelib chiqdi.",
        "text18": "Bunday insonparvarlik yondashuvi IV Umumturkiston musulmonlari qurultoyi ochilgan paytdanoq namoyon boʻldi. Jumladan, Mahmudxoʻja Behbudiy syezdning huquqiy asosga egaligi haqidagi nutqida shuni alohida taʼkidladiki, “syezdda Turkistonning yevropalik aholisi vakillari ishtirok etayotgani uchun ham syezd qarorlari yanada obroʻlidir”.",
        "text19": "Syezd faoliyatining asosiy yakuni Turkiston Muxtoriyatini tashkil etishdan iborat boʻldi. Turkiston Muxtoriyati oʻlka hududida milliy-demokratik davlatchilikni barpo etishning ilk amaliy tajribasi edi.",
        "text20": "Uch kun mobaynida syezd ishtirokchilari Turkiston oʻlkasining boʻlgʻusi siyosiy tuzilishi haqidagi oʻz qarashlarini belgilab olishdi, bular syezdda qubul qilingan xujjatlarda oʻz aksini topdi. Xususan, 2017-yil 27-noyabrda quyidagi mazmunda Deklaratsiya qabul qilindi: «Yashasun Turkiston Muxtoriyati! Turkiston musulmonlarining toʻrtinichi favquloda qurultoyi Turkiston oʻlkasida boʻlgʻon xalqlarning xohishlari boʻyincha buyuk rus inqilobi (Fevral inqilobi) tarafidan berilgan asoslarga binoan Federatsiya asosiga qurilgʻon Rusiya Jumhuriyati ila birlikda qolgʻani holda Turkistonni yerlik muxtoriyatli, yaʼni “territorialniy avtonomiyalik” eʼlon qiladur.",
        "text21": "Bu Muxtoriyatning ne suratda vujudga qoʻyilmogʻini yaqin orada yegʻiladurgʻon Umumturkiston xalqining Uchreditelniy Sobraniyasi (Turkiston Majlisi Muassasoni)ga topshiradur. Shuning ila barobar Turkiston oʻlkasida aqalliyat tashkil qilgʻon millatlarning xuquqlarining har jihatdan saqlanilmogʻini ham tantanali suratda bayon etadur» (“Ulugʻ Turkiston” gazetasi, 1917-yil 8-dekabr).",
        "text22": "Bu bilan syezd Turkistonda yashovchi millatlarning Ulugʻ Rossiya inqilobi eʼlon qilgan oʻz taqdirini oʻzi belgilash yuzasidan xohish irodasini ifodalab, Turkistonni hududiy jihatdan muxtor deb eʼlon qiladi, shu bilan birga muxtoriyatning qaror topish shakllarini Taʼsis Majlisiga havola etadi.",
        "text23": "Shunday qilib, 1917-yil 27 noyabrda tashkil topgan avtonom respublikaning nomi “Turkiston Muxto­riya­ti” deb ataladigan boʻldi. Hokimiyat tarkibi esa quyidagicha shakllanishi lozim edi: Taʼsis syezdi chaqirilgunga qadar hokimiyat toʻla ravishda Turkiston Muvaqqat Kengashi va Turkiston Xalq (Milliy) Majlisi qoʻlida jamlanadi. Muvaqqat Kengash aʼzolaridan 12 kishilik hukumat tuziladigan boʻldi.",
        "text24": "Muhammadjon Tinishpayev – Bosh vazir, ichki ishlar vaziri, 2-chaqiriq Davlat Dumasining aʼzosi, Muvaqqat hukumat Turkiston Komitetining aʼzosi, yoʻl muhandisi",
        "text25": "Islom Sulton Shoahmedov – bosh vazir oʻrinbosari, Butunrossiya musulmonlari kengashi Markaziy Qoʻmitasining aʼzosi, huquqshunos,",
        "text26": "Mustafo Choʻqay – tashqi ishlar vaziri, Turkiston musulmonlari Markaziy Shoʻrosi raisi, huquqshunos.",
        "text27": "Ubaydulla Xoʻjayev – harbiy vazir, Butunrossiya musulmonlari kyengashi Markaziy Qoʻmitasi aʼzosi, huquqshunos.",
        "text28": "Hidoyatbek Yurali Agayev – yer va suv boyliklari vaziri, agronom.",
        "text29": "Obidjon Mahmudov – oziq-ovqat vaziri, Qoʻqon shahar Dumasining raisi oʻrinbosari, togʻ-kon sanoati mutaxassisi.",
        "text30": "Abdurahmonbek Oʻrazayev – ichki ishlar vazirining oʻrinbosari, huquqshunos.",
        "text31": "Solomon Abramovich Gersfeld – moliya vaziri, huquqshunos.",
        "text32": "Hukumat tarkibiga yana 4 kishi- yevropalik aholi vakillari orasidan nomzodlar koʻrsatilgach, keyinchalik kiritilishi belgilandi.",
        "text33": "Vaqt oʻtib ayrim sabablarga koʻra Mustafo Choʻqay Turkiston Muxtoriyati hukumatining Bosh vaziri lavozimini egalladi.",
        "text34": "Turkiston Xalq (Milliy) Majlisiga belgilangan 54 oʻrin tarkibidan shaharlar mahalliy boshqarmalaridan ham 4 vakilga va oʻlkadagi turli yevropalik tashkilotlarning vakillariga 18 oʻrin ajratildi. Shunday qilib, uchdan bir oʻrin oʻlkadagi barcha aholining 7 foizini tashkil etgan yevropalik aholi vakillariga berildi.",
        "text35": "Syezd tomonidan Turkiston Muxtoriyati eʼlon qilinib, davlat tuzilmalari shakllana boshlagani ulkan ahamiyatli voqea boʻldi. Umummusulmon syezdi tomonidan Turkiston Muxtoriyatining tashkil etilishi oʻlka boʻylab katta shov-shuvlarga sabab boʻldi.1917-yil dekabr oyi boshlarida Toshkent, Namangan, Jalolobod, Qoʻqon, Samarqand shaharlarida va boshqa hududlarda ming-minglab yurt odamlari mitinglar, namoyishlar uyushtirib, muxtoriyatni qizgʻin qoʻllab-quvvatlab chiqdilar, bu toʻgʻrida maxsus qarorlar qabul qilindi..",
        "text36": "1917-yil 1-dekabrda Namangan uyezdida 10 mingga yaqin kishi ishtirok etgan namoyish boʻlib oʻtdi. “Yashasun muxtoriyatli Turkiston va uning hukumati!” deb yozilgan bayroqlar namoyishchilar qoʻlida xilpirar edi.",
        "text37": "6-dekabrda Jalolobod volostidagi Xonobod qishlogʻida Muxtoriyat oʻrnatilishi munosabati bilan namoyish boʻlib oʻtadi. 7-dekabrda Qoʻqon shahrining 42 jamoat tashkilotlari vakillarining qoʻshma majlisida koʻp millionli Turkiston xalqiga samimiy tabrik yoʻllandi. Samarqandda boʻlib oʻtgan viloyat Soveti syezdida Turkiston Muxtoriyatini qoʻllab-quvvatlashga qaror qilindi va xalq majlisi tarkibiga 5 yangi vakil saylandi. Kaspiyorti viloyatida ham syezd chaqirilib, Turkiston Muxtoriyatini qoʻllab-quvvatlashga qaror qabul qilindi.",
        "text38": "Milliy davlatchilikning qaror topishini joʻshqin muborakbod etib, matbuotda taniqli maʼrifatparvarlar, diniy, jamoat va siyosat arboblari birin-ketin chiqishlar qilib, Muxtoriyatni tabrikladilar. Ular orasida Mahmudxo‘ja Behbudiy, Mirmuhsin Shermuhammad oʻgʻli, Abdulhamid Cho‘lpon, Hamza Hakimzoda Niyoziy, Kabir Bakirov, Islom Shoahmedov, Abdurauf Fitrat va boshqalar bor edi.",
        "text39": "Xalq ommasining qizgʻin qoʻllab-quvvatlashidan ilhomlangan Turkiston Muxtoriyati hukumat vakillari jadal faoliyat boshladilar. Dastlabki kunlardan boshlab Millat majlisi tomonidan tasdiqlangan qonunlar eʼlon qilinib, yangi hukumat davlat Konstitutsiyasini tayyorlash uchun taniqli huquqshunoslarni jalb etdi. Bir nechta hukumat gazetalari oʻzbek, qozoq va rus tillarida nashr etila boshlandi. Shuningdek, hukumat milliy qoʻshinni tashkil qilishga alohida eʼtibor qaratdi. Harbiy vazir Ubaydulla Xoʻjayev ishtirokida oʻtkazilgan koʻrik-parad vaqtida askarlar soni 2000 nafarga yetgan",
        "text40": "1917-yilning 6-dekabrida Toshkentdagi Jomeʼ masjidida oʻtkazilgan namoyishda 60 mingga yaqin kishi qatnashdi. “Ulugʻ Turkiston” gazetasida yozilishicha, “Masjidning ichki sahni va tomlari odam bilan liq toʻlgan edi”. Namoyish Saidgʻani Mahdum raisligida oʻtdi. Munavvar qori bilan Sherali Lapin uning muovinlari edi. Yigʻilganlar Muxtoriyatni bir ovozdan maʼqullab, bundan buyon Turkiston Muxtoriyatining Muvaqqat hukumatidan boshqa hech qanday hukumatni tan olmasliklari haqida qaror qabul qilishdi. Soʻngra namoyish qatnashchilari Xalq Majlisiga sodiq qolishga qasamyod qildi.",
        "text41": "Turkiston xalqining “Muxtor Turkiston uchun” shiori ostida olib borgan kurashida 1917-yil 13-dekabrda boʻlib oʻtgan fojiali voqealar tub burilish nuqtasi boʻldi. Shu kuni Oktyabr inqilobidan soʻng Turkiston zaminida ilk marta xalq qoni toʻkildi. Turkiston Muxtoriyatining Muvaqqat Hukumati Mavludi-sharif bayram kuniga toʻgʻri kelgan 13-dekabrni “Turkiston Muxtoriyatining milliy jamgʻarmasiga pul yigʻish kuni” deb eʼlon qildi hamda bu mablagʻ ozodlik va mustaqillikni mustahkamlashga xizmat qilishini bildirdi. Biroq oʻlkada oʻrnashib turgan Turkiston sovet hukumati va uning joylardagi hokimiyat mahkamalari voqealarning bu tarzda rivojlanishiga izn bermay, Muxtoriyat va uning tarafdorlarini yoʻq qilish yoʻlini butun choralar bilan oʻtkazib bordi.",
        "text42": "Toshkentda Muxtoriyatni yoqlab oʻtkazilgan katta mitingning zoʻrlik bilan tarqatib yuborilishi va sovet xarbiy kuchlari otgan miltiq va pulemyot sadosi ostida koʻplab qurbonlar berilishi – bu Turkiston Muxtoriyatiga nisbatan uyushtirilgan dastlabki suyqasd edi.",
        "text43": "Shunga qaramasdan, Turkiston Muxtoriyati hukumatini qoʻllab-quvvatl davom etaverdi. Xususan, 1917-yil 26-30-dekabr kunlari Qoʻqon shahrida boʻlib oʻtgan musulmon ishchi, askar va dehqon deputatlari I favqulodda qurultoyining ham asosiy masalasi Turkiston Muxtoriyatiga munosabat masalasi edi. Butun Turkiston oʻlkasidan 200 yaqin vakillar qatnashgan ushbu qurultoy 30-dekabrda Turkiston Muxtoriyati hukumatini qoʻllab-quvvatlash, shuningdek, Turkiston oʻlkasi Xalq komissarlari Sovetiga ishonchsizlik bildirish haqida deklaratsiya qabul qildi. Unda “Musulmon ishchi, dehqon va askarlar qurultoyi Turkiston Xalq Komissarlari Sovetiga hokimiyatni darhol Turkiston Muxtoriyati hukumati va Millat Majlisiga topshirilsin deb istak bildiradi”.",
        "text44": "Ammo, oʻlka bolsheviklari Turkiston Muxtoriyati hukumatiga katta xa deb qaradilar. 1918-yil 19-26-yanvar kunlari Toshkentda boʻlib oʻtgan Turkiston Oʻlkasi ishchi, soldat va dehqon deputatlarining favqulodda IV syezdida Muxtoriyatga butunlay salbiy munosabat bildirildi. Ushbu syezd Turkiston Muxtoriyati hukumati va uning aʼzolarini qamoqqa olish haqida qaror chiqardi. Syezd bolsheviklar fraksiyasining Turkiston Muxtoriyati toʻgʻrisidagi rezolyutsiyasini qabul qildi. Ushbu rezolyutsiyada Turkiston qonuniy hukumati munofiqlarcha “qoraguruhchilar toʻdasi” deb ataldi. Bu ham yetmagandek, bu syezd bolsheviklarning tazyiqi ostida qonuniy kuchga ega boʻlgan, tub yerli aholi manfaatlarining himoyachisi boʻlib maydonga chiqqan oʻlkadagi ilk demokratik va xalqchil hukumat – Turkiston Muxtoriyati ustidan shafqatsiz hukm chiqardi.",
        "text45": "1918-yil 30-yanvarda Turkiston Xalq Komissarlari Soveti (TXKS) Muxtoriyat hukumatini tugatish uchun harbiy harakatlar boshladi. Turkiston bolsheviklari buning uchun qizil askarlardan tashqari armanlarning “Dashnaqsutyun” (“Ittifoq”) partiyasi aʼzolaridan tuzilgan qurolli drujinalaridan ham keng foydalandilar.",
        "text46": "31-yanvar kunining ikkinchi yarmida boshlangan janglar bir necha kun davom etdi. Qon toʻkilishini oldini olish maqsadida muzokaralar olib borish harakatlari natija bermadi.",
        "text47": "18-fevraldan 19-fevralga oʻtar kechasi Toshkentdan Turkiston oʻlkasi harbiy komissari Ye.L.Perfilyev boshchiligidagi piyoda, otliq va artilleriya qismlaridan iborat 11 eshelon qoʻshin yetib kela boshladi. Sovet qoʻshinlari Qoʻqonni uch tarafdan qurshovga oldi. Artilleriya toʻplari toʻliq jangovor holatga keltirib qoʻyildi.",
        "text48": "19-fevral kuni Perfilyev barcha 12ta zambarakdan Qoʻqon aholisi ustiga oʻt ochishni, shu jumladan yondiradigan snaryadlardan foydalanishni buyurdi. Tinch aholini toʻpga tutish kunduz soat 13.00 dan boshlanib shomgacha shaharni vayron etib tashladi. Ammo shunga qaramay, muxtoriyatchilar taslim boʻlmay, har bir binoni, har bir doʻkonni, har bir karvonsaroyni mardlarcha himoya qiladilar.",
        "text49": "1918-yil 19-fevralda Qoʻqon shahrida faoliyat koʻrsatayotgan Turkiston Muxtoriyati hukumati bolsheviklaring qonli hujumlari natijasida agʻdarib tashlandi. Ayrim maʼlumotlarga koʻra, dahshatli janglar va talon-tarojlar natijasida 10 mingdan ziyod kishi halok boʻlgan.",
        "text50": "1918-yilning Qoʻqondagi fojiali fevral voqealaridan soʻng ozodlik uchun kurash izchil ravishda ochiq qurolli qarshilik shaklini ola boshladi. Shundan keyin Turkistonning tub aholisi va ularning siyosiy yoʻlboshchilari bolsheviklarni hukumat tuzilmalari xatti-harakatlarida milliy mentalitetga yot boʻlgan davlatchilikni joriy qilishga oshkora intilishni yaqqol koʻrgach, milliy masalani tinch yoʻl bilan hal etish imkoniyati tugadi, faqat qurol kuchi bilan ozodlik va mustaqillik haqidagi asriy orzuni amalga oshirish mumkin, degan xulosaga keldilar.",
        "text51": "Bu bilan Turkistonda sovetlarga qarshi ommaviy milliy – ozodlik va istiqlolchilik harakatiga asos solindi."
    },
    "footer": {
        "text1": "Yaxshi dizayn nafaqat ko‘rkam bo‘lishi, balki funksional ham bo‘lishi kerak. U muammoni hal qila olishi lozim.",
        "text2": "Vazirlar",
        "text3": "Milliy majlis a‘zolari",
        "text4": "Adabiyotlar",
        "text5": "Matbuot nashrlari",
        "text6": "Bibliografiya",
        "text7": "Fotogalereya",
        "text8": "Videogalereya",
        "text9": "Mobil ilova",
        "text10": "Biz haqimizda",
        "text11": "Loyiha ishtirokchilari",
        "text12": "Barcha huquqlar himoyalangan",
        "text13": "Mediateka"
    },
    "members": {
        "tinishboyev": {
            "text": "Muhammadjon Tinishboyev",
            "dob": "1879-1939-yillar",
            "about": "Muhammadjon Tinishboyev [Muxamedjan Tinishpayev]– davlat va jamoat arbobi, tarixchi olim. 1879-yil 12-mayda Yettisuv viloyati Lepsinsk uyezdi Sadir volostining Echkiolmas togʻi etagida tugʻilgan. Millati – qozoq. U 1889 – 1900-yillarda Verniy erkaklar gimnaziyasi, 1900 – 1906-yillarda Sankt-Peterburg Imperatorlik instituti – Aleksandr I nomidagi temir yoʻl transporti injenerlar institutida oʻqidi. 1907-yili II chaqiriq Rossiya Davlat dumasi deputati qilib saylandi. 1917-yil aprelda tuzilgan Muvaqqat hukumatning Turkiston komiteti aʼzosi. Ayni paytda Muvaqqat hukumatning Yettisuv viloyati komissari.\nQoʻqonda Turkiston Muxtoriyati hukumati 1917-yil 27-noyabrda tashkil topgach, hukumatning Bosh vaziri (1917-yil noyabr – dekabr) va ichki ishlar vaziri (1917-yil noyabr – 1918-yil fevral). 1917-yil 5 – 13-dekabrda Orenburgda oʻtkazilgan II Butunqozoq syezdida qatnashdi. Bu syezdda Alixon Bukeyxonov (1866 – 1937) boshchiligida Alash avtonomiyasi [Alash Oʻrda hukumati] tashkil topdi. U Alash Oʻrda hukumatida ichki ishlar vaziri (1917-yil dekabr – 1920-yil mart) va keyinchalik Bosh vazir oʻrinbosari lavozimlarida ishladi.\nM.Tinishboyev keyinchalik Turkiston ASSR va Qozogʻiston ASSRda turli lavozimlarda faoliyat koʻrsatdi. Turkiy xalqlar tarixi va etnografiyasiga oid turli asarlar yozgan hamda ular rus tilida Toshkentda nashr qilingan.\nSovet hokimiyati tomonidan M. Tinishboyev birinchi marta 1930-yil 3-avgustda qamoqqa olindi va besh yilga RSFSRning Markaziy qoratuproq hududi (hozirgi Voronej oblasti)ga surgun qilindi (1930 – 1935). Keyinchalik Toshkentda NKVD tomonidan 1937-yil 21-noyabrda qayta qamoqqa olindi hamda Toshkent turmasidagi kasalxonada u 1939-yil 3-iyulda vafot etdi.\n1970-yil 27-fevralda Oʻzbekiston SSR Ministrlar Soveti huzuridagi KGB tergov boʻlimi tomonidan M.Tinishboyevga nisbatan jinoiy ish qayta koʻrib chiqilib, u reabilitatsiya qilindi.\nM.Tinishboyevning tanlangan asarlari va boshqa kitoblari Almatida 1991-yildan keyin nashr etildi. SSSR tarqalgach, Qozogʻistonda uning xotirasi sharafiga koʻplab haykallari oʻrnatildi. Qozogʻistonda maxsus medal chiqarilgan."
        },
        "abdurahmon": {
            "text": "Abdurahmon O‘razboyev ",
            "dob": "1888-1937-yillar",
            "about": "Abdurahmon O‘razboyev - taniqli davlat va jamoat arbobi.1888 yilda Yangi Marg‘ilon (hozirgi Farg‘ona) shahrida amaldor oilasida tug‘ilgan. Abdurahmonbek ota tomondan xuddi Mustafo Cho‘qay ajdodlari singari qozoqlarning qipchoq urug‘iga borib taqaladi. Otasi – Muhammad O‘razayev (1898 yil 10 mayda vafot etgan) O‘rta juzdagi aslzodalardan biri bo‘lib, 2-Orenburg kadet korpusini tugatgan hamda Marg‘ilon uyezdi boshqarmasida tarjimon va kotib bo‘lib ishlagan. Onasi – Niyozjon Bibixonim Farg‘ona viloyati Yangi Marg‘ilon uyezdi Avval qishlog‘ida tug‘ilgan o‘zbek ayoli bo‘lib, u erining vafotidan so‘ng o‘qituvchilik qilgan. Yosh Abdurahmonbek tarbiyasida onasining xizmati katta edi. \nA.O‘razayev Skobelev gimnaziyasi (1910) va Moskva universitetining yuridik fakultetini (1915) tugatgan. Advokat yordamchisi lavozimida ishlagan. Farg‘ona saylov okrugidan Butunrossiya Ta’sis Majlisi a’zosi (1917) qilib saylandi. Turkiston Muxtoriyati hukumati 1917 yil noyabrda tashkil qilingach, u ichki ishlar vazirining o‘rinbosari hamda Milliy Majlis a’zosi bo‘ldi. So‘ngra ichki ishlar vaziri lavozimida faoliyat ko‘rsatdi. Eserlar partiyasiga xayrixoh bo‘lgan. Muxtoriyat hukumati bolsheviklar tomonidan ag‘darilgach, 1918 yil fevral oyi oxirida A. O‘razayev bolsheviklar qo‘liga tushib qolgan. U 1918 yil may oyida dastlab amnistiya qilindi hamda sovet hokimiyati idoralarida turli lavozimlarda ishladi. A.O‘razayev keyinchalik Sibirga surgun qilindi. U yerda sil kasali bilan qattiq og‘rib qolgach, Toshkentdagi qarindoshlari (singlisi) oilasiga qaytishga ruxsat berildi. U bo‘lg‘usi akademik bo‘lgan kuyovi Qori Niyoziy xonadonida yashadi. Toshkentda bir muddat istiqomat qilgach, taxminan 1937 yilda og‘ir kasallik natijasida vafot etdi.\nAbdurahmonbek O‘razayevning ikki nafardan akasi va singlisi bo‘lgan. Uning shaxsiy hayoti haqida yetarlicha ma’lumotlar saqlanib qolmagan. A.O‘razayevning singlisi: Oyshaxonim O‘razayeva (1897 yil 2 sentyabr – 1988 yil 31 yanvar) onasi singari sovet maktablarida ishlagan. Turkistonda dastlabki ayol o‘qituvchilardan biri bo‘lgan. U Skobelev (hozirgi Farg‘ona) shahridagi ayollar gimnaziyasini tugatib, Namangandagi rus-tuzem maktabida rus tilidan dars bergan. So‘ngra Skobelevdagi sovet maktabida faoliyat ko‘rsatdi. U keyinchalik mashhur matematik olim bo‘lib yetishgan O‘zbekiston fan arbobi (1939), O‘zbekiston Fanlar akademiyasi akademigi va birinchi prezidenti (1943-1947), fizika-matematika fanlari doktori (1939), professor, Sosialistik Mehnat Qahramoni (1967) bo‘lgan.\nToshmuhammad Niyozovich Qori-Niyoziy (1897, Xo‘jand – 1970, Toshkent)ga turmushga chiqqan. T.N.Qori-Niyoziy O‘rta Osiyo davlat universitetini tugatgach (1929), shu universitet rektori (1931-1933), O‘zbekiston SSR Maorif xalq komissari va ayni paytda O‘zbekiston XKS huzuridagi Fan qo‘mitasi Prezidiumi raisi (1937-1938), O‘zbekiston SSR XKS raisi o‘rinbosari (1939-1943), SSSR FA O‘zbekiston filiali Prezidiumi raisi (1940-1943) hamda boshqa mas’ul lavozimlarda faoliyat ko‘rsatdi. Shu narsa xarakterli holki, sovet davrida o‘z tarjimai holini ancha o‘zgartirgan er-xotin Toshmuhammad va Oyshaxonim ikkalasi go‘yoki ham bir kunda, ham bir yilda – 1897 yil 2 sentyabrda biri Xo‘jandda, ikkinchisi Skobelev shahrida tug‘ilganligi to‘g‘risida rasmiy hujjatlarda yozishgan. Qori-Niyoziy sovet rejimi davrida, bir tomondan, O‘zbekistonda sovet madaniyati va ilm-fanini rivojlantirishga katta hissa qo‘shgan bo‘lsa, ikkinchi tomondan, o‘zbek xalqi ma’naviyati va milliy madaniyatga qaqshatqich va ayovsiz zarba bergan."
        },
        "hidoyatbek": {
            "text": "Hidoyatbek Yurali Agayev",
            "dob": "Tug‘ilgan yillari nom’alum",
            "about": "Hidoyatbek Yurg‘uli Ag‘ayev – davlat va jamoat arbobi. Farg‘ona vodiysida XIX asr so‘nggi choragida tug‘ilgan. U o‘lkada taniqli agronom olim sifatida mashhur edi. Turkiston Muxtoriyati hukumatida yer va suv boyliklari vaziri lavozimida faoliyat ko‘rsatgan. Turkiston Milliy Majlisi a’zosi sifatida ham samarali ish olib borgan.\nQo‘qon shahri 1918 yil fevralda bolsheviklar tomonidan o‘qqa tutilgan paytda Bosh vazir Mustafo Cho‘qay yonida Hidoyatbek Yurali Agayev ham bo‘lgan. Biroq Qo‘qonda bolsheviklarning harbiy kuchlariga qarshi bo‘lgan janglarning birida u halok bo‘ladi.\nH.Agayevning rafiqasi: Jozefina Stanislavovna Yurguli-Aga (qizlik familiyasi Trushkovskaya) Peterburg patriot institutini tugatgan."
        },
        "solomon": {
            "text": "Solomon Geresfeld",
            "dob": "1881-1937-yillar",
            "about": "Turkistondagi yirik sarmoyadorlardan biri, advokat va jurnalist. Sionistlar komitetining O‘rta Osiyo rayoni raisi. 1881 yil 27 noyabrda Odessada tug‘ilgan. Millati – buxoro yahudiylaridan. Bern universiteti (Shveysariya) yuridik fakultetining erkin tinglovchisi (1902 yildan). Rossiyaga qaytgach, Odessa yunkerlik bilim yurtiga imtihon topshirib, Samarqanddagi 6-Turkiston batalonida harbiy xizmatni boshlagan. 1904 – 1906 yillarda rus tilida “Samarkand” gazetasini chiqargan. Odessadagi Novorossiysk universiteti yuridik fakulteti 2-kurs talabaligiga qabul qilingan (1907). Odessa sionistlar komitetiga 1908 yil sentyabrda saylangan, “Odesskoye slovo” gazetasini chiqargan. 1913 yil mayda universitetni tugatib, Samarqandga qaytgan. Samarqand shahar Dumasida yahudiylar komiteti raisi. Samarqand shahar Dumasi a’zosi (1917).\nTurkiston Muxtoriyati hukumatining birinchi tarkibida tub xalqlardan bo‘lmagan yagona nomzod sifatida kirib, moliya vaziri bo‘lgan. Milliy Majlis a’zosi (1917 yil noyabr – 1918 yil fevral). Keyinchalik moliya vaziri lavozimini Islom Shoaxmedovga topshirgan. Muxtoriyat hukumati ag‘darilganda qizil gvardiyachilar tomonidan Qo‘qonda 1918 yil 20 fevralda qo‘lga olingan va otib tashlangan. U O‘rta Osiyo temir yo‘lining Melnikovo stansiyasi (hozirgi Konibodom)da dafn etilgan. Mustafo Cho‘qayning yozishicha, “Harsfeld Samarqandda bolsheviklar qo‘liga tushib qolgan edi”.\nBuxoro yahudiylari talabi bilan S.Gersfeldning jasadi 1918 yil 16 aprelda eksgumasiya qilinib, yahudiylar jamoasi tomonidan uning jasadi Samarqanddagi yahudiylar qabristonida qayta dafn etilgan. Halok bo‘lgan paytda S.A. Gersfeld hali 37 yoshga ham to‘lmagan edi."
        },
        "mustafo": {
            "text": "Mustafo Cho‘qay",
            "dob": "1890-1937-yillar",
            "about": " Mustafo Cho'qay – taniqli davlat va jamoat arbobi hamda Turkiston xalqlari mustaqilligi uchun izchil kurashchi.\n1890 yil 25 dekabrda [yangi hisob bilan 1891 yil 7 yanvarda] Sirdaryo oblasti Perovsk uyezdi Jopek volostidagi Avliyotarang'il ovulida (ba'zi manbalarda yozilishicha, Narshoki qishlovida) tug'ilgan. Otasi Cho'kaybey To'rg'ay dodxoh o'g'li bo'lis (volost) boshlig'i, qozoqlarning qipchoq urug'i aslzodalaridan bo'lgan, onasining ajdodlari Xiva xonlariga borib taqalgan. Mustafo Cho'qay tarjimai holida o'zini qipchoq deb hisoblagan.\nMustafo Cho'qay boshlang'ich ma'lumotni Oqmachitda olgach, Toshkentdagi erkaklar gimnaziyasida o'qidi(1902 – 1910).Sankt - Peterburg universitetining yuridik fakultetini tugatgan(1914).Aynan ushbu o'quv yurtlarini keyinchalik Rossiyadagi Muvaqqat hukumatning Bosh vaziri bo'lgan Aleksandr Kerenskiy(1881 – 1970) ham taxminan o'n yil oldin 1899 va 1904 yillarda tugatgan edi.Mustafo Cho'qay 1916 – 1917 yillarda Rossiya IV Davlat dumasining musulmonlar fraksiyasida kotib va tarjimon bo'lib ishlaydi.Turkistonda 1916 yili ko'tarilgan qo'zg'olon shafqatsiz bostirilgandan keyin Davlat dumasining A.Kerenskiy boshchilik qilgan maxsus komissiyasi tarkibida o'sha yili avgust oyida Turkiston o'lkasida, jumladan, Jizzaxda bo'lib vayronaga aylangan shahar xarobalarini ko'rgan.\n1917 yil aprelda Mustafo Cho'qay Petrograddan Toshkentga qaytdi va Turkistondagi siyosiy jarayonlar markazida turdi.U Toshkentda 1917 yil bahoridan boshlab \"Birlik tug'i\" va «Svobodnыy Turkestan» gazetalarini chop eta boshladi. 1917 yil 16 – 23 aprelda Toshkentda o'tgan Butunturkiston musulmonlarining I qurultoyida Mustafo Cho'qay raisligida Turkiston o'lka musulmonlari Markaziy Sho'rosi [Kraymussovet], ya'ni Milliy Markaz tashkil qilindi.Orenburgda 21 – 28 iyulda o'tgan Butunqirg'iz [Butunqozoq] I s'yezdida faol qatnashdi.Muvaqqat hukumatning Turkiston Komiteti a'zosi(1917 yil avgustdan).Toshkentda bolsheviklar tomonidan zo'ravonlik bilan hokimiyat bosib olingach, Mustafo Cho'qay boshchiligidagi Milliy Markaz noyabr oyi boshlarida Qo'qonga ko'chib bordi[4].\n1917 yil 26-28 noyabrda(yangi hisob bilan 9- 11 dekabrda) Qo'qon shahrida Butunturkiston musulmonlarining favqulodda IV qurultoyi bo'lib o'tdi.Bu qurultoyni o'lka musulmonlari Markaziy Sho'rosi(Kraymussovet) raisi Mustafo Cho'qay kirish so'zi bilan ochib berdi.U qurultoy hay'ati a'zoligiga ham saylandi.Qurultoy qatnashchilari uch kun davomida Turkiston o'lkasining bo'lg'usi siyosiy tuzilishi haqidagi o'z qarashlarini belgilab olishdi.Qurultoy qarorlarini ishlab chiqishda Mustafo Cho'qay bilan birgalikda Muhammadjon Tinishboyev, Islom Sulton Shoaxmedov, Ubaydulla Xo'jayev, Obidjon Mahmudov, Mahmudxo'ja Behbudiy va boshqalar muhim rol o'ynashdi.\nTurkiston Muxtoriyati hukumati dastlab 8 nafar kishidan iborat tarkibda tuzildi.Muhammadjon Tinishboyev Bosh vazir va ichki ishlar vaziri lavozimini egalladi.Mustafo Cho'qay tashqi ishlar vaziri lavozimiga saylandi.Hukumat tarkibiga Ubaydulla Xo'jayev harbiy vazir va Obidjon Mahmudov oziq - ovqat vaziri sifatida kiritildi.Qurultoyda saylangan Turkiston Milliy Majlisi tarkibiga ko'pchilik qatori Mustafo Cho'qay ham kiritildi.\n1917 yil 12 dekabrdan boshlab Mustafo Cho'qay Turkiston Muxtoriyati hukumatining Bosh vaziri bo'ldi. (M.Tinishboyev Alash O'rda avtonom hukumati faoliyatida bevosita qatnashish uchun Qo'qondan Orenburgga jo'nab ketgan edi.) Ayni paytda Mustafo Cho'qay Orenburgda 1917 yil 5 - 13 dekabrda(yangi hisob bilan 18 - 26 dekabrda) bo'lib o'tgan Butunqirg'iz[Butunqozoq] vakillarining I s'yezdida tashkil qilingan Alash O'rda hukumatining ham tashqi ishlar vaziri bo'lgan.\nShu o'rinda Mustafo Cho'qayning Alash O'rda avtonom hukumati va rahbariyatiga bo'lgan munosabatini aytib o'tish lozim.Yoshligidan turkchilik g'oyalari bilan tarbiyalangan Mustafo Cho'qay yagona va bo'linmas Turkiston tuzish tarafdori edi.U qozoq elatdoshlari bo'lgan \"Alash\" partiyasi a'zolariga alohida avtonom hukumat tuzish zarur emasligini, ular yangi tashkil qilingan Turkiston Muxtoriyati hukumati tarkibiga alohida viloyat sifatida kirishlari mumkinligini bildiradi.Kelajakda bu muxtoriyatga Buxoro amirligi va Xiva xonligi hududlarini ham qo'shib olgan holda mustaqil Turkiston davlatini(O'zbekiston yoki Qozog'iston emas!) tuzish imkoniyati vujudga kelar edi.Biroq Mustafo Cho'qay, Behbudiy, Munavvar Qori, Ubaydulla Xo'jayev, Fayzulla Xo'jayev kabi millat yetakchilarining bunday geosiyosiy qarashlari qozoq bovurlarimizga yoqmaydi.Shuning uchun Mustafo Cho'qay o'zi Alash O'rda hukumati a'zosi va qozoq bo'la turib, keyinchalik Qo'qondagi fojialardan so'ng ham haqli ravishda Alash O'rda hukumatida faoliyat ko'rsatmaydi va Orenburgda o'rnashgan alasho'rdachilar bilan aloqaga chiqmaydi.\nMuxtoriyat hukumati bolsheviklarning harbiy kuchlari tomonidan tugatilgach, 1918 yil fevral oxirida Qo'qondan chiqib ketdi hamda yashirin ravishda mart oyida Toshkentga keldi va bu yerda 2 oy yashadi.U 1918 yil 16 aprelda eski tanishi aktrisa Mariya Yakovlevna Gorina(1888 – 1969) bilan Toshkentdagi masjidda nikohdan o'tib, turmush quradi.Yosh oila 1918 yil 1 mayda Toshkentdan poyezdda Moskvaga jo'naydi.Biroq poyezd Volgadagi jangovar harakatlar sababli Aktyubinskkacha boradi, xolos. 1918 yil 8 iyunda Samarada bolsheviklarga qarshi Ta'sis majlisi a'zolari komiteti(Komuch) hukumati tuzildi.Iyul oyida Alash O'rda rahbarlari Alixon Bukeyxanov va Mustafo Cho'qay Samaraga kelib, Komuch hukumati bilan bolsheviklarga qarshi harbiy - siyosiy ittifoq tuzdi.Bu paytda Mustafo Cho'qay Samara, Ufa, Omskda faoliyat ko'rsatdi. 1918 yil 18 noyabrda o'z safdoshlari bilan qamoqqa olingan Mustafo Cho'qay turkistonlik eser Vadim Chaykin va tatar Ilyos Alkin bilan Chelyabinskda qamoqdan qochadi. 1918 yil 1 dekabrda Orenburgdagi Karvonsaroyda(Boshqirdiston hukumati qarorgohida) u bilan Boshqirdiston hukumati raisi Ahmad Zaki Validiy o'rtasida uchrashuv bo'ldi.Mustafo Cho'qay qisqa muddat Komuch hukumatida faoliyat ko'rsatdi.\nMustafo Cho'qay 1919 yil fevralda Yevropa davlatlariga maxsus memorandum bilan murojaat qilib, Turkistondagi istiqlolchilarning bolsheviklarga qarshi kurashini qo'llab - quvvatlashga, sovet rejimini ag'darib tashlashga chaqirdi.\nMustafo Cho'qay qozoq dashtlari va Kaspiy dengizi orqali 1919 yil bahorida avval Boku so'ngra Tiflis[Tbilisi] shahriga boradi.U Tiflisda 2 yil yashaydi.Bu yerda u musulmonlar uchun \"Yeni Dünya\" va \"Şafak\" gazetalarini tashkil qilib, \"Na rubeje\" jurnaliga muharrirlik qildi.Qizil armiya Tiflisni bosib olgach, 1921 yil fevral oyida Mustafo Cho'qay muhojirlikka jo'nab ketishga majbur bo'ldi hamda Istanbulga yetib keldi.Mustafo Cho'qay xotini bilan 1921 yil yozida Parijga keldi.Mustafo Cho'qay muhojirlikda 20 yil yashab, turli xalqaro anjumanlarda ishtirok etdi hamda matbuotda ingliz, fransuz, polyak, rus, turk tillarida o'tkir publisistik maqolalar bilan muntazam qatnashib turdi.Parijda uning rus tilida \"Markaziy Osiyodagi Sovetlar\" (1928) hamda \"Turkiston sovet hokimiyati ostida\" (1935) hamda turk tilida Parij – Berlinda \"1917 yil xotiralari parchalari\" (1937) kitoblari nashr etildi.\nMustafo Cho'qay 1929 yildan boshlab Turkiston Milliy Birligi Markaziy Qo'mitasining raisi bo'ldi. 1929 – 1939 yillarda chiqqan \"Yaş Türkistan\" jurnaliga muharrirlik qildi.Jurnal Parijda tayyorlanib, Berlinda chop etilgan(uning 117 ta nomeri chop etilgan). Mustafo Cho'qay xorijda muhojirlikda yashayotganda O'rta Osiyo respublikalarida sovet rejimiga qarshi davom etayotgan qurolli istiqlolchilik harakati(sovet hokimiyati yillarida u \"bosmachilik\" harakati deb atalgan) to'g'risida 1930 yil 19 fevralda \"O basmachestve\" maqolasida shunday deb yozgan edi: Turkiston – Sovet Ittifoqining qo'zg'olonchilar hozirgacha o'z harakatini to'xtatmagan yagona qismi.Buning ikkita sababi bor.Birinchidan, Moskva zulmidan qutulish uchun mamlakatni kurashga olib kelgan milliy tuyg'uning kuchliligi.Bu umumiy holatning sababi hisoblanadi.Ikkinchidan, mahalliy xususiyatga molik sabab ham bor.Bu sovet milliy siyosatining faqat Turkistonga xos alohida xususiyatidir...\n        Turkiston aholisi sovet hokimiyatiga qarshi uzluksiz(permanent) kurash holatidadir.Sovet hokimiyatiga qarshi \"permanent kurash\" kayfiyati zaminida qaytadan bosmachilikning paydo bo'lishi bizni hayron qoldirmaydi.Bosmachilik - Turkistonda sovet xo'jayinchiligining ko'lankasi.\nBosmachilik  aynan Farg'onada yuz berganligi shuni yaqqol ko'rsatadiki, bu holat Moskva hukumatining paxta siyosatiga qarshi tez orada qo'zg'olonchilik harakati boshlanishiga ham sabab bo'ladi.\nGermaniya SSSRga hujum qilgan 1941 yil 22 iyun kuni nasistlar Parij atrofidagi Nojan shaharchasida yashayotgan Mustafo Cho'qayni qamoqqa olishdi hamda u 13 iyulgacha Kompyen xarbiy lagerida tutqunlikda saqlandi[8].So'ngra Mustafo Cho'qay Berlinda bo'ldi(15 iyuldan 26 avgustgacha).U 1941 yil sentyabr – dekabr oylarida sovet harbiy asirlari saqlanayotgan Suvalki, Vustrau va Chenstoxova konslagerlarida bo'lib, asir olingan turkistonliklarni omon saqlash yo'llarini izladi.Mustafo Cho'qay va toshkentlik o'zbek Vali Qayumxon(1904 – 1993) asir olingan turkistonliklardan Turkiston legioni tuzishni rejalashtirdilar.Biroq Mustafo Cho'qay konslagerlarda yuqumli kasallikka chalindi hamda Berlindagi \"Viktoriya\" kasalxonasida tepkili terlama(tif)dan 1941 yil 27 dekabrda vafot etdi.U Berlindagi turk musulmonlarining Tempelxof qabristonida 1942 yil 2 yanvarda dafn etildi.\nMustafo Cho'qay rus, o'zbek, qozoq, turk, fransuz, ingliz, nemis, polyak tillarida Turkistonning XX asr tarixiga oid ko'plab maqolalar va kitoblar yozdi. \"1917 yil xotira parchalari\" (Berlin, 1937; o'zbek tilida) kitobi katta shuhrat qozondi.Bu asar turk(Anqara, 1988), rus(Germaniya, 1989; Tokio - Moskva, 2001), o'zbek(Toshkent, 1992) tillarida alohida kitob bo'lib nashr qilindi.Uning 2 jildli \"Tanlangan asarlar\" kitobi(Almati, 1998 - 1999) qozoq va qisman rus tillarida bosilib chiqdi.\nSSSR tarqalgach, Qozog'iston va O'zbekistonda Mustafo Cho'qayning asarlari chop etildi.Taniqli tarixchi olim professor Kushim Yesmag'ambetov(1938 – 2016) boshchiligida 2012 – 2014 yillarda Almatida Mustafo Cho'qayning 12 jildlik asarlar to'plami nashrdan chiqdi.Qozog'istonda Mustafo Cho'qay haqida badiiy asarlar yaratildi, kinofilmlar suratga olindi, uning xotirasiga atab ko'plab haykallari o'rnatildi.Bu yerda muntazam ravishda Mustafo Cho'qayga bag'ishlangan xalqaro konferensiyalar o'tkazib turiladi.\nShunday qilib, turkiy xalqlarning atoqli farzandi, mashhar davlat va siyosiy davlat arbobi Mustafo Cho'qayning hayoti va faoliyati XXI asrda yashayotgan barcha turkiy xalqlar, xususan, qozoqlar va o'zbeklar uchun porloq namuna hisoblanadi.O'z hayotini Turkiston birligi va mustaqilligi uchun kurashga bag'ishlagan, ham Rossiya imperiyasi, ham sovet davlati, ham Yevropada muhojirlikda, ham Germaniyada nasistlar hukmronligi sharoitida murakkab va ziddiyatli bir vaziyatda faoliyat yuritgan bo'lishiga qaramasdan u yorqin siymo bo'lib qolaveradi.\n"
        },
        "sulton": {
            "text": "Islom Sulton Shoahmedov",
            "dob": "1882-1937-yillar",
            "about": "Taniqli musulmon jamoat va siyosat arbobi. 1882-yil 21-noyabrda Orenburgda tatar-boshqird oilasida tugʻilgan. Otasi – Shagisulton (Sulton) Shagiaxmetovich Shagiaxmetov (1855-1896) Ufa guberniyasi Menzalinsk uyezdidagi boshqirdlar urugʻidan boʻlib, u 1876-yilda Qozon universitetining yuridik fakultetini tugatgan. U 1876-1890-yillarda Orenburg tatar muallimlari maktabida oʻqituvchilik qilgan, soʻngra Orenburg oʻlkasidagi sud idoralarida tergovchi boʻlib ishlagan.\nOnasi – Gaynizigan Muhammad- Sodiqovna Nigmatullina tatar ayoli boʻlib, u kelib chiqishi jihatidan oqsuyaklar tabaqasiga mansub boʻlgan.I.Shoaxmedovning dunyoqarashi asosan Orenburg tatarlari oʻrtasida shakllangan.Uning maʼnaviy hayoti va ijtimoiy qarashlari shakllanishida tatar ayoli boʻlgan onasi muhim rol oʻynagan.\n                I.Shoaxmedov Orenburg erkaklar gimnaziyasini tugatgach(1905), Sankt - Peterburg universitetining avval sharqshunoslik, soʻngra yuridik fakultetida oʻqiydi(1905 – 1910).Turkiy va rus tillaridan tashqari ingliz, fransuz, nemis tillarini yaxshi bilgan.Talabalik paytida u Rossiyadagi sotsial - demokratik harakatga qiziqib, 1907 - yilda Toshkent garnizoni soldatlari oʻrtasida tashviqot ishlarini olib borgan.\nUniversitetning toʻliq kursini 1910 - yil oxirida tugatib, 1911 - yil yanvarda u diplomni olgan.Sankt - Peterburg sud palatasida 1912 - yil avgustdan ish boshlaydi.U Peterburgda 1912 - yil oktyabrda chiqqan \"Musulmanskoy gazetы\"ning muharriri boʻldi.Bir qator sud ishlarida mensheviklar partiyasi vakillarini himoya qiladi.I.Shoaxmedov Rossiya imperiyasidagi musulmon aholisi huquqlari uchun kurashgan. 1915 - yil boshlarida Qoʻqonga kelgan.I.Shoaxmedov Skobelev okrug sudida tergovchi advokat oʻrinbosari sifatida oʻz faoliyatini boshlaydi.Bu yerda u \"Sadoi Fargʻona\" gazetasini chiqarishda muhim rol oʻynaydi. 1916 - yilda u \"Gʻayrat\" jamiyatini tuzib, \"Turkestanskiy kray\" gazetasi nashrini yoʻlga qoʻyadi va unga muharrirlik qiladi. 1916 - yil Fargʻona vodiysida koʻtarilgan mardikorchilik qoʻzgʻolonini qoʻllab - quvvatlaydi.\nFevral inqilobi kunlarida u Petrogradda boʻlgan.Bu paytda Xalq sotsialistlari partiyasiga yaqinlashgan. 1917 - yil mart oyi oxirida u Turkistonga qaytadi. 1917 - yil iyundan boshlab Milliy Shoʻro Ijroiya komiteti raisi vazifasini bajaruvchi boʻlib faoliyat koʻrsatgan.Qozonda 1917 - yilda oʻtkazilgan Butunrossiya musulmonlari II syezdi qatnashchisi.\n            Shoaxmedov 1917 - yil Toshkentga kelib, Turkistondagi muxtoriyatchilik harakatida faol qatnashdi.Qayta chiqa boshlagan \"Turkestanskiy kray\" (Toshkent, 1917) gazetasi muharriri va noshiri.Turkiston musulmonlari Markaziy Shoʻrosi aʼzosi.Butunturkiston musulmonlari I - IV qurultoylarining faol qatnashchisi.\nTurkiston Muxtoriyati hukumatida Bosh vazir oʻrinbosari, keyinchalik moliya vaziri boʻldi.Turkiston Muxtoriyati Konstitutsiyasi loyihasining muallifi.Muxtoriyat hukumati tugatilgan paytda Qoʻqon qoʻrgʻoni ichida bolsheviklar tomonidan qoʻlga olingan(1918 - yil fevral)\n\"Ulugʻ Turkiston\" gazetasida 1918 - yil bahorida yozilishicha, u Toshkentdagi qamoqxonada qiynoqlar natijasida aqldan ozgan va turma lazaretiga koʻchirilgan. 1918 - yil may oyida bolsheviklar tomonidan Turkiston Muxtoriyati hukumatining tirik qolgan aʼzolari amnistiya qilingach, qamoqdan chiqqan.\n1919 - 1920 - yillarda I.Shoaxmedov bolsheviklar bilan hamkorlik qilgan.U Turkiston Xalq Xoʻjaligi Markaziy Kengashi hamda Qoʻqon uyezd - shahar revkomida 1920 - yili faoliyat koʻrsatgan. 1920 - yil oxirida u yashirin ravishda Manjuriyaga joʻnab ketgan. 1921 - yil boshlarida u Britaniya Hindistoniga qarashli Peshovardagi rus qochoqlari joylashgan lagerga tushib qolgan.\n1921 - yil may oyida qattiq kasal boʻlib yotgan I.Shoaxmedovning xati Parijdagi rus muhojirlari qoʻliga kelib tushadi.Bu haqda keyinchalik Mustafo Choʻqay ham oʻz maqolasida yozib oʻtadi.I.Shoaxmedov qarindoshi badavlat savdogar Agafurov oilasining moddiy koʻmagida 1921 - yil avgustda Vladivostokka keladi.U bu yerdan Parijga joʻnab ketishni rejalashtirgan edi.Ayrim maʼlumotlarga qaraganda, I.Shoaxmedov oradan koʻp oʻtmay qattiq kasallangan va Vladivostokdagi qarindoshlari huzuriga qolib ketgan.U taxminan 1922 - yil yoki undan keyin vafot etgan.\nMustafo Choʻqay tomonidan 1931 - yilda Berlinda chiqarilgan \"Yash Turkestan\" jurnalida chiqqan \"Shax - Islam Shax - Axmad - Bey\" nomli maqolada yozilishicha, u 1922 - yili Parijda Shoaxmedovning singlisi bilan koʻrishgan paytda uning safdoshi ogʻir kasal boʻlgan.Shoaxmedovning keyingi taqdiri va qismatidan ular xabar topa olmagan.\n I.Shoaxmedovning Shaxgali(1882 -?) ismli akasi(u ham yurist) hamda Bibi Maryam, Bibi Galiya, Bibi Soliya, Bibi Zuhra nomli 4 nafar singlisi boʻlgan.I.Shoaxmedovning rafiqasi: Olga Viktorovna Benedskaya(1909 - yildan)."
        },
        "ubaydulla": {
            "text": "Ubaydulla Xo‘jayev",
            "dob": "1878-1942-yillar",
            "about": "Ubaydulla Xo‘jayev [Ubaydullaxo‘ja Asadullaxo‘jayev; Ubaydulla Asaddullayevich Xo‘jayev] – taniqli davlat va jamoat arbobi, Turkistondagi jadidchilik harakatining taniqli namoyandasi, o‘zbek matbuotining tashkilotchilaridan biri.\n Toshkent shahrida hunarmand oilasida 1886 yili tug‘ilgan. Ba’zi manbalarda u 1878 yil 12 mayda tug‘ilgan deb ham ko‘rsatiladi. Saratovdagi huquqshunoslik institutida o‘qigan (1908 – 1912). Talabalik yillaridayoq davr muammolarini yechishni o‘ylab, mashhur rus yozuvchisi Lev Tolstoy bilan yozishmalar olib bordi (1909). Toshkent okrug sudida 1913 yildan xususiy advokat bo‘lib ishladi. Jadidchilik harakatiga qo‘shilib, tez orada uning rahbarlaridan biriga aylandi. “Turon” jamiyatining asoschilaridan biri (1913). U Toshkentda 1914 yil aprelda “Sadoi Turkiston” gazetasini chiqarib, unga muharrirlik qildi. O‘z atrofiga yoshlarni to‘plab, “Umid” yashirin jamiyatini tuzdi. Keyinchalik bu tashkilot “Taraqqiyparvar” deb nomlanib Turkiston jadidlarining asosiy tashkilotlaridan biriga aylandi. “Sadoi Turkiston” gazetasi 1915 yil aprelda Rossiya imperiyasining mahalliy ma’murlari tomonidan yopilgach, u Andijonga keldi va rus tilida “Turkestanskiy golos” gazetasini nashr qildirdi.\n Toshkentda tuzilgan “Turkiston mardikorlikka olish qo‘mitasi”ning raisi (1916). Mardikorchilik haqidagi imperator Nikolay II farmonini bekor qildirish uchun mahalliy sarmoyador Mirkomilboy Mirmo‘minboyev bilan birga Petrogradga bordi.\n Butunturkiston musulmonlari I qurultoyida tashkil qilingan Turkiston o‘lka musulmonlari Markaziy Sho‘rosi (Milliy Markaz) kotibi va a’zosi (1917 yil aprel). Butunrossiya musulmonlar Sho‘rosi Ijroiya Komiteti a’zosi (1917 yil may). Toshkentda 1917 yil mart oyida tuzilgan “Sho‘roi Islomiya” tashkiloti raisi. Muxtoriyatchilik harakati tashabbuskorlaridan biri. Turkiston Muxtoriyati hukumatining harbiy ishlar vaziri (1917 yil noyabr – 1918 yil fevral).\n Ubaydulla Xo‘jayev 1918 yil fevralda hukumat topshirig‘i bilan Kavkazga bordi va Turkistonga g‘alla keltirish masalasini hal qildi. Mustafo Cho‘qayning yozishicha, muxtoriyat hukumati tugatilgach, u Ashxobod – Samarqand temir yo‘lida bolsheviklar qo‘liga tushib qoldi.\n Sovet hokimiyati tomonidan 1918 yil mayda avf etilgach, u Orenburgga boradi va 1918 yil noyabrda Boshqirdiston Muxtoriyati hukumatini tuzishda faol ishtirok etadi.\n Ubaydulla Xo‘jayev sovet rejimi tomonidan bir necha marta (1918, 1929, 1931, 1938) qamoqqa olingan. Toshkentda singlisining uyida muhtojlikda yashagan. Ingliz yozuvchisi J.R.Kiplingning mashhur “Maugli” asarini o‘zbekchaga tarjima qilgan. U oxirgi marta 1938 yil 20 fevralda Toshkentda hibsga olinib, SSSR NKVD maxsus kengashining qarori bilan 1939 yil 14 mayda 8 yil muddatga mehnat tuzatish lageriga hukm qilingan. U o‘sha kuni Gorkovsk temir yo‘li Kotlas stansiyasiga jazoni o‘tash uchun jo‘natilgan. U Kotlasdagi qamoqxonada 1942 yil 31 oktyabrda halok bo‘ldi. O‘limidan keyin sovet hokimiyati tomonidan oqlangan. Ubaydulla Xo‘jayev singlisining o‘g‘li, ya’ni jiyani bo‘lgan O‘zbekiston xalq yozuvchisi Shukrullo (1921-2020) “Tirik ruhlar” (1999) romanida o‘z tog‘asi Ubaydulla Xo‘jayev faoliyatini hamda “Kafansiz ko‘milganlar” (1990) xotira-qissasida qatag‘on qilingan yurtdoshlarimiz qismatini yoritgan."
        },
        "obidjon": {
            "text": "Obidjon Mahmudov",
            "dob": "1878-1942-yillar",
            "about1": "Obidjon Abduxoliqovich Mahmudov [Obid chatoq] – Turkistondagi jadidchilik harakatining vakili, davlat va jamoat arbobi, yirik sarmoyador va noshir.Obidjon Mahmudov 1871-yil Margʻilonda tugʻilgan. Uning otasi Abduxoliq Abduqodirbek oʻgʻli boʻlib, Buxoro amirligida toʻpchiboshi lavozimida ishlagan. Abduxoliq Abduqodirbek oʻgʻli bir doʻstining taklifiga binoan Margʻilonga mehmonga borganida, otdan yiqilib oyogʻi singan va shifo topguniga qadar uning xonadonida yashashga majbur boʻlgan. U shu vaqtda doʻsti Mirzayunusning Robiya degan yaqin qarindoshiga uylanib, shu yerda yashab qolgan. Abduxoliq va Robiyaning farzandi Obidjon Mahmudov edi. Ularning toʻngʻich oʻgʻli Mirodil Qoʻqonning Shayxon mahallasidan uy-joy sotib olgach, Obidjon ham shu yergakoʻchib keladi. Shu yerda madrasa taʼlimini oladi. Darsdan boʻsh paytlarida moʻmchilik bilan shugʻullangan akasiga yordam berib, undan moʻmchilik hunarini, pochchasi Mirzakarim zargardan esa savdo-sotiqning sir-asrorlarini qunt bilan oʻrganDI.\n Obidjon Mahmudov Qoʻqonga koʻchib kelib, madrasa taʼlimini oldi. U Kaspiy dengizidagi Cheleken yarim oroliga borib, neft qazib olish bilan shugʻullandi va boyib ketdi[2]. Obidjon Mahmudovning tez orada Qoʻqonning yirik boylaridan biriga aylanishi Rossiya imperiyasining maxsus politsiyasi boʻlmish – Turkiston rayon muhofaza boʻlimi tomonidan doimiy kuzatuvda boʻlishiga sabab boʻlgan. Obidjon  Mahmudov  1897-1901-yillarda  Sankt-Peterburg universitetining togʻ-kon muhandisligi fakultetini tugatgan. U  togʻ-kon boʻyicha yirik mutaxassis boʻlib, keyinchalik davlat arbobi, oʻzbek hamda rus tillarida ijod etgan adib, arab, turk tillarining bilimdoni, iqtisod, geologiya fanlari sohasida oʻziga xos bilimga ega boʻlgan yetuk shaxs boʻlib yetishadi.. \n Qoʻqonga qaytgach, togʻ- kon sanoati bilan shugʻullanib, Fargʻona vodiysida koʻplab neft konlarini ochishda ishtirok etdi.Shoʻrsuvdagi oltingugurt konini sotib olgan.Oʻqishni bitirganidan soʻng Qoʻqonga qaytib, neft konlarida ish boshlaydi.Karmana, Shoʻrsuv, Sariqqoʻrgʻon, Polvontosh, Olamushuk, Mumkonsoy kabi hududlardagi konlarda faoliyat olib borib, 1905 - yilda hukumat tomonidan neft va ozokerit 23 ishlanmalarini oʻrganish uchun Ozarbayjonga yuboriladi.U yerda tajriba orttirib qaytganidan soʻng, barcha konlarda neft qazib chiqarish bilan shugʻullanad.\n Tarixchi N.Komilovning fikricha, O.Mahmudov boshchiligidagi bir guruh sarmoyadorlar 1906 - yil 15 - noyabrda Qoʻqon birja jamiyatini tashkil etishgan. 1907 - yil 9 - yanvarda birja jamiyati raisi A.I.Vegel va Obidjon Mahmudov boshchiligidagi 60 nafar aʼzo Fargʻona viloyati harbiy gubernatori Pokotilo Vasiliy Ivanovich(10.12.1904 –  28.07.1907)dan Qoʻqon birja jamiyatini tashkil etish toʻgʻrisida ruxsat soʻrashgan.\n Jamiyatning 60 nafardan iborat aʼzosi 1906 - yil 15 - noyabrda Qoʻqon shahrida yigʻilib, Qoʻqon birja jamiyatni tashkil etish toʻgʻrisidagi qarorni koʻrib chiqishadi.Ushbu yigʻilishda birja jamiyatining Nizomi ishlab chiqilib, aʼzolik badallari ham kiritiladi.Jamiyat aʼzolari 1907 - yil 2 - yanvar kuni ham yigʻilishib, Nizomning 46 - bandiga koʻra jamiyat aʼzolarining 2 / 3 qismi birja jamiyatini tashkil etish uchun ovoz berganini eʼlon qilishadi[5].Keyinchalik 1907 - yilda 2299 - sonli xat bilan Fargʻona viloyati harbiy gubernatori Rossiya imperatori Nikolay II nomiga xat yoʻllab, birja jamiyati tuzilganligi toʻgʻrisida hisobot beradi.Qolaversa, birja jamiyati faoliyati uchun Nizom ishlab chiqilgan boʻlib, uni tayyorlashda O.Mahmudovning hissasi katta boʻlgan.Xususan, u rus boylaridan I.Larin, A.Smirnov, R.Ribakov, A.Uvalyev, A.Korotkovlar, shuningdek, oʻzbek filantroplaridan A.Samandarov, I.Qosimbekov, Mulla Bobojon Sharifboyev, Mulla Sulaymonqul kabi yaqin doʻstlari bilan bu ishga bosh - qosh boʻlgan.Ushbu nizomda jamiyatning maqsad va vazifalari, ochiq birja savdolarini oʻtkazish, Turkistonga kirib kelayotgan mahsulotlarning yagona narxini belgilash, narxlarni suniy oshishiga yoʻl qoʻymaslik kabi masalalar koʻrsatilgan.\n Nizomga muvofiq birja jamiyati quyidagi asosiy prinsiplar asosida ishlashi belgilangan edi: 1) birja savdolarining ochiqligi va oshkoraligi; 2) birja savdolarida narxlarni shakllantirish erkinligi; 3) birja bitimlarining ixtiyoriyligi; 4) birja barcha aʼzolarining birja savdolarida ishtirok etishida oʻzaro tengligi; 5) faqat oldindan belgilangan joyda va birjada bitimlar tuzish.\n Yuqoridagi prinsiplar asosida jamiyatning mahalliy millatga mansub vakillari birja savdolarida ruslarning noqonuniy harakatlarini tartibga solib turishgan.Qolaversa, iqtisodiy nuqtayi nazardan Turkistonda tashkil etilishi lozim boʻlgan muxtoriyatning iqtisodiy asoslarini barpo etishgan.\n Obidjon Mahmudovning faoliyatida asosiy yoʻnalishlardan biri bu noshirchilik edi.U bu sohada ham juda koʻp ishlarni amalga oshirganligini alohida taʼkidlash lozim. 1913 - yili Obidjon Mahmudovning Fargʻona oblasti gubernatori A.I.Gippiusga murojaatiga koʻra, 5685 - sonli guvohnoma bilan gazeta faoliyatiga ruxsat berilgan.Hujjatda keltirilishicha, 1906 - yil senzura va noshirlik toʻgʻrisidagi Nizomning 114 - moddasi asosida ― \"Nashri Obidjan\" deb nomlangan mahalliy gazetani Qoʻqon shahrida haftasiga 3 - marta chop etish mumkinligi koʻrsatilgan.Gazetaning eʼlonlar, agentlik telegrammalari, boshqa gazetalardan xabarlarni qayta chop etish, tijorat va sanoat maʼlumotlari, yangiliklar va kashfiyotlar, voqea - hodisalar, hukumat buyruqlari va eʼlonlari asosida nashr etishga ruxsat berilgan.Gazeta faoliyatiga noshir va masʼul muharrir Obidjon Mahmudovning oʻzi edi.Gazeta oʻz faoliyatini yoʻlga qoʻygach, 1914 - yil 1 - avgustda Obidjon Mahmudov yana bir bor harbiy gubernatorga iltimosnoma yuboradi.Unda Evropa davlatlarining tinchlik va osoyishtalikni buzish borasidagi siyosati Buyuk Rossiyaning ularni daf qilish istagi bilan yagona qudratli oqimga, yakdil fikrga birlashganligi, bunday tarixiy davrda matbuot xizmati va uning vazifalari davlatning tinch - osoyishta paytlariga qaraganda yanada masʼuliyatli va murakkabroq hisoblanishi, xabarlar oqimi juda tez kelayotganligi, matbuot vazifalarini toʻliq bajarish, shuningdek, urush davri voqealari bilan ortgan jamoatchilik talablarini qondirish uchun rus tilida ― \"Ferganskoye exo\" va oʻzbek tilda ― \"Sadoi Fargʻona\" gazetalarini joriy dasturga muvofiq har kunlik qilib nashr etishga ruxsat berishini iltimos qiladi.Ushbu xatga javoban Fargʻona oblasti harbiy gubernatorining buyrugʻi chiqarilib, unga koʻra Obidjon Mahmudov nashriyotiga berilgan 5685 - sonli guvohnoma bekor qilinib, yangi nomdagi ― \"Sadoi Fargʻona\" gazetasi chop etiladigan boʻldi.Shunday qilib, 1914 - yildan rus tilida ― \"Ferganskoye exo\" va oʻzbek tilda ― \"Sadoi Fargʻona\" gazetalarini nashr etish boshlandi.Obidjon  Mahmudov  Fargʻona vodiysidagi jadidchilik harakatida faol qatnashgan va ularni moddiy jihatdan taʼminlab turgan.Qoʻqonda 1914 - yili bosmaxona tashkil qilgan.Bundan tashqari, Obidjon Mahmudov \"Tirik soʻz\" (1917) gazetasining muharriri va noshiri edi.U matbuotda dolzarb masalalar bilan chiqib, Turkiston xalqini maʼrifatli boʻlishga chaqirgan, uni ozodlik uchun kurashga daʼvat etgan[6].\n Obidjon  Mahmudov  faoliyatining asosini mamlakatning iqtisodiy mustaqillikka erishishini taʼminlash tashkil etgan.U \"Sadoi Fargʻona\" gazetasida Turkiston iqtisodiyotiga oid bir necha maqolalar eʼlon qilgan va ularda oʻlkaga kapitalistik iqtisodiy munosabatlarning kirib kelishi, adolatsizlik va  suiisteʼmolchiliklar  xalqning  tobora  tinka - madorini  qurita borayotganligini taʼkidlagan.Uning \"Eski asrdan bir mazmun\" nomli maqolasida chorizm mustabid hokimiyati oʻlkaning iqtisodiy ahvolini ogʻirlashtirib, mahalliy xalqlarning milliy qadr - qimmatini yerga urganligini afsus bilan taʼkidlaydi.\n Shuningdek, Obidjon Mahmudov qoʻl mehnatiga asoslangan mayda ishlab chiqarish mashinalashgan sanoat ishlab chiqarish bilan raqobat qila olmasligini taʼkidlab, ish  tanazzulga  yetib  bormasidan  ishlab  chiqarishni zamonaviylashtirish lozimligini taʼkidlaydi.Zero, eski  usuldagi  iqtisodiy  mexanizmlar Turkistonning  kelajagini  belgilab  bera  olmasligini, mustamlakachi hukumatning mamlakat boyliklarini tashib ketayotganligini ich - ichidan his qilgan holda bu borada koʻplab murojaatlar qilgan.Obidjon Mahmudovning bir maqolasida mahalliy bank ochish muammosiga eʼtibor qaratilib, unda mamlakatda dehqonlarni qarzdorlikdan qutqarish, qishloq xoʻjaligini rivojlantirish uchun ularga kredit ajratish lozimligi aytilgan.Birinchidan, bu mulkdorlarning boyligini yanada oshishiga, ikkinchidan, agar bank mablagʻi faqat mahalliy boylarning sarmoyalaridan iborat boʻlsa, bankning egasi ham millatning oʻzi boʻlishini, uchinchidan dehqonlar shu kredit orqali qarzdorlikdan xalos boʻlishini taʼkidlaydi.\n Bundan tashqari, Obidjon Mahmudov oʻz maqolalarining birida savdogarchilik, uning oʻziga xos xususiyatlari, afzalliklari toʻgʻrisida ham maʼlumotlar bergan.Uning yozishicha, ilgarigi zamonlarda savdogar ahli nufuzli tabaqa sifatida jamiyatda oʻz oʻrniga ega boʻlgan.Ular oʻz faoliyatlarini shariat belgilab bergan normalar asosida olib borganlar.Yaʼni, sharʼan harom deb sanalgan ribo – sudxoʻrlik kabi xislatlar mahalliy savdogarchilik uchun yot hodisa ekanligini taʼkidlagan.Shuningdek, Obidjon Mahmudov maqolalarining birida qogʻoz ishlab chiqarish hunarmandchiligi toʻgʻrisida ham oʻz fikrlarini bayon etgan.Milliy qogʻoz ishlab chiqarishning yoʻq boʻlib ketmasligi uchun hukumat rahbarlarini milliy hunarmandchilikning  ushbu turini  rivojlantirishga  ahamiyat berishga chaqirgan[7].\n Shuningdek, Obidjon Mahmudovning \"Sadoi Fargʻona\" gazetasida eʼlon qilgan maqolalarida oʻlkada iqtisodiy munosabatlarda adolatsizlik va suiisteʼmolchiliklar hamda Yevropa bank va firmalarining asl basharasini ochib tashladi: ...Oqcha kerak boʻlsa Fargʻonaga kel va yuringlar deb bir necha kunda: 25 firma,10 bank, 5 - 10 komissionniy konturalar ochilub, oʻn, yigirma tarafdan oqchani tortaverdilar...Bank va firmalar faqat Nizomga toʻgʻri kelturub ishlarini oʻzlari xohlaganlaricha qilub, qancha insofsizlik qila bilsalar qildilar[8].\n Obidjon Mahmudov oʻz maqolalarida iqtisodiy masalalardan tashqari oʻlkadagi ijtimoiy muammolarga ham qaratgan.Uning taraqqiyparvarlik gʻoyalarida dinning inson maʼnaviy kamolotidagi oʻrnini toʻgʻri tushunish, bozor munosabatlarining shakllanish  jarayonlarini  faollashtirish, taraqqiyparvar  demokratik institutlarni vujudga keltirish, oʻlkada oʻziga xos milliy rivojlanishni shakllantirish, shuningdek, noshirlik faoliyatini rivojlantirish kabi muhim tarixiy vazifalarni amalga oshirishga harakat qilgan.Bu vazifalarni amalga oshirishning muhim shartlari – islom tushunchasini yangilash, uni mutaassiblikdan tozalash, fan yutuqlari va ilgʻor texnologiyani egallash muammolarini hal etish edi[9].\n Obidjon Mahmudov oʻzining maqolalarida ayrim – diniy ulamolarning oʻz manfaatlari yoʻlida islom mohiyatini buzib koʻrsatganliklarini tanqid qiladi va jamiyatdagi mavjud illatlar ogʻir oqibatlarga olib kelishini koʻrsatib beradi.Qolaversa, u taʼlim, iqtisod, madaniyat va umuman jamiyat hayotining barcha sohalarini isloh qilish zaruratini tushuntirishga intilgan.Uning fikrlari milliy doirada chegaralanmay, Yevropaning texnologik jihatidan Sharqqa nisbatan ancha ilgarilab ketganligini hisobga olgan holda Gʻarb sivilizatsiyasining muhim jihatlarini eʼtirof etgan.Shuningdek, uning gʻoyalarida asosiy eʼtibor butun ijtimoiy va iqtisodiy tizimni oʻzgartirish, taʼlim - tarbiyani yangilashga qaratilgan.Xususan, u yangi usuldagi maktablarni tashkil etish, gazetalar chiqarish, darslik va oʻquv qoʻllanmalarni nashr etish, iqtisodiy mustaqillik, Yevropa madaniyati yutuqlaridan foydalanishni targʻib etish orqali milliy dunyoviy taʼlimni yuzaga keltirish, maʼnaviy hayotni yangilash va boyitish, milliy oʻzlikni anglashni yuksaltirish lozimligini uqtiradi[10].\n Milliy taraqqiyparvarlik harakatining yetakchilaridan biri sifatida qoloqlik, turgʻunlik, savodsizlik va jamiyatning boshqa mavjud kamchiliklariga qarshi kurash olib borgan Obidjon Mahmudov islohotlar orqali din va shariat asoslarini saqlab, islomni yangi sharoitlarga moslashtirishni va milliy, dunyoviy  muammolarni  hal  qilishda  Yevropa  madaniyati yutuqlaridan foydalanishni, Rossiya imperiyasi mustamlakachilik siyosatining talonchilik mohiyatini chuqur anglab, unga qarshi xayriya jamiyatlari, nashriyot muassasalari hamda yangi iqtisodiy mexanizmlar(birja, bank) asosida mamlakatni rivojlantirish, xalqni maʼrifat va ilmli qilish yoʻlida katta jasorat koʻrsatgan fidoyi shaxs edi[11]. Obidjon Mahmudovning \"Sadoi Fargʻona\" gazetasida turli reklamalar, fabrika va zavodlar haqida ham maʼlumotlar chop etilgan.Shuningdek, toʻy va maʼrakalar dabdaba hamda oʻzini koʻz - koʻz qilish vositasiga aylanib borayotgani, bu illatdan voz kechish kerakligi qoʻp bor taʼkidlangan va unga qarshi aniq choralar koʻrilgani ham yozilgan.Tibbiyotga oid maʼlumotlar va eʼlonlar berib borish ham gazeta faoliyatining muhim sohalaridan biri boʻlgan.Chunki odamlarning koʻpchiligi tabiblar tomonidan davolangan boʻlib, jamiyatda tibbiy madaniyat tushunchasi yetarli darajada rivojlanmagan edi.Shu sababli, gazetada xususiy shifoxona xizmatlari haqida, davolovchi shifokorlar xizmatidan foydalanish haqida ham koʻplab reklamalar berilgan[12]. Obidjon Mahmudov 1917 - yilda Qoʻqon shahar Dumasi raisi oʻrinbosari qilib saylandi[13].U  umri  davomida  Qoʻqonning  har  taraflama rivojlanishi uchun harakat qilgan va bu yoʻlda bilim, qobiliyatini ayamagan.Bu haqda Obidjon Mahmudovga zamondosh va maslakdosh boʻlgan Mustafo Choʻqay oʻzining esdaliklarida quyidagi fikrlarni aytib oʻtadi: Obidjon Qoʻqon shahar dumasi rais oʻrinbosari etib saylanganidan soʻng, bu yerda samarali ijod qildi.U shahar obodonchiligiga daxldor hamma narsada Yangi Qoʻqon bilan Eski Qoʻqonning bir xil rivojlanishi uchun kurashdi[14].\n 1917 - yil 14 - martda \"Shoʻroi Islomiya\" tashkilotining tashkil etilishi muxtoriyat tuzish yoʻlida dastlabki qadamlardan edi.Obidjon Mahmudov tashkilot faoliyatini olib borishda va uni rivojlantirishga katta hissa qoʻshdi. \"Shoʻroi Islomiya\" tashkiloti va uning faoliyati haqida Obidjon Mahmudov 1926 - yil 21 - aprelda qamoqqa olinishi paytidagi soʻroq bayonnomasida batafsil koʻrsatma bergan.Bu tashkilot gʻoyalari Turkistonga, xususan, Fargʻonaga tatar maʼrifatparvari Galimjon Borudiy tomonidan olib kelingan. 1917 - yil 25 - mayda Qoʻqonda Fargʻona viloyati musulmonlari qurultoyi boʻlib oʻtadi.Qurultoy rayosatiga O.Mahmudov, S.Akayev, K.Raxmonberdiyev, T.Norboʻtabekov, A.Ziyoyev, Ya.Yaxyoxonov, A.Umarboyevlar saylanadilar.Obidjon Mahmudov boshchiligidagi jadidlar xalqni \"Shoʻroi Islomiya\" atrofida birlashishga chaqiradilar. 1917 - yil 12 - 14 - iyulda Skobelev shahrida viloyat musulmonlari tashkilotlarining qurultoyi boʻlib oʻtgan.Unda \"Turk adami markaziyat firqasi\" tashkil  etilgan.Yigʻilishda  firqa(partiya)ning  Dasturi(maromnomasi) va Nizomi qabul qilingan boʻlib, ushbu masalada Obidjon Mahmudov katta rol oʻynagan[15].Mustafo Choʻqay boshchiligidagi Milliy Markaz 1917 - yil noyabr oyi boshlarida Toshkentdan Qoʻqonga koʻchib kelgach, Obidjon Mahmudovning hovlisida joylashganlar. 1917 - yil 26 - noyabrda Turkiston oʻlkasi musulmonlarining favqulodda IV syezdida Obidjon Mahmudov 150 kishilik Qoʻqon delegatsiyasining raisi sifatida Turkiston Muxtoriyati tuzilishi uchun barcha jadidlar kabi harakat qildi, keyinchalik 13 kishidan iborat syezd hayʼatining aʼzosi sifatida esa u qurultoy aʼzoligiga viloyat, ayrim diniy hamda milliy guruhlar boʻyicha emas, balki bilimdon va ishchan kishilarni tanlash asosida kiritish lozimligini taklif etdi.Obidjon Mahmudov Turkiston Muxtoriyati tashkil etilgandan soʻng oziq - ovqat vaziri boʻlib ishladi va faoliyati davomida xalq farovonligi uchun bor kuchi, bilimi hamda aql - zakovatini ayamadi.Oʻz bosmaxonasini muxtoriyat hukumati ixtiyoriga topshirdi.Bosmaxonada Turkiston Muxtoriyati hukumatining oʻzbekcha va ruscha gazetalari chop etilgan.Turkiston Muxtoriyati Muvaqqat hukumatining  xalq  ommasiga  murojaatini  eʼlon  qilishda  Obidjon Mahmudovning roli katta boʻlgan[16].\n Turkiston Muxtoriyati tugatilishi arafasida Obidjon Mahmudov Kavkazdan gʻalla mahsulotlari olib kelishi kerak boʻlgan.Biroq, sovet hukumati bilan qonli toʻqnashuvlar sababli Kavkazga ketolmay Buxoroda qolib ketadi[17].Sovet hokimiyati tomonidan 1918 - yil fevralda muxtoriyat hukumati tugatilgach, Mustafo Choʻqayning yozishicha, O.Mahmudov Buxoroda bolsheviklar qoʻliga tushib qoladi[18].Muxtoriyat agʻdarilgach, uning aʼzolari 3 guruhga boʻlinib ketdi, birinchisi istiqlolchilik harakati tomoniga, ikkinchisi sovetlar tarafiga va uchinchisi muhojir boʻlib xorijga ketgan.Obidjon Mahmudov esa ana shu sovetlar tarafiga vaqtinchalik oʻtishga majbur boʻlganlardan biri edi. 1918 - yil mayda Turkiston Muxtoriyati hukumati aʼzolari sovet hokimiyati tomonidan avf etilgan[19]. Obidjon Mahmudov 1918 - yil oktyabrdan – 1919 - yil may oyigacha Turkiston Avtonom Sovet Sotsialistik Respublikasi Markaziy ijroiya Qoʻmitasining Moskvadagi vakolatxonasida matbuot boʻlimi muharriri va boʻlim boshligʻi, 1919 - yil maydan – 1920 - yil aprelgacha TASSR MIQning Moskvadagi vakolatxonasida paxta ishlari boʻlimida mutaxassis, 1920 - yil aprel – 1921 - yil maygacha TASSR MIQning Moskvadagi vakolatxonasida Tashqi aloqalar boʻlimi mutaxassisi, 1921 - yil  may  –  1921 - yil  oktyabrgacha  Toshkentda(Turkkomissiya)ning axborot boʻlimida mutaxassis, 1921 - yil oktyabridan Bokuda tashkil etilgan ― Sharq xalqlari harakati va tashviqoti rayosatiga aʼzo sifatida faoliyat olib boradi. Obidjon Mahmudov Moskvada ishlashiga qaramay, Turkistonda faoliyat yuritayotgan turli tashkilotlarga rahbarlik  qildi, ularning  rivojlanishida  katta  rol  oʻynadi.U  Munavvarqori Abdurashidxonov va Sadriddinxon  Sharifxoʻjayevlar tashabbusi bilan Toshkentda tashkil etilgan \"Milliy Ittihod\" (\"Ittihodi taraqqiy\") tashkilotining Qoʻqon shoʻbasiga boshchilik qildi.Shuningdek, Obidjon Mahmudov Anvar Poshshoning imzosi va “Mujoxidi  Islom  Anvarbey”  yozuvli  muhri  boʻlgan  instruktorlik guvohnomasiga ega boʻlib, tashkilot aʼzolariga siyosiy bilimlar bergan.\n Obidjon Mahmudov 1921 - yili “Nashri maorif” jamiyatining tashkil etilishida ham tashabbuskorlardan boʻlgan.Turkistonlik yoshlarni Berlinga joʻnatish va kommunistik kayfiyatdan holi qilib tarbiyalash maqsadida “Nashri maorif” jamiyatining aʼzolari tarkibiga Toshkent, Buxoro, Samarqand va boshqa hududlardan hukumatning deyarli barcha aʼzolari kirgan.Jamiyat aʼzolari Berlinda oʻqiyotgan talabalar bilan xat orqali bogʻlanib turishgan.Talabalar bir necha marta oʻz xatlarida moddiy ehtiyojlarini bayon qilishgan va jamiyat aʼzolari turkistonlik talabalarga moddiy yordam koʻrsatish masalasini muhokama qilishgan.Obidjon Mahmudov 2 nafar talabani oʻz hisobidan oʻqitgan. Obidjon Mahmudov Turkistonda istiqlolchilik harakatini ham qoʻllab - quvvatlagan.Turkiston Muxtoriyati tugatilganidan soʻng, sovet hukumatiga qarshi kurashni aynan istiqlolchilar bilan birgalikda pinhona davom ettirgan, ularning ayrim uchrashuvlarini oʻz uyida tashkil etgan.Ergash qoʻrboshi, Isroilbek qoʻrboshilar bilan aloqada boʻlib, ularni moliyaviy jihatdan qoʻllab - quvvatlab turgan[20]. 1921 - yilning noyabrida Obidjon Mahmudov Turkistonda ingliz - yapon intervensiyasini tashkillash va “bosmachilar” bilan aloqa oʻrnatganlikda, noqonuniy  ishlar  bilan  shugʻullanganlikda, yashirin  yigʻilishlar uyushtirganlikda, sovetlarga  qarshi  tizimli  tashviqot  ishlari  olib borganlikda ayblanib hibsga olingan.Ammo Obidjon Mahmudov oʻz ixtiyoridagi barcha mol - mulklaridan  voz kechish evaziga hibsdan ozod qilingan. Obidjon Mahmudov qamoqdan chiqqach, yana oʻz kasbi mumchilik bilan mashgʻul boʻladi.Davlat organlari lavozimlarida faoliyat koʻrsatish ilinjida 1921 - yilning dekabridan 1922 - yilning avgustiga qadar Buxoro Xalq Sovet Respublikasi Savdo - sanoat vazirligi Tashqi savdo boʻlimi xodimi sifatida xizmat qila boshlaydi.",
            "about2": "Obidjon Mahmudov 1926 - yili OGPU Kollegiyasining qaroriga muvofiq, 5 yilga qamoq jazosiga hukm qilinadi. 1926 - yil may oyida uning RSFSR MIQ raisi M.I.Kalininga yozgan xati inobatga olinib, 6 oydan soʻng barcha mol - mulklari musodara boʻlish evaziga qamoqdan ozod etiladi. Qamoqdan chiqqach, Shoʻrsuvdagi neft konida ijarachi sifatida ishlab, umrining oxirigacha oʻz sevgan kasbi bilan shugʻullanadi. 1933 - yilda Obidjon Mahmudovning Moskvada boʻlib oʻtgan Butunittifoq qishloq xoʻjalik koʻrgazmasiga Fargʻona viloyatidan topilgan togʻ qazilmalari namunalarini olib borib, koʻrgazmada togʻ - kon injeneri sifatida yana bir bor ishtirok etishi uning bizga maʼlum boʻlgan oxirgi faoliyatidan biridir.Obidjon Mahmudov 1936 - yil 21 - noyabrda endokardit kasalligi bilan vafot etadi.Marhum Qoʻqonning “Shayxon” qabristoniga dafn qilingan[21].\n Qoʻqon jadidlarining yetakchisi, yirik maʼrifatparvar, noshir hamda geolog olim Obidjon Mahmudov ham el - yurt ravnaqi, yurt istiqboli yoʻlida xizmat qilgan.Uning taraqqiyparvarlik gʻoyalarida dinning inson maʼnaviy kamolotidagi oʻrnini toʻgʻri tushunish, bozor munosabatlarining shakllanish  jarayonlarini  faollashtirish, taraqqiyparvar  demokratik institutlarni vujudga keltirish, oʻlkada oʻziga xos milliy rivojlanishni shakllantirish, shuningdek, noshirlik faoliyatini rivojlantirish kabi muhim tarixiy vazifalarni amalga oshirishga harakat qilgan.Shuningdek, Obidjon Mahmudov xalqning turmush sharoitini yaxshilash uchun mustamlaka – feodal zulmi va ogʻir majburiyatlardan xalos boʻlish, iqtisodiy mustaqillikka erishish zarur, degan gʻoyani ilgari surdi.U oʻlka ijtimoiy hayotini yaxshi bilishi, shuningdek, odamlarni qiynayotgan muammolarni sezishi va shu yurt farzandi sifatida jamiyatda vujudga kelgan muammolarni hal qilishda jonbozlik koʻrsatgan.Turkistonda maʼrifatparvarlikning rivojlanishiga munosib hissa qoʻshgan shaxs sifatida u millatning yashashi, taraqqiy topishi uchun kurashgan taraqqiyparvar va ziyoli inson edi."
        }
    },
    "ArticleCreated": "Maqola yaratildi",
    "ArticleNotCreated": "Maqola yaratilmadi"
}